//rarus tenkam 20.06.2016 mantis 6926 ++
&НаКлиенте
Процедура КомандаОК(Команда)
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		//rarus FominskiyAS 19.04.2019  mantis 14191 +++
		//Сообщить("Файл не выбран!");
		Сообщить(Нстр("ru = 'Файл не выбран!'; en = 'The file is not selected!'"));
		//rarus FominskiyAS 19.04.2019  mantis 14191 ---
		Возврат;	
	КонецЕсли;
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ПутьКФайлу", ПутьКФайлу);
	Закрыть(ПараметрыНастройки);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	Фильтр = НСтр("ru = 'Таблица XLS (*.xls)|*.xls'"); 
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииДиалогаВыбораФайла", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииДиалогаВыбораФайла(ВыбранныйФайл, Параметры) Экспорт
	
	Если ВыбранныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныйФайл[0];
	ПутьКФайлу = ПолноеИмяФайла;

КонецПроцедуры




