
Функция СемействоОпцииПоТипуОпции(ТипОпции) Экспорт //rarus BProg_Gladkov 11.12.2019 0014560 +-
	Если НЕ ЗначениеЗаполнено(ТипОпции) тогда
		Возврат Справочники.Scan_ОпцииПродуктов.ПустаяСсылка();
	КонецЕсли;
	
	СемействоОпции = ПредопределенноеЗначение("Справочник.Scan_ОпцииПродуктов." + ТипОпции.ИмяПредопределенныхДанных);
	Возврат СемействоОпции; 
КонецФункции

Функция ТипОпцииПоСемействуОпции(СемействоОпции) Экспорт //rarus BProg_Gladkov 11.12.2019 0014560 +-
	Если НЕ ЗначениеЗаполнено(СемействоОпции) ИЛИ НЕ ЗначениеЗаполнено(СемействоОпции.ИмяПредопределенныхДанных) тогда
		Возврат Справочники.Scan_ТипыОпций.ПустаяСсылка();
	КонецЕсли;
	
	ТипОпции = ПредопределенноеЗначение("Справочник.Scan_ТипыОпций." + СемействоОпции.ИмяПредопределенныхДанных);
	Возврат ТипОпции; 
КонецФункции

//rarus vikhle 25.06.2020 mt 15888 +++
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если Данные.Ссылка = Справочники.Scan_ОпцииПродуктов.Нет_FFU ИЛИ Данные.Ссылка = Справочники.Scan_ОпцииПродуктов.Нет_SOrder Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Ссылка.Наименование;		
	КонецЕсли;
КонецПроцедуры
//rarus vikhle 25.06.2020 mt 15888 ---