
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") тогда //rarus BProg_Gladkov 11.12.2019 0014560 +-
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ЗначениеЗаполнено(ТипОпции) тогда 
			Родитель = Справочники.Scan_ОпцииПродуктов.СемействоОпцииПоТипуОпции(ТипОпции);
		ИначеЕсли ЗначениеЗаполнено(Родитель) тогда
			ТипОпции = Справочники.Scan_ОпцииПродуктов.ТипОпцииПоСемействуОпции(Родитель);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда //rarus bonmak 19.12.2019 15532
		Если  ТипОпции <> Справочники.Scan_ТипыОпций.БазовыеОпции //rarus bonmak 19.12.2019 15532 
			И ТипОпции <> Справочники.Scan_ТипыОпций.ЛокальныеОпции //rarus agar 24.07.2020 16123 +-
			Тогда
			Если Родитель <> Справочники.Scan_ОпцииПродуктов.СемействоОпцииПоТипуОпции(ТипОпции) тогда //rarus BProg_Gladkov 11.12.2019 0014560 +-
				ТекстСообщения = НСтр("ru = 'Семейство опций не соответствует типу опции.'; 
				|en = 'The family name does not match the option type.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Родитель", , Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
