//rarus vikhle 15.06.2020 mt 15888 +++
Функция ЗаписьЗначенияРегистраСведенийИсторияКомпаний(Компания,Значение,ВидЗначения,Дата = Неопределено) Экспорт
	Отказ = Ложь;
	Если Дата = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = Дата;
	КонецЕсли;
	
	СтруктураОтбора   = Новый Структура("Компания,ВидЗначения", Компания,ВидЗначения);
	СтруктураСведений = РегистрыСведений.Scan_ИсторияКомпаний.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
	ЗначениеСтарое    = СтруктураСведений.Значение;
	Записывать        = Ложь;
	
	//Введено значение, а старое отсутствует
	Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое = Неопределено Тогда 
		Записывать = Истина; 
	КонецЕсли; 
	//Значение стерто, а старое значение было введено
	Если НЕ ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда 
		Записывать = Истина; 
	КонецЕсли; 
	//Введено значение и было введено старое
	Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда
		//Значение изменилось
		Если Значение <> ЗначениеСтарое Тогда 
			Записывать = Истина; 
		КонецЕсли; 
	КонецЕсли; 
	Если Записывать Тогда
		//Значение параметра изменилось
		НоваяЗапись = РегистрыСведений.Scan_ИсторияКомпаний.СоздатьМенеджерЗаписи();
		НоваяЗапись.Компания	  	= Компания;
		НоваяЗапись.ВидЗначения     = ВидЗначения;
		НоваяЗапись.Значение        = Значение;
		НоваяЗапись.Период          = ДатаЗаписи;
		НоваяЗапись.Пользователь    = Пользователи.ТекущийПользователь();
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			Сообщить(НСтр("ru = 'Ошибка записи реквизита компании в регистр сведений'; en = 'Error writing company details to the information register'"));
			Отказ = Истина;
		КонецПопытки; 
	КонецЕсли;
	Возврат Отказ;
КонецФункции
//rarus vikhle 15.06.2020 mt 15888 ---