
&НаКлиенте
Процедура ОтобразитьВсеКонтактныеЛица(Команда)
	Элементы.ФормаОтобразитьВсеКонтактныеЛица.Пометка = НЕ Элементы.ФормаОтобразитьВсеКонтактныеЛица.Пометка;
	
	Если Элементы.ФормаОтобразитьВсеКонтактныеЛица.Пометка Тогда 
		//Если кнопка нажата
		Для Каждого ТекЭлементОтбора Из Список.Отбор.Элементы Цикл
			ТекЭлементОтбора.Использование = Ложь;	
		КонецЦикла;
	Иначе
		Для Каждого ТекЭлементОтбора Из Список.Отбор.Элементы Цикл
			ТекЭлементОтбора.Использование = Истина;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
// rarus tenkam 21.08.2017 mantis 10880 ---

//rarus agar 09.03.2021 17372 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаОтобразитьВсеКонтактныеЛица.Видимость = (Список.Отбор.Элементы.Количество() <> 0); 
	
	Если Параметры.Свойство("ОтображатьВсеКонтактныеЛица") Тогда
		Элементы.ФормаОтобразитьВсеКонтактныеЛица.Видимость = Параметры.ОтображатьВсеКонтактныеЛица;
	КонецЕсли;
	
	//rarus agar 13.04.2021 17622 ++
	ОтображениеФиксированногоОтбора();
	//rarus agar 13.04.2021 17622 --
	
КонецПроцедуры
//rarus agar 09.03.2021 17372 --

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_КонтактныеЛица.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --
