
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Заполнение отборов переданных из выбора
	Если Не ПараметрыСеанса.ТекущийПользователь.ПользовательСотрудник Тогда
		ТаблицаКомпаний = РегистрыСведений.Scan_КомпанииПользователей.ПолучитьКомпаниюДилераПользователя(ПараметрыСеанса.ТекущийПользователь);//rarus vikhle 24.03.2021 убрал 2й параметр
		//rarus vikhle 24.03.2021 +++
		МассивКомпаний = ТаблицаКомпаний.ВыгрузитьКолонку("Компания");
		//Дилер = Справочники.Scan_Компании.ПустаяСсылка();
		//Если ТаблицаКомпаний.Количество()>0 Тогда
		//	Дилер = ТаблицаКомпаний[0].Компания;
		//	Контрагент = ТаблицаКомпаний[0].Контрагент;
		//КонецЕсли;
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Дилер", Дилер,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Дилер", МассивКомпаний,
																				ВидСравненияКомпоновкиДанных.ВСписке,,,
																				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		//rarus vikhle 24.03.2021 ---
	КонецЕсли;
	//rarus agar 13.04.2021 17622 ++
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СрокДействияСпециальныхУсловий", НачалоДня(ТекущаяДатаСеанса()),ВидСравненияКомпоновкиДанных.БольшеИлиРавно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,); //rarus vikhle 31.03.2021 m 17570 отбор по началу дня
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СрокДействияСпециальныхУсловий", НачалоДня(ТекущаяДатаСеанса()),ВидСравненияКомпоновкиДанных.БольшеИлиРавно, "Срок действия специальных условий"	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,); //rarus vikhle 31.03.2021 m 17570 отбор по началу дня

	ОтображениеФиксированногоОтбора();
	//rarus agar 13.04.2021 17622 --
	
КонецПроцедуры

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_СпециальныеУсловия.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --
