
Функция ПолучитьКрайнийСрокРазмещенияЗаказНаЗаводПоПартПериоду(ПартПериод) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПартПериод", ПартПериод);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ИнформацияПоPartPeriod.КрайнийСрокРазмещенияЗаказаНаЗавод КАК КрайнийСрокРазмещенияЗаказаНаЗавод
	               |ИЗ
	               |	РегистрСведений.Scan_ИнформацияПоPartPeriod КАК Scan_ИнформацияПоPartPeriod
	               |ГДЕ
	               |	Scan_ИнформацияПоPartPeriod.PartPeriod = &ПартПериод";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КрайнийСрокРазмещенияЗаказаНаЗавод;
	Иначе
		Возврат Неопределено;
	КонецЕсли;		
КонецФункции