
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) //rarus bonmak 08.10.2019 14177 ++
	ТабЧастьОпции = Объект.СписокОпций; 
	Если ТабЧастьОпции.Количество() > 1 Тогда
		НайтиДубли(ТабЧастьОпции, Отказ);			
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура НайтиДубли(ТабЧастьОпции, Отказ) //rarus bonmak 08.10.2019 14177 ++
	ТЗДок = ТабЧастьОпции.Выгрузить();
	ТЗДок.Колонки.Добавить("КоличествоДублей");
	ТЗДок.ЗаполнитьЗначения(1,"КоличествоДублей");
	
	ТЗДок.Свернуть("Опция","КоличествоДублей");
	
	Если ТабЧастьОпции.Количество() <> ТЗДок.Количество() Тогда
		Для Каждого Стр Из ТЗДок Цикл
			Если Стр.КоличествоДублей > 1 тогда
				ТекстОшибки = НСтр("ru = 'По опции '; en = 'By option '") + Стр.Опция + НСтр("ru = ' имеются дубли!'; en = ' there are doubles!'");
				Сообщить(ТекстОшибки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 ---