#Область ОписаниеПеременных
//rarus vikhle 30.08.2021 mt 17933 +++ 
&НаКлиенте
Перем ВыбранныеСсылки;
//rarus vikhle 30.08.2021 mt 17933 ---

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидГрузовыеАвтомобили = Scan_ПраваИНастройки.Scan_Право("ВидПродуктаГрузовыеАвтомобили");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОчередьDD2DDSИнформера,
																			"Продукт.ТипПродукта.ВидПродукта", 
																			ВидГрузовыеАвтомобили, 
																			ВидСравненияКомпоновкиДанных.Равно,,																			
																			Истина,
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
																			Строка(Новый УникальныйИдентификатор));
																			
	Scan_СборСтатистики.Scan_ПриОткрытииОбработки(РеквизитФормыВЗначение("Объект").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//rarus vikhle 30.08.2021 mt 17933 +++
	ВыбранныеСсылки = Новый Массив;
	ОчередьDD2DDSИнформера.Параметры.УстановитьЗначениеПараметра("ВыбранныеСсылки", ВыбранныеСсылки);
	//rarus vikhle 30.08.2021 mt 17933 ---
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ОчередьDD2DDSИнформераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОчередьDD2DDSИнформера.ТекущиеДанные;	
	
	Если Поле = Элементы.ОчередьDD2DDSИнформераЗаявкаНаСОП Тогда
		ПоказатьЗначение(,ТекущиеДанные.ЗаявкаНаСОП);
	ИначеЕсли Поле = Элементы.ОчередьDD2DDSИнформераФлаг Тогда //rarus vikhle 30.08.2021 mt 17933 +++
		мИндекс = ВыбранныеСсылки.Найти(ТекущиеДанные.ЗаказНаЗавод);
		Если мИндекс = Неопределено Тогда
			ВыбранныеСсылки.Добавить(ТекущиеДанные.ЗаказНаЗавод);
		Иначе
			ВыбранныеСсылки.Удалить(мИндекс);
		КонецЕсли;
		
		КоличествоВыбранныхЗаказов = ВыбранныеСсылки.Количество();
		ОчередьDD2DDSИнформера.Параметры.УстановитьЗначениеПараметра("ВыбранныеСсылки", ВыбранныеСсылки);
		//rarus vikhle 30.08.2021 mt 17933 ---
	Иначе
		ПоказатьЗначение(,ТекущиеДанные.ЗаказНаЗавод);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда) //rarus vikhle 30.08.2021 mt 17933 +++
	
	ТЗ = СписокВТЗнаСервере();	
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если ВыбранныеСсылки.Найти(СтрокаТЗ) = Неопределено Тогда
			ВыбранныеСсылки.Добавить(СтрокаТЗ);
		КонецЕсли;
		
		КоличествоВыбранныхЗаказов = ВыбранныеСсылки.Количество();
		ОчередьDD2DDSИнформера.Параметры.УстановитьЗначениеПараметра("ВыбранныеСсылки", ВыбранныеСсылки);
	КонецЦикла;
	
КонецПроцедуры //rarus vikhle 30.08.2021 mt 17933 ---

&НаКлиенте
Процедура СнятьФлажки(Команда) //rarus vikhle 30.08.2021 mt 17933 +++
	
	ВыбранныеСсылки.Очистить();
	КоличествоВыбранныхЗаказов = ВыбранныеСсылки.Количество();
	ОчередьDD2DDSИнформера.Параметры.УстановитьЗначениеПараметра("ВыбранныеСсылки", ВыбранныеСсылки);
		
КонецПроцедуры //rarus vikhle 30.08.2021 mt 17933 ---

&НаКлиенте
Процедура Обработано(Команда) //rarus vikhle 30.08.2021 mt 17933 +++
	
	ОчиститьСообщения();
	
	Если Не ВыбранныеСсылки.Количество() > 0 Тогда
		ВывестиСообщениеПол(Нстр("ru = 'Не выбраны заказы в списке.'"));			
		Возврат;
	КонецЕсли;	
	
	УдалитьЗаписиНаСервере(ВыбранныеСсылки);
	СнятьФлажки(Команды.СнятьФлажки);
	
	ВывестиСообщениеПол(Нстр("ru = 'Выбранные заказы были удалены из очереди DD2/DDS информера.'"));
	
КонецПроцедуры //rarus vikhle 30.08.2021 mt 17933 +++ 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокВТЗнаСервере() //rarus vikhle 30.08.2021 mt 17933 +++
	
	ТаблицаРезультат = ДинамическийСписокВТаблицуЗначений(Элементы.ОчередьDD2DDSИнформера);
	КолонкаСсылок = ТаблицаРезультат.ВыгрузитьКолонку("ЗаказНаЗавод");
	Возврат КолонкаСсылок;
	
КонецФункции //rarus vikhle 30.08.2021 mt 17933 ---	

&НаСервереБезКонтекста
Процедура УдалитьЗаписиНаСервере(Знач МассивЗаказов) //rarus vikhle 30.08.2021 mt 17933 +++
	
	Для Каждого Заказ Из МассивЗаказов Цикл
		РегистрыСведений.Scan_ОчередьDD2DDSИнформера.УдалитьЗаписьПоЗаказу(Заказ);
	КонецЦикла;	
		
КонецПроцедуры //rarus vikhle 30.08.2021 mt 17933 --


#КонецОбласти

