//rarus tenkam 03.10.2017 mantis 9426 ++
//&НаСервере
//Процедура ОбновитьЭлементНаСервере()
//	Если НЕ ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
//		//Создан вручную
//	Иначе
//		ИмяМетода = "GetProductSubType";
//		СообщениеОбОшибке = "";
//		Отказ = Ложь;
//		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода ,Ложь);
//		СтруктураПараметров.Вставить("GUID", Объект.IDExternalSystem);
//		ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
//		ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
//		Если НЕ Отказ Тогда
//			СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
//		КонецЕсли;
//		ЭтаФорма.Прочитать();
//		УправлениеДиалогомНаСервере(); 
//	КонецЕсли
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьЭлемент(Команда)
//	ОбновитьЭлементНаСервере();
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьПараметрыВыбораЭлементовФормы();	//rarus tenkam 01.12.2017 mantis +
	УправлениеДиалогомНаСервере();  
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	//Элементы.ФормаГруппаИнтеграция.Видимость = Scan_ПраваИНастройки.Scan_Право("ОбменСПредставительством");
	//Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));
	//
	//Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
	//	Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	//КонецЕсли;
	
	Если Объект.Комплектующие Тогда
		//rarus tenkam 01.12.2017 mantis +++
		//Элементы.НомерКаталожный.Видимость = Истина;
		Элементы.ТаблицаКомплектующие.Видимость = Истина;
		//rarus tenkam 01.12.2017 mantis +++
	Иначе
		//rarus tenkam 01.12.2017 mantis +++
		//Элементы.НомерКаталожный.Видимость = Ложь;
		//Объект.НомерКаталожный = "";
		
		Элементы.ТаблицаКомплектующие.Видимость = Ложь;		
		//rarus tenkam 01.12.2017 mantis +++
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеПриИзменении(Элемент)
	УправлениеДиалогомНаСервере();
КонецПроцедуры
//rarus tenkam 03.10.2017 mantis 9426 --

//rarus tenkam 01.12.2017 mantis +++
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТаблицаКомплектующие.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Количество() = 0 Тогда
			ЭлементОтбора = ТаблицаКомплектующие.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
			ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование    = Истина;			
			ЭлементОтбора.ПравоеЗначение   = Объект.Ссылка;
		Иначе
			ЭлементОтбора = ТаблицаКомплектующие.Отбор.Элементы.Получить(0);
			Если НЕ ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение) Тогда
				ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;	
			КонецЕсли;
		КонецЕсли;   	
	Иначе
		ЭлементОтбора = ТаблицаКомплектующие.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.ПравоеЗначение   = Справочники.Scan_Комплектующие.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	НастроитьПараметрыВыбораЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 --- 
//rarus tenkam 01.12.2017 mantis ---
