// Общий модуль "Управление диалогом документа (сервер)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Процедуры производит инициализацию команд в форме объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура ИнициализироватьКомандыПанелиДействий(Форма)
	
	// Определим в какую панель формы необходимо помещать новые кнопки
	ИмяКоманднойПанелиФормы = ?(Форма.Элементы.Найти("ОсновныеДействия")=Неопределено, "ФормаКоманднаяПанель", "ОсновныеДействия");
	
	// Произведем добавление панели для размещения дополнительных операций с формой
	НазначитьДополнительныеДействия = (НЕ Форма.Элементы.Найти("ДополнительныеДействия")=Неопределено);
	
	// Получим описание метаданных текущего объекта
	//ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Форма.ПолноеИмяОбъекта);
	
	// Команда настройки дополнительных параметров объекта
	//rarus BProg_Gladkov 09.12.2019 0014560 ++ Добавлен перевод на английский
	Заголовок = НСтр("ru = 'Параметры'; 
					 |en = 'Document settings'");
	Подсказка = НСтр("ru = 'Расширенное редактирование параметров документа'; 
					 |en = 'Advanced editing of document settings'");
	
	Scan_ВспомогательныеФункцииСервер.ДобавитьКоманду(Форма, "НастроитьПараметрыДокумента", ИмяКоманднойПанелиФормы, БиблиотекаКартинок.ПараметрыДокумента, Заголовок, Подсказка, ЛОЖЬ,,, ОтображениеКнопки.КартинкаИТекст);
	//rarus BProg_Gladkov 09.12.2019 0014560 -- 
	                                    
КонецПроцедуры // ИнициализироватьКомандыПанелиДействий()


// Общий обработчик события настройки параметров выбора элементов управления диалога в зависимости от значений
// реквизитов объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура НастроитьПараметрыВыбораЭлементовФормы(Форма) Экспорт
	
	// Настроим параметры выбора реквизитов зависящих от ХозОперации
	Scan_ВспомогательныеФункцииСервер.НастроитьПараметрыВыбораЭлементовФормыДокументы(Форма);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ ДОКУМЕНТА

// Общий обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Параметры            - Структура - Содержит коллекцию параметров формы.
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Функция ПриСозданииНаСервере(Форма, Параметры, Отказ=ЛОЖЬ, СтандартнаяОбработка=ИСТИНА, ПараметрыДействия=Неопределено) Экспорт
	
		
	// Если были при открытии в форму были переданные данные основного объекта, произведем их установку
	Если Параметры.ЗначенияЗаполнения.Свойство("КопироватьДанныеФормы") Тогда
		КопироватьДанныеФормы(Параметры.ЗначенияЗаполнения.КопироватьДанныеФормы, Форма.Объект);
	КонецЕсли;
	
		// Настроим состав и параметры отображения командной панели формы
	ИнициализироватьКомандыПанелиДействий(Форма);
	
	//rarus tenkam 13.10.2016 mantis 7688 ++
	// По умолчанию панель параметров документа должна быть скрыта
	Форма.Элементы.ПараметрыДокумента.Видимость = ЛОЖЬ;
	Форма.Элементы.НомерДата         .Видимость = ЛОЖЬ;
	//rarus tenkam 13.10.2016 mantis 7688 --
	
	//rarus abrant 27.01.2017 mantis 8304 +++
	Форма.Элементы.НастроитьПараметрыДокумента.ТолькоВоВсехДействиях = Истина;
	//rarus abrant 27.01.2017 mantis 8304 ---
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ПриСозданииНаСервере()



// Общий обработчик события возникающего при изменении данных объекта из формы "Параметры документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПараметрыДокументаРеквизитПриИзменении(Объект, ПараметрыДействия) Экспорт 
	
	Если ПараметрыДействия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененныеРеквизитыФормы = ПараметрыДействия.ИзмененныеРеквизиты;
	
	// Проверим, имеет ли смысл дальнейшая обработка
	Если ИзмененныеРеквизитыФормы.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним все измененные реквизиты
	ЗаполнитьЗначенияСвойств(Объект, ИзмененныеРеквизитыФормы);
	
	
	// Устанавливаем параметры выполнения операции
	Если ИзмененныеРеквизитыФормы.Свойство("ПодразделениеКомпании") Тогда 
		ИзмененныеРеквизитыФормы.Свойство("ПодразделениеКомпании",Объект.ПодразделениеКомпании);
	Конецесли;
	
	Если ИзмененныеРеквизитыФормы.Свойство("Организация") Тогда
		ИзмененныеРеквизитыФормы.Свойство("Организация",Объект.Организация);
	КонецЕсли;
	
	Если ИзмененныеРеквизитыФормы.Свойство("Менеджер") Тогда
		ИзмененныеРеквизитыФормы.Свойство("Менеджер",Объект.Менеджер);
	КонецЕсли;
	
	Если ИзмененныеРеквизитыФормы.Свойство("ВалютаДокумента") Тогда 
		ИзмененныеРеквизитыФормы.Свойство("ВалютаДокумента",Объект.ВалютаДокумента);
	Конецесли;

	Если ИзмененныеРеквизитыФормы.Свойство("ШтрихКод") Тогда 
		ИзмененныеРеквизитыФормы.Свойство("ШтрихКод",Объект.ШтрихКод);
	Конецесли;
	
	Если ИзмененныеРеквизитыФормы.Свойство("Дата") Тогда 
		ИзмененныеРеквизитыФормы.Свойство("Дата",Объект.Дата);
	Конецесли;


	
		
КонецПроцедуры // ПараметрыДокументаПриИзменении()


//// Общий обработчик события возникающего при изменении данных объекта из формы "Параметры документа".
////
//// Параметры:
////  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
////  Параметры - Структура        - Содержит значения измененных реквизитов.
////
Процедура ПараметрыДокументаПриИзменении(Форма,Параметры) Экспорт
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	// Получим новое состояние отображения панели параметров документа
	ПоказыватьПараметрыДокумента = (Параметры.Свойство("ПоказыватьПараметрыДокумента") И Параметры.ПоказыватьПараметрыДокумента);
	
	// Если новое состояние отображения не соответствует текущему, то перерисуем форму
	Если НЕ Форма.Элементы.ПараметрыДокумента.Видимость=ПоказыватьПараметрыДокумента И НЕ Форма.Элементы.НомерДата.Видимость=ПоказыватьПараметрыДокумента Тогда
		
		// Изменяем видимость элементов управления
		Форма.Элементы.ПараметрыДокумента.Видимость = ПоказыватьПараметрыДокумента;
		Форма.Элементы.НомерДата         .Видимость = ПоказыватьПараметрыДокумента;
		  
		// Взведем признак необходимости выполнить сохранение настроек формы при закрытии
		Форма.СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
		
	КонецЕсли;
	
	// Формируем новый текст для поля представления расширенных параметров документа
	//rarus vikhle 22.04.2020 mt 15695 +++
	//Форма.ПараметрыДокумента = ""+?(ЗначениеЗаполнено(Форма.Объект.Организация), Строка(Форма.Объект.Организация)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.ПодразделениеКомпании), Строка(Форма.Объект.ПодразделениеКомпании)+"; ", "") + Строка(Форма.Объект.Менеджер);
	Форма.ПараметрыДокумента = ""+?(ЗначениеЗаполнено(Форма.Объект.Организация), Строка(Форма.Объект.Организация)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.ПодразделениеКомпании), Строка(Форма.Объект.ПодразделениеКомпании)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.Компания), Строка(Форма.Объект.Компания)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.Контрагент), Строка(Форма.Объект.Контрагент)+"; ", "") + Строка(Форма.Объект.Менеджер);
	//rarus vikhle 22.04.2020 mt 15695 ---
	// Установим модифицированность формы
	
	// rarus agar 16.12.2022 19668 ++
	//Форма.Модифицированность = Форма.Модифицированность
	Если Параметры.ИзмененныеРеквизиты.Количество() > 0 Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
	// rarus agar 16.12.2022 19668 --
	
	
КонецПроцедуры // ПараметрыДокументаПриИзменении()


// Общий обработчик события возникающего при оповещении формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  Форма                   - УправляемаяФорма - Форма, в которой возникло событие.
//  РезультатОповещения     - Произвольный     - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный     - Значение, которое было указано при создании описания оповещения.
//
Функция ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	    // Вызываем общий обработчик изменения данных объекта
		Scan_УправлениеДиалогомДокументаСервер.ПараметрыДокументаРеквизитПриИзменении(Форма.Объект, РезультатОповещения);
		
		// Вызываем обработчик изменения параметров элементов управления формы
		Scan_УправлениеДиалогомДокументаСервер.ПараметрыДокументаПриИзменении(Форма, РезультатОповещения);
	Возврат ИСТИНА;	
КонецФункции


// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраняемых реквизитов и настроек формы.
//
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Форма, Настройки) Экспорт
	
	// Производим сохранение параметров отображения панели параметров документа
	Настройки.Вставить("ПоказыватьПараметрыДокумента", Форма.Элементы.ПараметрыДокумента.Видимость);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()


// Общий обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраненных реквизитов и настроек формы.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Форма, Настройки) Экспорт
	
	// Покажем панель параметров документа если ранее была сохранена ее настройка отображения
	Если Настройки.Получить("ПоказыватьПараметрыДокумента")=ИСТИНА Тогда
		Форма.Элементы.ПараметрыДокумента.Видимость = ИСТИНА;
		Форма.Элементы.НомерДата         .Видимость = ИСТИНА;
		//rarus vikhle 22.04.2020 mt 15695 +++
		//Форма.ПараметрыДокумента = ""+?(ЗначениеЗаполнено(Форма.Объект.Организация), Строка(Форма.Объект.Организация)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.ПодразделениеКомпании), Строка(Форма.Объект.ПодразделениеКомпании)+"; ", "") + Строка(Форма.Объект.Менеджер);
		Форма.ПараметрыДокумента = ""+?(ЗначениеЗаполнено(Форма.Объект.Организация), Строка(Форма.Объект.Организация)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.ПодразделениеКомпании), Строка(Форма.Объект.ПодразделениеКомпании)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.Компания), Строка(Форма.Объект.Компания)+"; ", "") + ?(ЗначениеЗаполнено(Форма.Объект.Контрагент), Строка(Форма.Объект.Контрагент)+"; ", "") + Строка(Форма.Объект.Менеджер);
		//rarus vikhle 22.04.2020 mt 15695 ---
	Иначе
		Форма.Элементы.ПараметрыДокумента.Видимость = ЛОЖЬ;
		Форма.Элементы.НомерДата         .Видимость = ЛОЖЬ;

	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

