//rarus sergei 13.10.2016 mantis 7350 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Проверим право выводить Отчет
	Элементы.ФормаСформировать.Видимость = Scan_ПраваИНастройки.Scan_Право("ВыводитьОтчетОбОкончанииДействияДоговоровПоУмолчанию");
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Scan_ПраваИНастройки.Scan_Право("ВыводитьОтчетОбОкончанииДействияДоговоровПоУмолчанию");
	Элементы.ОсновнаяКоманднаяПанель.Видимость = Scan_ПраваИНастройки.Scan_Право("ВыводитьОтчетОбОкончанииДействияДоговоровПоУмолчанию"); 
	Элементы.ФормаКоманднаяПанель.Видимость = Scan_ПраваИНастройки.Scan_Право("ВыводитьОтчетОбОкончанииДействияДоговоровПоУмолчанию");
	Элементы.Результат.Видимость = Scan_ПраваИНастройки.Scan_Право("ВыводитьОтчетОбОкончанииДействияДоговоровПоУмолчанию");
	Scan_СборСтатистики.Scan_ПриОткрытииОтчета(РеквизитФормыВЗначение("Отчет").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +
КонецПроцедуры
//rarus sergei 13.10.2016 mantis 7350 --