
//rarus agar 04.12.2020 16691 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  Параметры.Свойство("Продукт") 
		И Параметры.Свойство("ЗаказНаЗавод")
		Тогда
		ОбъектыКлючевыхДат = Новый СписокЗначений;
		ОбъектыКлючевыхДат.Добавить(ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.Изделие"));
		ОбъектыКлючевыхДат.Добавить(ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод"));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектКлючевойДаты", ОбъектыКлючевыхДат, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
		Объекты = Новый СписокЗначений;
		Объекты.Добавить(Параметры.Продукт);
		Объекты.Добавить(Параметры.ЗаказНаЗавод);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект", Объекты, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	ИначеЕсли  Параметры.Свойство("Продукт") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектКлючевойДаты", ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.Изделие"), ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект",             Параметры.Продукт, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли  Параметры.Свойство("ЗаказНаЗавод") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектКлючевойДаты", ПредопределенноеЗначение("Перечисление.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод"), ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект",             Параметры.ЗаказНаЗавод, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 04.12.2020 16691 --
