//rarus tenkam 22.11.2017 mantis 12373 +++

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Параметры.ДанныеДляОтображения) Тогда
		ТекТекстПредупреждения = "Вы действительно хотите продолжить?";
	Иначе
		ТекТекстПредупреждения = Параметры.ДанныеДляОтображения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры


//rarus tenkam 22.11.2017 mantis 12373 ---