
&НаСервере
Процедура ОбновитьЛокальныеСтатусыНаСервере() //rarus bonmak 14576 30.08.2019 ++
	//вставить метод обновления локальных статусов
	ИмяМетода = "GetListOfStatuses";
	СообщениеОбОшибке = "";
	Отказ = Ложь;
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	СтруктураПараметров.ВидСтатуса = "СтатусыЗаказовАМ";
	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	Если НЕ Отказ Тогда
		СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникЛокальныеСтатусы(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры //rarus bonmak 14576 30.08.2019 --

&НаКлиенте
Процедура ОбновитьЛокальныеСтатусы(Команда) //rarus bonmak 14576 30.08.2019 ++
	ОбновитьЛокальныеСтатусыНаСервере();
КонецПроцедуры //rarus bonmak 14576 30.08.2019 --
