
//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// rarus agar 21.04.2021 17484 ++
	Если      (Параметры.Свойство("ИспользоватьОтборДилерАктивен")
		И      Параметры.ИспользоватьОтборДилерАктивен)
		Или Не Параметры.Свойство("ИспользоватьОтборДилерАктивен")
		Тогда
	// rarus agar 21.04.2021 17484 --
		
		//rarus vikhle 14.04.2021 mt 17484 +++
		Если Scan_ПраваИНастройки.Scan_Право("ЗапретРаботыСНеактивнымиДилерами") Тогда
			КоллекцияЭлементовОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
			РежимОтображенияОтбора	 = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			// rarus agar 21.04.2021 17484 ++
			Элементы.ОтборКомпоновщикаНастроек.Видимость = Ложь;
			// rarus agar 21.04.2021 17484 --
			НужноСоздатьИД			 = Ложь;
		Иначе
			КоллекцияЭлементовОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
			// rarus agar 21.04.2021 17484 ++
			//РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			РежимОтображенияОтбора   = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			Элементы.ОтборКомпоновщикаНастроек.Видимость = Истина;
			// rarus agar 21.04.2021 17484 --
			НужноСоздатьИД			 = Истина;
		КонецЕсли;	
		
		КорневаяГруппаОтборов = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(КоллекцияЭлементовОтбора,,ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ); 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КорневаяГруппаОтборов,"Дилер",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина,РежимОтображенияОтбора,
		?(НужноСоздатьИД,Новый УникальныйИдентификатор,Неопределено));
		
		ПодчиненнаяГруппаОтборов = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(КорневаяГруппаОтборов,,ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);													
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодчиненнаяГруппаОтборов,"Дилер",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина,РежимОтображенияОтбора,
		?(НужноСоздатьИД,Новый УникальныйИдентификатор,Неопределено));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодчиненнаяГруппаОтборов,"ДилерАктивен",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина,РежимОтображенияОтбора,
		?(НужноСоздатьИД,Новый УникальныйИдентификатор,Неопределено));
		//rarus vikhle 14.04.2021 mt 17484 ---
		// rarus agar 21.04.2021 17484 ++
	ИначеЕсли    Параметры.Свойство("ИспользоватьОтборДилерАктивен")
			И Не Параметры.ИспользоватьОтборДилерАктивен  
			Тогда
			Элементы.ОтборКомпоновщикаНастроек.Видимость = Ложь;
	КонецЕсли;
	// rarus agar 21.04.2021 17484 --
	
	ОтображениеФиксированногоОтбора();
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_Компании.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --