
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПеренумерацияОпцийДетАкта" Тогда
		Элементы.Список.Обновить(); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренумероватьЭлементыГруппы(Команда)
	
	РежимПеренумерации = "ВсеЭлементы";
	ТекущаяСсылка      = Элементы.Список.ТекущиеДанные.Ссылка;
	
	ПеренумероватьЭлементыНаСервере(РежимПеренумерации, ТекущаяСсылка);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренумероватьЭлементыПослеТекущего(Команда)
	
	РежимПеренумерации = "ЭлементыПослеТекущего";
	ТекущаяСсылка      = Элементы.Список.ТекущиеДанные.Ссылка;
	
	ПеренумероватьЭлементыНаСервере(РежимПеренумерации, ТекущаяСсылка);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПеренумероватьЭлементыНаСервере(РежимПеренумерации, ТекущаяСсылка)
	
	Если РежимПеренумерации = "ВсеЭлементы" Тогда
		ЗначенияРеквизитовОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСсылка, "Родитель");
		
		Родитель = ЗначенияРеквизитовОбъекта.Родитель;
		СсылкаНаЭлемент = Справочники.Scan_ОпцииДляДетализированногоАкта.ПустаяСсылка();
		ПорядковыйНомерВДетализированномАкте = 0;
	Иначе
		ЗначенияРеквизитовОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСсылка, "Родитель,ПорядковыйНомерВДетализированномАкте");
		
		Родитель = ЗначенияРеквизитовОбъекта.Родитель;
		СсылкаНаЭлемент = ТекущаяСсылка;
		ПорядковыйНомерВДетализированномАкте = ЗначенияРеквизитовОбъекта.ПорядковыйНомерВДетализированномАкте;
	КонецЕсли;
	
	Справочники.Scan_ОпцииДляДетализированногоАкта.ПеренумероватьЭлементыСправочника(Родитель, СсылкаНаЭлемент, ПорядковыйНомерВДетализированномАкте);
	
КонецПроцедуры

#КонецОбласти