
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)//rarus pechek 23.03.2020  15466 +++ 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	РазрешеноАннулировать = Scan_ПраваИНастройки.Scan_Право("РазрешитьАннулированиеДокументаСпецификацияСтандартнойМодели");
	Элементы.ФормаАннулировать.Доступность = РазрешеноАннулировать;

КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();//rarus vikhle 07.05.2020 mt 15695
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)  //rarus pechek 23.03.2020  15466 +++
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры  //rarus pechek 23.03.2020  15466 ---

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)  //rarus pechek 23.03.2020  15466 +++
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры  //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() //rarus pechek 23.03.2020  15466 +++
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КорректироватьДокумент(Команда) //rarus pechek 23.03.2020  15466 +++
	Для Каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		Scan_ВспомогательныеФункцииКлиент.ОбработатьИзменениеСпецификацииСтандартнойМодели(Истина, ТекСтрока, ЭтаФорма);
	КонецЦикла;
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура АннулироватьДокумент(Команда) //rarus pechek 23.03.2020  15466 +++
	Для Каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		Scan_ВспомогательныеФункцииКлиент.ОбработатьИзменениеСпецификацииСтандартнойМодели(Ложь, ТекСтрока, ЭтаФорма);
	КонецЦикла;
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)//rarus pechek 23.03.2020  15466 +++ 
	Если ИмяСобытия = "ОбновитьСписокЗаявокНаДействие" Тогда 
		Элементы.Список.Обновить(); 
	КонецЕсли;
КонецПроцедуры //rarus pechek 23.03.2020  15466 ---

&НаКлиенте
Процедура ПрикрепитьФайл(Команда) //rarus pechek 23.03.2020  15466 +++	
	Если Элементы.Список.ВыделенныеСтроки.Количество() <> 0 Тогда
		РаботаСФайламиКлиент.ДобавитьФайлы(Элементы.Список.ВыделенныеСтроки, ЭтаФорма.УникальныйИдентификатор, , );
		Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры  //rarus pechek 23.03.2020  15466 ---
//rarus bonmak 09.08.2021 16834 ++
//&НаСервереБезКонтекста
//Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) //rarus pechek 23.03.2020  15466 +++	
//	Запрос = Новый Запрос();
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Справочник.Ссылка КАК Ссылка,
//	               |	Справочник.Цвет КАК Цвет
//	               |ИЗ
//	               |	Справочник.Scan_СтатусыЗаявокНаДействие КАК Справочник";
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	Scan_ЗаявкаНаДействие.Ссылка КАК СсылкаДокумент
//		               |ИЗ
//		               |	Документ.Scan_ЗаявкаНаДействие КАК Scan_ЗаявкаНаДействие
//		               |ГДЕ
//		               |	Scan_ЗаявкаНаДействие.СтатусЗаявки = &СтатусЗаявки
//		               |	И Scan_ЗаявкаНаДействие.Ссылка В(&Строки)";
//		
//		Запрос.УстановитьПараметр("СтатусЗаявки", Выборка.Ссылка);
//		Запрос.УстановитьПараметр("Строки", Строки.ПолучитьКлючи());
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//		
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			СтрокаСписка = Строки[ВыборкаДетальныеЗаписи.СсылкаДокумент];
//			Для Каждого КолонкаСписка Из СтрокаСписка.Оформление Цикл
//				КолонкаСписка.Значение.УстановитьЗначениеПараметра("ЦветФона", Выборка.Цвет.Получить());
//			КонецЦикла;
//		КонецЦикла; 		
//	КонецЦикла;
//КонецПроцедуры  //rarus pechek 23.03.2020  15466 ---
//rarus bonmak 09.08.2021 16834 --
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент) //rarus pechek 23.03.2020  15466 +++ 	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры  //rarus pechek 23.03.2020  15466 ---

// rarus kabany 25.05.2021 17784 +++
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ИмяПоля = Поле.Имя;
	ОчиститьСообщения();
	
	Если ИмяПоля = "ЕстьФайлы" Тогда
		мПрисоединенныхФайлов = ПолучитьПрисоединенныеФайлы(ВыбраннаяСтрока);
		Если мПрисоединенныхФайлов.Количество() < 1 Тогда
			Возврат;
		Иначе
			Разделитель = ",";
			ВыходнаяСтрока = СтрСоединить(мПрисоединенныхФайлов, Разделитель);
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Прикрепленные файлы: %1';  en = 'Attached files: %1'"),ВыходнаяСтрока);
			ВывестиСообщениеПол(ТекстСообщения, ЭтотОбъект);	
		КонецЕсли;
	Иначе
		ПоказатьЗначение(,ВыбраннаяСтрока);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПрисоединенныеФайлы(ВладелецФайлов)	
	Если ТипЗнч(ВладелецФайлов) = Тип("ДокументСсылка.Scan_СпецификацияСтандартнойМодели") Тогда
	Возврат РаботаСФайламиСлужебный.ВсеПодчиненныеФайлы(ВладелецФайлов);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СкопироватьСВложеннымиФайлами(Команда)
	мПрисоединенныхФайлов = ПолучитьПрисоединенныеФайлы(Элементы.Список.ТекущаяСтрока);
	Если мПрисоединенныхФайлов.Количество() < 1 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'У документа нет прикрепленных файлов';  en = 'The document has no attached files'"));
		ВывестиСообщениеПол(ТекстСообщения, ЭтотОбъект);	
		Возврат;
	Иначе		
		пФормыДокумента = Новый Структура();
		пФормыДокумента.Вставить("ЗначениеКопирования", Элементы.Список.ТекущаяСтрока);
		пФормыДокумента.Вставить("СписокПрисоединенныхФайлов", мПрисоединенныхФайлов);
		ОткрытьФорму("Документ.Scan_СпецификацияСтандартнойМодели.Форма.ФормаДокумента",пФормыДокумента, ЭтаФорма);			
	КонецЕсли;
КонецПроцедуры

// rarus kabany 25.05.2021 17784 ---

#КонецОбласти
