//rarus tenkam 26.07.2018 mantis 13359 баг платформы +++ 
&НаКлиенте
Процедура СписокПриСменеТекущегоРодителя(Элемент)
	// rarus tenkam 19.04.2019 mantis 14195 +++
	#Если Не ВебКлиент Тогда	
	// rarus tenkam 19.04.2019 mantis 14195 ---
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("{UP}");
	// rarus tenkam 19.04.2019 mantis 14195 +++
	#КонецЕсли
	// rarus tenkam 19.04.2019 mantis 14195 ---	
КонецПроцедуры
//rarus tenkam 26.07.2018 mantis 13359 баг платформы ---

//rarus pechek 06.05.2020 mantis 15981 +++
&НаКлиенте
Процедура ПоказыватьНедействительныхПриИзменении(Элемент)
	Элемент = Список.Отбор.Элементы.Получить(0);
	Если ПоказыватьНедействительных Тогда
		Элемент.Использование = Ложь;
	Иначе
		Элемент.Использование = Истина;
	КонецЕсли;
КонецПроцедуры
//rarus pechek 06.05.2020 mantis 15981 ---

//rarus pechek 06.05.2020 mantis 15981 +++
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();//rarus vikhle 07.05.2020 mt 15695
	ПоказыватьНедействительных = Ложь;
	Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Недействительный");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Использование = Истина;
	Элемент.ПравоеЗначение = Ложь;
КонецПроцедуры
//rarus pechek 06.05.2020 mantis 15981 ---

&НаКлиенте
Процедура ПереместитьАдресКлиента(Команда) // Rarus tenkam 08.11.2021 mantis 17140 +++
	Для Каждого ТекМестоХранения Из Элементы.Список.ВыделенныеСтроки Цикл
		ПереместитьМестоХраненияНаСервере(ТекМестоХранения);
	КонецЦикла;
	Элементы.Список.Обновить();
	СписокПриАктивизацииСтроки(Неопределено);
КонецПроцедуры // Rarus tenkam 08.11.2021 mantis 17140 ---

&НаКлиенте
Процедура ПереместитьПлощадку(Команда) // Rarus tenkam 07.12.2021 mantis 17140 +++
	Для Каждого ТекМестоХранения Из Элементы.Список.ВыделенныеСтроки Цикл
		ПереместитьМестоХраненияНаСервере(ТекМестоХранения);
	КонецЦикла;
	Элементы.Список.Обновить();
	СписокПриАктивизацииСтроки(Неопределено);
КонецПроцедуры  // Rarus tenkam 07.12.2021 mantis 17140 ---

&НаСервереБезКонтекста
Процедура ПереместитьМестоХраненияНаСервере(ТекМестоХранения) // Rarus tenkam 07.12.2021 mantis 17140 +++
	ТекРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекМестоХранения, "Родитель");
	Если ТекРодитель = ПредопределенноеЗначение("Справочник.Scan_МестаХранения.МестаХранения") Тогда
		Родитель = ПредопределенноеЗначение("Справочник.Scan_МестаХранения.МестаХраненияАдресаКлиентов");
	ИначеЕсли ТекРодитель = ПредопределенноеЗначение("Справочник.Scan_МестаХранения.МестаХраненияАдресаКлиентов") Тогда
		Родитель = ПредопределенноеЗначение("Справочник.Scan_МестаХранения.МестаХранения");
	Иначе
		Сообщить(НСтр("ru = 'Группа может быть изменена только у мест хранения из папки <Места хранения (площадки)> / <Места хранения - адреса клиентов>'"));	
		Возврат;
	КонецЕсли;
	ТекМестоХраненияОбъект = ТекМестоХранения.ПолучитьОбъект();
	ТекМестоХраненияОбъект.Заблокировать(); 
	ТекМестоХраненияОбъект.Родитель = Родитель;
	ТекМестоХраненияОбъект.НеЗапрещатьПеремещениеМестаХранения = Ложь;
		
	Попытка
		ТекМестоХраненияОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка изменения группы места хранения <%1>: %2'"),,,,, ТекМестоХранения, ОписаниеОшибки());
	КонецПопытки;       	
	
КонецПроцедуры // Rarus tenkam 07.12.2021 mantis 17140 ---

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент) // Rarus tenkam 07.12.2021 mantis 17140 +++
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.Родитель = ПредопределенноеЗначение("Справочник.Scan_МестаХранения.МестаХранения") Тогда
			Элементы.ФормаПереместитьАдресКлиента.Видимость = Истина;
			Элементы.ФормаПереместитьПлощадку.Видимость = Ложь;
		ИначеЕсли ТекущиеДанные.Родитель = ПредопределенноеЗначение("Справочник.Scan_МестаХранения.МестаХраненияАдресаКлиентов") Тогда 
			Элементы.ФормаПереместитьАдресКлиента.Видимость = Ложь;
			Элементы.ФормаПереместитьПлощадку.Видимость = Истина; 			
		Иначе
			Элементы.ФормаПереместитьАдресКлиента.Видимость = Ложь;
			Элементы.ФормаПереместитьПлощадку.Видимость = Ложь;  			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры // Rarus tenkam 07.12.2021 mantis 17140 ---
