
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	
	ОчиститьРасчетЗаписиНаКлиенте();
	ЗаполнитьВидСобытияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСобытияПриИзменении(Элемент)
	
	ОчиститьРасчетЗаписиНаКлиенте();
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьРасчетЗаписиНаКлиенте()
	
	Запись.ВесСобытия      = 0;
	Запись.Остаток         = 0;
	Запись.OrderIntake     = 0;
	Запись.ДатаOrderIntake = Дата(1,1,1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидСобытияНаСервере()
	
	Запись.ВидСобытия = Scan_OrderIntake.ВидСобытияOrderIntake(Запись.Событие);
	
КонецПроцедуры

#КонецОбласти
