//rarus tenkam 08.09.2017 mantis 9425 +++ 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Проверим уникальность уровня
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СостоянияАКБ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_СостоянияАКБ КАК Scan_СостоянияАКБ
		|ГДЕ
		|	Scan_СостоянияАКБ.УровеньСостояния = &УровеньСостояния
		|	И Scan_СостоянияАКБ.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("УровеньСостояния", УровеньСостояния);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю();
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщение.Текст = "Уровень состояния не уникальный! Состояние " + ВыборкаДетальныеЗаписи.Ссылка + " имеет такой же уровень.";
		Сообщение.Текст = НСтр("ru = 'Уровень состояния не уникальный! Состояние '; en = 'State level is not unique! State '") + ВыборкаДетальныеЗаписи.Ссылка + НСтр("ru = '  имеет такой же уровень.'; en = ' has the same level.'");
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Сообщение.Поле = "УровеньСостояния";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	// Проверим корректность заполнения тч
	Для Индекс = 0 по ХарактеристикиАКБ.Количество()-1 Цикл
		ТекСтрока = ХарактеристикиАКБ.Получить(Индекс);
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ВидСравненияЛевый) И ЗначениеЗаполнено(ТекСтрока.ЛеваяГраница) Тогда
			Сообщение = Новый СообщениеПользователю();
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "В строке " + Индекс + " не заполнено значение левого вида сравнения!";
			Если ТекущийЯзык()="en" тогда
				Сообщение.Текст = "Action failed";
			иначе
				Сообщение.Текст = "В строке " + Индекс + " не заполнено значение левого вида сравнения!";
			КонецЕсли;
			//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
			Сообщение.Поле = "ХарактеристикиАКБ[" + Индекс + "].ВидСравненияЛевый";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ВидСравненияПравый) И ЗначениеЗаполнено(ТекСтрока.ПраваяГраница) Тогда
			Сообщение = Новый СообщениеПользователю();
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "В строке " + Индекс + " не заполнено значение левого вида сравнения!";
			Если ТекущийЯзык()="en" тогда
				Сообщение.Текст = "Action failed";
			иначе
				Сообщение.Текст = "В строке " + Индекс + " не заполнено значение правого вида сравнения!";
			КонецЕсли;
			//rarus FominskiyAS 24.04.2019  mantis 14191 --- 
			Сообщение.Поле = "ХарактеристикиАКБ[" + Индекс + "].ВидСравненияПравый";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//rarus tenkam 08.09.2017 mantis 9425 ---
