//rarus sergei 28.09.2016 mantis 7160 ++
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
    ПараметрыФормы = Новый Структура("ДанныеДляПечати", ПараметрКоманды);
    ОткрытьФорму("Документ.Scan_ЗаявкаПеревозчику.Форма.ФормаНастроекПечати", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//rarus sergei 28.09.2016 mantis 7160 --