//rarus vikhle 07.05.2020 mt 15695 +++
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();
	//rarus bonmak 06.08.2020 14375 ++
	ПоказыватьБУ = Ложь;
	Элемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БУ");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Использование = Ложь;
	Элемент.ПравоеЗначение = Истина;
	//rarus bonmak 06.08.2020 14375 --
	
	// rarus tenkam 21.08.2020 mantis 16422 +++
	ВидГрузовыеАвтомобили = Scan_ПраваИНастройки.Scan_Право("ВидПродуктаГрузовыеАвтомобили");
	Список.Параметры.УстановитьЗначениеПараметра("ВидГрузовыеАвтомобили",ВидГрузовыеАвтомобили);
	// rarus tenkam 21.08.2020 mantis 16422 ---
КонецПроцедуры


&НаКлиенте
Процедура СоздатьИзделиеСПробегом(Команда) //rarus bonmak 18.05.2020 14375 ++
	ОткрытьФорму("Справочник.Scan_Изделия.Форма.ФормаСозданияБУИзделия");
КонецПроцедуры //rarus bonmak 18.05.2020 14375 --


&НаКлиенте
Процедура ПоказыватьБУПриИзменении(Элемент) //rarus bonmak 06.08.2020 14375 ++
	Элемент = Список.Отбор.Элементы.Получить(0);
	Если ПоказыватьБУ Тогда
		Элемент.Использование = Истина;
	Иначе
		Элемент.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры //rarus bonmak 06.08.2020 14375 --
//rarus vikhle 07.05.2020 mt 15695 ---
