
&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus tenkam 11.09.2019 14442 ++
	//rarus vikhle 06.02.2020 mt 15659 +++	закомментировано
	//ИмяМетода = "GetListOfProductSubType";
	//СообщениеОбОшибке = "";
	//Отказ = Ложь;
	//СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	//
	//СтруктураПараметров.Вставить("РодительGUID", "");
	//ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//Если НЕ Отказ Тогда
	//	РодительGUID = Scan_ВебСервисыРазборОтветов.ПолучитьGuidРодителя(ТекЭлементОтвет, "Типы ГИБДД",Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	
	//	Если ЗначениеЗаполнено(РодительGUID) Тогда
	//		СтруктураПараметров.Вставить("РодительGUID", РодительGUID);		
	//		ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//		ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//		Если НЕ Отказ Тогда
	//			ТекСсылка = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода, "Scan_ТипыГИБДД");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//Элементы.Список.Обновить();
	//rarus vikhle 06.02.2020 mt 15659 ---	закомментировано
КонецПроцедуры //rarus tenkam 11.09.2019 14442 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 11.09.2019 14442 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus tenkam 11.09.2019 14442 --
