
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Scan_ЦеныУслугПоЛогистике
	Движения.Scan_ЦеныУслугПоЛогистике.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Scan_ЦеныУслугПоЛогистике.Добавить();
		Движение.Период = ДатаНачала;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.Количество = ТекСтрокаУслуги.Количество;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
		Движение.СтавкаНДС = ТекСтрокаУслуги.СтавкаНДС;
		Движение.СуммаНДС = ТекСтрокаУслуги.СуммаНДС;
		Движение.СуммаВсего = ТекСтрокаУслуги.СуммаВсего;
		Движение.Операция = ХозОперация;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

    
