
Функция ПолучитьСписокЭлементовДляНастройки() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ТаблицаЭлементов.Колонки.Добавить("ИмяЭлемента",ОписаниеТиповС,,); 
	
	// добавление реквизитов /ТЧ
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КоличествоПродуктов";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Дилер";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ПродавецДилера";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Модель";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "УникальностьСпецификации";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СтандартнаяСпецификация";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "НомерКоммерческогоПредложенияSPORT";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаДляДилера";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаДляКлиента";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "DeliveryDate";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "SORDER";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "FFU";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КонечныйКлиент";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "DistributorNet";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СебестоимостьСНДС";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "RUНомер";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СписокПродуктов";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "УсловияОплаты";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Цены";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СрокДействияСпециальныхУсловий";     
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ГруппаМаржаDist";   
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Обоснование";
	//vikhle 05.08.2020 mt 16181 +++
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ДрайвНеПрименим";
	СтрокаТЗ = ТаблицаЭлементов.Добавить();
	СтрокаТЗ.ИмяЭлемента  = "СтавкаНДС";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаБезНДС";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Основание";
	//СтрокаТЗ = ТаблицаЭлементов.Добавить();//rarus bonmak 13.01.2021 17041 
	//СтрокаТЗ.ИмяЭлемента  = "ОтсрочкаПлатежа";//rarus bonmak 13.01.2021 17041
	//vikhle 05.08.2020 mt 16181 ---
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); //rarus vikhle 29.01.2021 mt 16929
	СтрокаТЗ.ИмяЭлемента  = "Примечание"; //rarus vikhle 29.01.2021 mt 16929 
	
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ПрайсDealerNet";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СпецDealerNet";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ПрайсCustomerPrice";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СпецCustomerPrice";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КонечныйКлиентКомпания";	
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Комментарий";	
	
	//rarus vikhle 17.12.2020 mt 16181 +++
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЦенаДляКлиентаБезНДС";
	//rarus vikhle 17.12.2020 mt 16181 ---
	
	//rarus ozhnik 15888 31.08.2020 + 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Код";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Статус";
	//rarus ozhnik 15888 31.08.2020 -
	//rarus ozhnik 16453 07.09.2020 + 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ГруппаСистемныеПоля";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КоммерческоеПредложениеSPORT";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "IDПродуктаКП";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ДекорацияСпецификация";  	
	//rarus ozhnik 16453 07.09.2020 -
	
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Запросить";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "НаСогласование";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Пересмотр";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Одобрить";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Отклонить";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "Подобрать";

	//rarus ozhnik 16453 07.09.2020 + 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "ЗагрузитьКП";
	//rarus ozhnik 16453 07.09.2020 -

	// rarus tenkam 19.01.2021 mantis 16345 +++
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КодСУSOWA";
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "КоличествоПрикрепленныхШасси";
	// rarus tenkam 19.01.2021 mantis 16345 ---
	
	//rarus tenkam 16.06.2021 mantis 17742 +++ 
	СтрокаТЗ = ТаблицаЭлементов.Добавить(); 
	СтрокаТЗ.ИмяЭлемента  = "СУНаАвтобусы";
	//rarus tenkam 16.06.2021 mantis 17742 --- 
	
	возврат ТаблицаЭлементов;
КонецФункции

Процедура ОбновитьСУ(ТаблицаДоИзменений,ТаблицаПослеИзменений) Экспорт
	//rarus vikhle 26.01.2021 mt 16929 +++	
	//Получим общий список СУ до и после изменений
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДоИзменений.СпециальныеУсловия КАК СпециальныеУсловия
	               |ПОМЕСТИТЬ СУДоИзменений
	               |ИЗ
	               |	&ТаблицаДоИзменений КАК ТаблицаДоИзменений
	               |ГДЕ
	               |	НЕ ТаблицаДоИзменений.СпециальныеУсловия = ЗНАЧЕНИЕ(Справочник.Scan_СпециальныеУсловия.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПослеИзменений.СпециальныеУсловия КАК СпециальныеУсловия
	               |ПОМЕСТИТЬ СУПослеИзменений
	               |ИЗ
	               |	&ТаблицаПослеИзменений КАК ТаблицаПослеИзменений
	               |ГДЕ
	               |	НЕ ТаблицаПослеИзменений.СпециальныеУсловия = ЗНАЧЕНИЕ(Справочник.Scan_СпециальныеУсловия.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУДоИзменений.СпециальныеУсловия КАК СпециальныеУсловия
	               |ИЗ
	               |	СУДоИзменений КАК СУДоИзменений
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	СУПослеИзменений.СпециальныеУсловия
	               |ИЗ
	               |	СУПослеИзменений КАК СУПослеИзменений";
	Запрос.УстановитьПараметр("ТаблицаДоИзменений",ТаблицаДоИзменений);			   
	Запрос.УстановитьПараметр("ТаблицаПослеИзменений",ТаблицаПослеИзменений);
	ТаблицаСУ = Запрос.Выполнить().Выгрузить();
	//Получим количество применений СУ в актуальных заявках
	ТаблицаПримененийСУ = ПолучитьКоличествоПримененийСУ(ТаблицаСУ);
	
	СтатусОдобреноЕстьВСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноЕстьВСОП;
	СтатусОдобреноНетВСОП  = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноНетВСОП; 
	//Обновим статус в СУ при необходимости
	Для Каждого СтрокаТЗ Из ТаблицаПримененийСУ Цикл
		Если СтрокаТЗ.Статус =  СтатусОдобреноЕстьВСОП	И СтрокаТЗ.КоличествоПрименений = 0 Тогда
			СУЗаписаны = УстановитьСтатусСУ(СтрокаТЗ.СпециальныеУсловия,СтатусОдобреноНетВСОП);
		ИначеЕсли СтрокаТЗ.Статус =  СтатусОдобреноНетВСОП И СтрокаТЗ.КоличествоПрименений > 0 Тогда  
			СУЗаписаны = УстановитьСтатусСУ(СтрокаТЗ.СпециальныеУсловия,СтатусОдобреноЕстьВСОП);	
		КонецЕсли;		
	КонецЦикла;
	
	//rarus vikhle 26.01.2021 mt 16929 ---
КонецПроцедуры

// Возвращает таблицу значений с переданными СУ, статусом и количеством применений в заявках на СОП (в актуальном статусе),
// в которых указаны переданные СУ.
Функция ПолучитьКоличествоПримененийСУ(СУ) Экспорт
	
	//rarus vikhle 26.01.2021 mt 16929 +++
	//Массив статусов, которые не учитываются при подсчете  
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НеактуальноЕстьДС);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Отменен);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Расторгнут);
	МассивСтатусов.Добавить(Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Отказ);

	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_СпециальныеУсловия.Ссылка КАК СпециальныеУсловия,
	               |	ЕСТЬNULL(СУММА(Scan_СоглашенияОПоставкеСписокПродуктов.Количество), 0) КАК КоличествоПрименений,
	               |	Scan_СпециальныеУсловия.Статус КАК Статус
	               |ИЗ
	               |	Справочник.Scan_СпециальныеУсловия КАК Scan_СпециальныеУсловия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_СоглашенияОПоставке.СписокПродуктов КАК Scan_СоглашенияОПоставкеСписокПродуктов
	               |		ПО (Scan_СоглашенияОПоставкеСписокПродуктов.СпециальныеУсловия = Scan_СпециальныеУсловия.Ссылка)
	               |			И (НЕ Scan_СоглашенияОПоставкеСписокПродуктов.Ссылка.Статус В (&МассивСтатусов))
	               |ГДЕ
	               |	Scan_СпециальныеУсловия.Ссылка В(&СУ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Scan_СоглашенияОПоставкеСписокПродуктов.СпециальныеУсловия,
	               |	Scan_СпециальныеУсловия.Ссылка,
	               |	Scan_СпециальныеУсловия.Статус";
	Запрос.УстановитьПараметр("МассивСтатусов",МассивСтатусов);
	Запрос.УстановитьПараметр("СУ",СУ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	//rarus vikhle 26.01.2021 mt 16929 ---
	
КонецФункции

Функция УстановитьСтатусСУ(СУ,Статус) Экспорт
	//rarus vikhle 26.01.2021 mt 16929 +++
	СУОбъект = СУ.ПолучитьОбъект();
	СУОбъект.Статус = Статус;
	
	//Добавление строки в служебную ТЧ Цены
	нСтрокаТЧ 									= СУОбъект.Цены.Добавить();
	нСтрокаТЧ.CustomerPrice 					= СУОбъект.СпецCustomerPrice;
	нСтрокаТЧ.DealerNet 						= СУОбъект.СпецDealerNet; 
	нСтрокаТЧ.Статус 							= СУОбъект.Статус;
	нСтрокаТЧ.Период 							= ТекущаяДатаСеанса();
	нСтрокаТЧ.Пользователь 						= ПараметрыСеанса.ТекущийПользователь;
	нСтрокаТЧ.DeliveryDate 						= СУОбъект.DeliveryDate;
	нСтрокаТЧ.СрокДействияСпециальныхУсловий	= СУОбъект.СрокДействияСпециальныхУсловий;
	нСтрокаТЧ.КоличествоПродуктов 				= СУОбъект.КоличествоПродуктов;
	
	Попытка
		СУОбъект.Записать();
		ВывестиСообщениеПол(Нстр("ru = 'У специальных условий № %1 установлен статус ""%2""'"),,,,,СУ,Статус);
		Возврат Истина;
	Исключение
		ВывестиСообщениеПол(Нстр("ru = 'Произошла ошибка при записи специальных условий %1: '" + ОписаниеОшибки()),,,,,СУОбъект.Ссылка);
		ЗаписьЖурналаРегистрации(Нстр("ru = 'Произошла ошибка при записи специальных условий %1: '"),
								УровеньЖурналаРегистрации.Ошибка,,СУОбъект.Ссылка,Нстр("ru = 'Произошла ошибка при записи специальных условий: '" + ОписаниеОшибки()));
		Возврат Ложь;							
	КонецПопытки;								
	//rarus vikhle 26.01.2021 mt 16929 ---
	
КонецФункции	

//rarus vikhle 28.02.2021 mt 17186 +++
Функция ПродуктВходитВСУ(Продукт,СУ) Экспорт
	
	Возврат НЕ СУ.СписокПродуктов.Найти(Продукт) = Неопределено;
	
КонецФункции
//rarus vikhle 28.02.2021 mt 17186 ---