//rarus tenkam 24.06.2016 mantis 6925 ++ (доп. пожелание) 
&НаКлиенте
Процедура КомандаОК(Команда)
	ПараметрыБукингЛиста = Новый Структура;
	ПараметрыБукингЛиста.Вставить("НомерБукингЛиста", СокрЛП(НомерБукингЛиста));	//rarus tenkam 10.05.2017 mantis 9608 + (сокрЛП)
	ПараметрыБукингЛиста.Вставить("ДатаБукингЛиста", ДатаБукингЛиста);
	
	//rarus tenkam 23.02.2017 mantis 8492 +++
	Если ЗначениеЗаполнено(МестоДоставки) Тогда
		ПараметрыБукингЛиста.Вставить("МестоДоставки", МестоДоставки);
		ПараметрыБукингЛиста.Вставить("CDDПоставщик", CDDПоставщик);
	КонецЕсли;
	//rarus tenkam 23.02.2017 mantis 8492 ---
	Закрыть(ПараметрыБукингЛиста);
КонецПроцедуры
//rarus tenkam 24.06.2016 mantis 6925 --