
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 08.10.2019 14177 ++
	Если Объект.Ссылка.Пустая() Тогда
		ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
		Сообщить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ПриОткрытии(Отказ) //rarus bonmak 08.10.2019 14177 ++
	Если Объект.Предопределенный Тогда		
		Элементы.Код.Видимость = Ложь;
		Элементы.НаименованиеАнглийское.Видимость = Ложь;
		Элементы.IDExternalSystem.Видимость = Ложь;
		Элементы.ДатаОбновления.Видимость = Ложь;
		Элементы.ИспользоватьВСпецификации.Видимость = Ложь;
		Элементы.ОсновнаяОпция.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --
