
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 09.01.2020 15279 ++
	Если Объект.Ссылка = Справочники.Scan_ВидыСобытий1БД.ПустаяСсылка() Тогда
		ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
		Сообщить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	УправлениеДиалогомНаСервере();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры //rarus bonmak 09.01.2020 15279 --

&НаСервере
Процедура УправлениеДиалогомНаСервере() //rarus bonmak 09.01.2020 15279 ++		
	Элементы.Использовать.Доступность = РольДоступна("ПолныеПрава");
	Элементы.IDExternalSystem.Доступность = РольДоступна("ПолныеПрава");
КонецПроцедуры //rarus bonmak 09.01.2020 15279 --

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 --- 
