// Определяет закрепленного за дилером менеджера.
//
// Параметры:
//  Дилер - СправочникСсылка.Scan_Компании - компания дилера, для которого определяется закрепленный менеджер.
//
// Возвращаемое значение:
//   СправочникСсылка.Scan_Сотрудники - Пустая ссылка если за компанией не закреплен менеджер, 
//	в остальных случаях ссылка на закрепленного менеджера
//  
&НаСервере
Функция ПолучитьЗакрепленногоМенеджера(Дилер) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиСрезПоследних.Менеджер КАК Менеджер
		|ИЗ
		|	РегистрСведений.Scan_ЗакреплениеМенеджеровЗаДилерами.СрезПоследних(, Дилер = &Ссылка) КАК Scan_ЗакреплениеМенеджеровЗаДилерамиСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Дилер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЗакрепленныйМенеджер = Справочники.Scan_Сотрудники.ПустаяСсылка();
	Если ВыборкаДетальныеЗаписи.Следующий() ТОгда
		ЗакрепленныйМенеджер = ВыборкаДетальныеЗаписи.Менеджер;
	КонецЕсли;
	
	Возврат ЗакрепленныйМенеджер;
КонецФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_КураторыПоРегиональнымМенеджерам";
	КомандаПечати.Представление = НСтр("ru = 'Кураторы по региональным менеджерам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью    = Ложь;
	КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_КураторыПоФедеральнымОкругам";
	КомандаПечати.Представление = НСтр("ru = 'Кураторы по федеральным округам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью    = Ложь;
	КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	
КонецПроцедуры //rarus bonmak 07.01.2021 16625 --

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_КураторыПоРегиональнымМенеджерам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПФ_MXL_КураторыПоРегиональнымМенеджерам",
		"Кураторы по региональным менеджерам",
		ПечатьПФ_MXL_КураторыПоРегиональнымМенеджерам(МассивОбъектов[0], ОбъектыПечати,, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_КураторыПоФедеральнымОкругам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПФ_MXL_КураторыПоФедеральнымОкругам",
		"Кураторы по федеральным округам",
		ПечатьПФ_MXL_КураторыПоФедеральнымОкругам(МассивОбъектов[0], ОбъектыПечати,, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры //rarus bonmak 07.01.2021 16625 --

Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
КонецФункции //rarus bonmak 07.01.2021 16625 --

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для вызова из дополнительной печатной формы.

Функция ПечатьПФ_MXL_КураторыПоРегиональнымМенеджерам(ДокументСсылка, ОбъектыПечати, ИмяМакета = "ПФ_MXL_КураторыПоРегиональнымМенеджерам", ПараметрыПечати) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	Scan_СборСтатистики.Scan_Печать(ИмяМакета); // Rarus tenkam 11.04.2022 mantis 18433 +
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяМакета;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ПФ_MXL_КураторыПоРегиональнымМенеджерам");
	
	//Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьЗаголовок.Параметры.НомерРаспоряжения = ДокументСсылка.НомерРаспоряжения;
	ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(ДокументСсылка.ДатаРаспоряжения, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	//Шапка таблицы
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер КАК Дилер,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер КАК Менеджер,
	|	Scan_КомпанииРегионыОтветственности.Регион КАК Регион,
	|	Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг КАК ФедеральныйОкруг,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование КАК ДилерНаименование
	|ИЗ
	|	Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ОтветственныеМенеджеры КАК Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_Компании.РегионыОтветственности КАК Scan_КомпанииРегионыОтветственности
	|		ПО Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер = Scan_КомпанииРегионыОтветственности.Ссылка
	|ГДЕ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка = &СсылкаДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	//rarus bonmak 29.03.2021 17306 ++
	//|	Менеджер,
	//|	ФедеральныйОкруг,
	//|	Регион,
	//|	ДилерНаименование
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер.Наименование,
	|  Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг.Наименование,
	|  Scan_КомпанииРегионыОтветственности.Регион.Наименование,
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование
	//rarus bonmak 29.03.2021 17306 --
	|ИТОГИ ПО
	|	Менеджер";
	
	Запрос.Параметры.Вставить("СсылкаДокумент", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМенеджер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Менеджер");
	ОбъединениеНачало = 8;
	ОбъединениеКонец = 8;
	НомерСтраницы = 1;
	Пока ВыборкаМенеджер.Следующий() Цикл
		ОбластьСтрокаМенеджер = Макет.ПолучитьОбласть("СтрокаМенеджер");
		ОбластьСтрокаМенеджер.Параметры.ЗначениеМенеджер = ВыборкаМенеджер.Менеджер;
		НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаМенеджер, , , НомерСтраницы, , ДокументСсылка);
		
		ВыборкаДетЗаписи = ВыборкаМенеджер.Выбрать();
		Пока ВыборкаДетЗаписи.Следующий() Цикл
			
			ОбластьСтрокаРегионы = Макет.ПолучитьОбласть("СтрокаРегионы");
			ОбластьСтрокаРегионы.Параметры.ЗначениеФО = ВыборкаДетЗаписи.ФедеральныйОкруг;
			ОбластьСтрокаРегионы.Параметры.ЗначениеРегион = ВыборкаДетЗаписи.Регион;
			ОбластьСтрокаРегионы.Параметры.ЗначениеДилер = ВыборкаДетЗаписи.Дилер;
			НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаРегионы, , , НомерСтраницы, , ДокументСсылка);
			ОбъединениеКонец = ОбъединениеКонец + 1;
		КонецЦикла;
		//объединим одинаковые ячейки
		ОбъединениеНачалоФО = ОбъединениеНачало;
		ОбъединениеНачалоРегион = ОбъединениеНачало;
		ОбъединениеНачалоДилер = ОбъединениеНачало;
		Для Строка = ОбъединениеНачало По ОбъединениеКонец Цикл
			//объединение ФО
			Если ТабличныйДокумент.Область("R"+Строка+"C2").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C2").Текст
				ИЛИ ОбъединениеНачалоФО = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоФО+"C2"+":"+"R"+Строка(Строка-1)+"C2").Объединить();
				ОбъединениеНачалоФО = Строка;
			КонецЕсли;
			//объединение Регион
			Если ТабличныйДокумент.Область("R"+Строка+"C3").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C3").Текст
				ИЛИ ОбъединениеНачалоРегион = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоРегион+"C3"+":"+"R"+Строка(Строка-1)+"C3").Объединить();
				ОбъединениеНачалоРегион = Строка;
			КонецЕсли;
			//объединение Дилер
			Если ТабличныйДокумент.Область("R"+Строка+"C4").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C4").Текст
				ИЛИ ОбъединениеНачалоДилер = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоДилер+"C4"+":"+"R"+Строка(Строка-1)+"C4").Объединить();
				ОбъединениеНачалоДилер = Строка;
			КонецЕсли;
			
		КонецЦикла;
		ОбъединениеНачало = ОбъединениеКонец + 1; 
		ОбъединениеКонец  = ОбъединениеКонец + 1;
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ПодписантДолжность = ДокументСсылка.ПодписантВПФ.Должность;
	ОбластьПодвал.Параметры.Подписант = ДокументСсылка.ПодписантВПФ;
	НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы, , ДокументСсылка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции //rarus bonmak 07.01.2021 16625 --

Функция ПечатьПФ_MXL_КураторыПоФедеральнымОкругам(ДокументСсылка, ОбъектыПечати, ИмяМакета = "ПФ_MXL_КураторыПоФедеральнымОкругам", ПараметрыПечати) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	Scan_СборСтатистики.Scan_Печать(ИмяМакета); // Rarus tenkam 11.04.2022 mantis 18433 +
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяМакета;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ПФ_MXL_КураторыПоФедеральнымОкругам");
	
	//Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьЗаголовок.Параметры.НомерРаспоряжения = ДокументСсылка.НомерРаспоряжения;
	ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(ДокументСсылка.ДатаРаспоряжения, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	//Шапка таблицы
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер КАК Дилер,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер КАК Менеджер,
	|	Scan_КомпанииРегионыОтветственности.Регион КАК Регион,
	|	Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг КАК ФедеральныйОкруг,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование КАК ДилерНаименование
	|ИЗ
	|	Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ОтветственныеМенеджеры КАК Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_Компании.РегионыОтветственности КАК Scan_КомпанииРегионыОтветственности
	|		ПО Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер = Scan_КомпанииРегионыОтветственности.Ссылка
	|ГДЕ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка = &СсылкаДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	//rarus bonmak 29.03.2021 17306 ++
	//|	ФедеральныйОкруг,
	//|	Регион,
	//|	ДилерНаименование,
	//|	Менеджер
	//|	Менеджер,
	//|	Регион,
	//|	ДилерНаименование
	|  Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг.Наименование,
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер.Наименование,
	|  Scan_КомпанииРегионыОтветственности.Регион.Наименование,
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование
	//rarus bonmak 29.03.2021 17306 --
	|ИТОГИ ПО
	|	ФедеральныйОкруг";
	
	Запрос.Параметры.Вставить("СсылкаДокумент", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФО = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФедеральныйОкруг");
	ОбъединениеНачало = 8;
	ОбъединениеКонец = 8;
	НомерСтраницы = 1;
	Пока ВыборкаФО.Следующий() Цикл
		ОбластьСтрокаФО = Макет.ПолучитьОбласть("СтрокаФО");
		ОбластьСтрокаФО.Параметры.ЗначениеФО = ВыборкаФО.ФедеральныйОкруг;
		НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаФО, , , НомерСтраницы, , ДокументСсылка);
		
		ВыборкаДетЗаписи = ВыборкаФО.Выбрать();
		Пока ВыборкаДетЗаписи.Следующий() Цикл
			
			ОбластьСтрокаРегионы = Макет.ПолучитьОбласть("СтрокаРегионы");
			ОбластьСтрокаРегионы.Параметры.ЗначениеМенеджер = ВыборкаДетЗаписи.Менеджер;
			ОбластьСтрокаРегионы.Параметры.ЗначениеРегион = ВыборкаДетЗаписи.Регион;
			ОбластьСтрокаРегионы.Параметры.ЗначениеДилер = ВыборкаДетЗаписи.Дилер;
			НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаРегионы, , , НомерСтраницы, , ДокументСсылка);
			ОбъединениеКонец = ОбъединениеКонец + 1;
		КонецЦикла;
		//объединим одинаковые ячейки
		ОбъединениеНачалоМенеджер = ОбъединениеНачало;
		ОбъединениеНачалоРегион   = ОбъединениеНачало;
		ОбъединениеНачалоДилер    = ОбъединениеНачало;
		Для Строка = ОбъединениеНачало По ОбъединениеКонец Цикл
			//объединение Регион
			Если ТабличныйДокумент.Область("R"+Строка+"C2").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C2").Текст
				ИЛИ ОбъединениеНачалоРегион = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоРегион+"C2"+":"+"R"+Строка(Строка-1)+"C2").Объединить();
				ОбъединениеНачалоРегион = Строка;
			КонецЕсли;
			//объединение Дилер
			Если ТабличныйДокумент.Область("R"+Строка+"C3").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C3").Текст
				ИЛИ ОбъединениеНачалоДилер = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоДилер+"C3"+":"+"R"+Строка(Строка-1)+"C3").Объединить();
				ОбъединениеНачалоДилер = Строка;
			КонецЕсли;
			//объединение Менеджер
			Если ТабличныйДокумент.Область("R"+Строка+"C4").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C4").Текст
				ИЛИ ОбъединениеНачалоМенеджер = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоМенеджер+"C4"+":"+"R"+Строка(Строка-1)+"C4").Объединить();
				ОбъединениеНачалоМенеджер = Строка;
			КонецЕсли;
			
		КонецЦикла;
		ОбъединениеНачало = ОбъединениеКонец + 1; 
		ОбъединениеКонец  = ОбъединениеКонец + 1;
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ПодписантДолжность = ДокументСсылка.ПодписантВПФ.Должность;
	ОбластьПодвал.Параметры.Подписант = ДокументСсылка.ПодписантВПФ;
	НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы, , ДокументСсылка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции //rarus bonmak 07.01.2021 16625 --

#КонецОбласти
#КонецЕсли
