
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого ТекСтрока из ОтветственныеМенеджеры Цикл
		Если не ЗначениеЗаполнено(ТекСтрока.Дилер) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Не заполнено поле ""Дилер""'; en = 'Не заполнено поле ""Дилер""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Дилер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		КонецЕсли;
		Если не ЗначениеЗаполнено(ТекСтрока.Менеджер) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Не заполнено поле ""Менеджер""'; en = 'Не заполнено поле ""Менеджер""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Менеджер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		КонецЕсли;
		Если (текстрока.Дилер = Справочники.Scan_Компании.СканияРусь) и (ТекСтрока.Менеджер.МенеджерСканияРусь = ложь) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Для дилера ""Скания Русь"" указан сотрудник без признака ""менеджер Скания-Русь""'; en = 'Для дилера ""Скания Русь"" указан сотрудник без признака ""менеджер Скания-Русь""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Менеджер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		Конецесли;			
		
	КонецЦикла;
	КопияОтветственных = ОтветственныеМенеджеры.Выгрузить();
	КоличествоОбщее = КопияОтветственных.Количество();
	КопияОтветственных.Свернуть("Дилер");
	КоличествоСгруппированных = КопияОтветственных.Количество();
	Если не КоличествоОбщее = КоличествоСгруппированных ТОгда
		
		ВывестиСообщениеПол(Нстр("ru = 'Есть дубли дилеров'; en = 'Есть дубли дилеров'"),ЭтотОбъект,"ОтветственныеМенеджеры");
			Отказ = истина;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//rarus vikhle 28.02.2022 m 18879 +++
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДанныеSetAdditionalProperty = Scan_ВспомогательныеФункцииСервер.ПолучитьДанныеSetAdditionalProperty(ЭтотОбъект);
		ДополнительныеСвойства.Вставить("ДанныеSetAdditionalProperty", ДанныеSetAdditionalProperty);	
		
	КонецЕсли;	
		
	Scan_ВспомогательныеФункцииСервер.ПроверитьМенеджеровДокументаЗакрепления(ЭтотОбъект, Отказ);
	//rarus vikhle 28.02.2022 m 18879 ---
	 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка.ДатаРаспоряжения КАК Период,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.НомерСтроки КАК НомерСтроки,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер КАК Дилер,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер КАК Менеджер,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка.Менеджер КАК Пользователь,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ОтветственныеМенеджеры КАК Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры
		|ГДЕ
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка = &Ссылка";
	//rarus vikhle 30.09.2020 mt 16573 заменил в запросе автора на менеджера для пользователя
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
	Движения.Scan_ЗакреплениеМенеджеровЗаДилерами.Загрузить(Запрос.Выполнить().Выгрузить());	
	
	Движения.Scan_ЗакреплениеМенеджеровЗаДилерами.Записать();
	
	// rarus vikhle 01.03.20 22 m 18879 +++
	Если ДополнительныеСвойства.Свойство("ДанныеSetAdditionalProperty") Тогда
		
		Scan_ВспомогательныеФункцииСервер.ОтправитьЗакрепленныхМенеджеровВ1БД(ДополнительныеСвойства.ДанныеSetAdditionalProperty,
							Справочники.Scan_ДополнительныеРеквизиты1БД.РегиональныйМенеджерОП.ИмяПредопределенныхДанных);
							
	КонецЕсли;	
	// rarus vikhle 01.03.2022 m 18879 ---
	
КонецПроцедуры

