//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	// rarus tenkam 11.12.2020 mantis 16697 +-
	
	//rarus vikhle 13.01.2021 15695 +++
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь,"ПользовательСотрудник") И НЕ РольДоступна("ПолныеПрава") Тогда 
		ВызватьИсключение НСтр("ru = 'Открытие формы доступно только для сотрудников Скания Русь и пользователей с полными правами.'");
	КонецЕсли;	
	//rarus vikhle 13.01.2021 15695 ---
	
	Если Параметры.Свойство("Продукт") И Параметры.Свойство("ЗаказНаЗавод") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Продукт", Параметры.Продукт, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЗаказНаЗавод", Параметры.ЗаказНаЗавод, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли Параметры.Свойство("Продукт") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Продукт", Параметры.Продукт, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли Параметры.Свойство("ЗаказНаЗавод") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЗаказНаЗавод", Параметры.ЗаказНаЗавод, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти