//rarus tenkam 10.08.2017 mantis 10589 +++

Процедура ПересчитатьПлатона(Параметры = Неопределено) Экспорт
	ИмяСобытия = НСтр("ru = 'ПересчетТарифов.Платон'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начат пересчет тарифов по услуге Платон'"));
	
	НаДату = ТекущаяДата();
	
	// Получим параметры для расчета Платона
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_ЗначенияДанныхДляРасчетаУслугиПлатонСрезПоследних.Период,
	|	Scan_ЗначенияДанныхДляРасчетаУслугиПлатонСрезПоследних.КоэффициентВзиманияПлаты,
	|	Scan_ЗначенияДанныхДляРасчетаУслугиПлатонСрезПоследних.ТарифОплатыЗа1Км
	|ИЗ
	|	РегистрСведений.Scan_ЗначенияДанныхДляРасчетаУслугиПлатон.СрезПоследних(&НаДату, Услуга = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.УслугаПлатон)) КАК Scan_ЗначенияДанныхДляРасчетаУслугиПлатонСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", НаДату);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КоэффициентВзиманияПлаты = ВыборкаДетальныеЗаписи.КоэффициентВзиманияПлаты;
		ТарифОплатыЗа1Км = ВыборкаДетальныеЗаписи.ТарифОплатыЗа1Км;
		ДействующийРазмерПлатыЗа1Км = ТарифОплатыЗа1Км * КоэффициентВзиманияПлаты;
		ПериодУстановкиПараметров = ВыборкаДетальныеЗаписи.Период;
	КонецЕсли;
	
	// Получим возможные способы доставки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.СпособДоставки
		|ИЗ
		|	РегистрСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.СрезПоследних(&НаДату, Услуга = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.УслугаПлатон)) КАК Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.СпособДоставки";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТабРезультат = РезультатЗапроса.Выгрузить();
	Если ТабРезультат.Количество() <> 0 Тогда
		МассивСпособовДоставки = ТабРезультат.ВыгрузитьКолонку("СпособДоставки");
	Иначе
		МассивСпособовДоставки = Новый Массив;
	КонецЕсли;
	
	//Запишем тарифы
	Для Каждого ТекСтрокаСпособа Из МассивСпособовДоставки Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_РасстояниеМеждуАдресами.АдресПолучения,
		|	Scan_РасстояниеМеждуАдресами.АдресДоставки,
		|	Scan_РасстояниеМеждуАдресами.Расстояние
		|ИЗ
		|	РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами";
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Справочники.Scan_НоменклатураУслуг.ЗаписьСтоимостейВРегистр(Справочники.Scan_НоменклатураУслуг.УслугаПлатон, ВыборкаДетальныеЗаписи.Расстояние * ДействующийРазмерПлатыЗа1Км, ТекСтрокаСпособа,
												ВыборкаДетальныеЗаписи.АдресПолучения, ВыборкаДетальныеЗаписи.АдресДоставки, Ложь, ПериодУстановкиПараметров);
		КонецЦикла;
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Завершен пересчет тарифов по услуге Платон'"));

КонецПроцедуры

Процедура ПересчитатьДоставкуПолнуюЛьготную(Параметры = Неопределено) Экспорт
	ПересчитатьДоставкуПолную(Параметры);
	//ПересчитатьДоставкуЛьготную(Параметры); // rarus tenkam 31.08.2021 mantis 17628 +++	       	
	ПересчитатьДоставкуЛьготнуюРасчетПоСкидке(Параметры);	//rarus tenkam 10.08.2017 mantis 10589 +
	//УдалитьСтрокиСПустойСтоимостью();	//rarus tenkam 31.03.2021 mantis 17101 + // rarus tenkam 03.08.2021 mantis 17628 +
КонецПроцедуры

Процедура ПересчитатьДоставкуЛьготную(Параметры = Неопределено) Экспорт
	ИмяСобытия = НСтр("ru = 'ПересчетТарифов.ДоставкаЛьготная'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начат пересчет тарифов по услуге Доставка льготная'"));

	// rarus tenkam 31.08.2021 mantis 17628 +++	
	// Устаревшая
	Возврат;
	// rarus tenkam 31.08.2021 mantis 17628 ---	
		
	Если Параметры <> Неопределено И ТипЗнч(Параметры) = Тип("Дата") Тогда
		НаДату = Параметры;
	Иначе
		НаДату = ТекущаяДата();
	КонецЕсли;

	ЛьготноеРасстрояние = Scan_ПраваИНастройки.Scan_Право("ЛьготноеРасстояниеПриДоставке");
	//Получим все тарифы
	Запрос = Новый Запрос;
	// rarus tenkam 14.12.2018 mantis 13736 +++
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период) КАК ДатаТарифаПеревозчика,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Стоимость1Км) КАК Стоимость1Км,
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0) КАК Расстояние
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
	//|		ПО Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	//|			И Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ТарифУказанВручную
	//|ПОМЕСТИТЬ ТарифыУжеЗаписанные
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(&НаДату, УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаЛьготная)) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика,
	//|	АктуальныеТарифыПеревозчика.СпособДоставки,
	//|	АктуальныеТарифыПеревозчика.АдресПолучения,
	//|	АктуальныеТарифыПеревозчика.АдресДоставки,
	//|	АктуальныеТарифыПеревозчика.ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчика.КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчика.Стоимость1Км,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость,
	//|	АктуальныеТарифыПеревозчика.Расстояние
	//|ИЗ
	//|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
	//|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
	//|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
	//|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
	//|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула";
	
	// rarus tenkam 25.03.2021 mantis 17101 +++  	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период) КАК Период,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения КАК АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки КАК АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип КАК ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула КАК КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки КАК СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент КАК Контрагент
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	АдресПолучения,
	//|	АдресДоставки,
	//|	ЛогистическийТип,
	//|	КолеснаяФормула,
	//|	СпособДоставки,
	//|	Контрагент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчиковМаксПериод.Период КАК Период,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула КАК КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки КАК СпособДоставки,
	//|	МАКСИМУМ(ЕСТЬNULL(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Стоимость1Км, 0)) КАК Стоимость1Км
	//|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
	//|ИЗ
	//|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|		ПО АктуальныеТарифыПеревозчиковМаксПериод.Период = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.Контрагент = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.Период,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Период) КАК ДатаТарифаПеревозчика,		// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ +		
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула КАК КолеснаяФормула,
	//|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Стоимость1Км) КАК Стоимость1Км,		// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ +
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0) КАК Расстояние,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки КАК СпособДоставки
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
	//|ИЗ
	//|	АктуальныеМаксимальныеТарифыПеревозчика2 КАК АктуальныеМаксимальныеТарифыПеревозчика2
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
	//|		ПО АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	//|			И АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
	//|	// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ +++
	//|СГРУППИРОВАТЬ ПО
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки,
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0)
	//|;	// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ ---
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ЛогистическийТип КАК ЛогистическийТип,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.СпособДоставки КАК СпособДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.КолеснаяФормула КАК КолеснаяФормула,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресПолучения КАК АдресПолучения,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресДоставки КАК АдресДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость КАК Стоимость,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ТарифУказанВручную КАК ТарифУказанВручную
	//|ПОМЕСТИТЬ ТарифыУжеЗаписанные
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(&НаДату, УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаЛьготная)) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
	//|	АктуальныеТарифыПеревозчика.СпособДоставки КАК СпособДоставки,
	//|	АктуальныеТарифыПеревозчика.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеТарифыПеревозчика.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеТарифыПеревозчика.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчика.КолеснаяФормула КАК КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчика.Стоимость1Км КАК Стоимость1Км,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость,
	//|	АктуальныеТарифыПеревозчика.Расстояние КАК Расстояние
	//|ИЗ
	//|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
	//|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
	//|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
	//|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
	//|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула";
	//// rarus tenkam 14.12.2018 mantis 13736 ---
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаДат.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончанияДоговора,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияДоговора
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период <= &НаДату
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ КАК ДатыНачалаОкончания
		|ПОМЕСТИТЬ ВсеДатыНачалаОкончания
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания КАК ДатаНачала
		|ИЗ
		|	ВсеДатыНачалаОкончания КАК ВсеДатыНачалаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		нСтрока = ТаблицаДат.Добавить();
		нСтрока.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
	КонецЦикла;
	
	Для Сч=0 По ТаблицаДат.Количество()-1 Цикл
		Если Сч = ТаблицаДат.Количество()-1 Тогда
			ТаблицаДат[Сч].ДатаОкончания = Дата('39991231');
		Иначе
			ТаблицаДат[Сч].ДатаОкончания = ТаблицаДат[Сч+1].ДатаНачала;
		КонецЕсли;
		Если ТаблицаДат[Сч].ДатаНачала = Дата('39991231') Тогда
			ТаблицаДат.Удалить(Сч);
		КонецЕсли;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = // rarus tenkam 03.08.2021 mantis 17628 + изменен запрос  
		"ВЫБРАТЬ
		|	ТаблицаДат.ДатаНачала КАК ДатаНачала,
		|	ТаблицаДат.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ТЗДат
		|ИЗ
		|	&ТаблицаДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделий.Период) КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончанияДоговора,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияДоговора,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Стоимость1Км
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период КАК Период,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения КАК АдресПолучения,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки КАК АдресДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки КАК СпособДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Контрагент КАК Контрагент,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ КАК ДатаОкончания,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ ТарифыСДатойОкончания
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип,
		|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула,
		|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Контрагент,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ДоговорКонтрагента,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Стоимость1Км
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗДат.ДатаНачала КАК ДатаНачала,
		|	ТЗДат.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыСДатойОкончания.АдресПолучения КАК АдресПолучения,
		|	ТарифыСДатойОкончания.АдресДоставки КАК АдресДоставки,
		|	ТарифыСДатойОкончания.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыСДатойОкончания.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыСДатойОкончания.СпособДоставки КАК СпособДоставки,
		|	ТарифыСДатойОкончания.Контрагент КАК Контрагент,
		|	ТарифыСДатойОкончания.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТарифыСДатойОкончания.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ ТарифыПоДатам
		|ИЗ
		|	ТЗДат КАК ТЗДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТарифыСДатойОкончания КАК ТарифыСДатойОкончания
		|		ПО (ТарифыСДатойОкончания.Период <= ТЗДат.ДатаНачала)
		|			И (ТарифыСДатойОкончания.ДатаОкончания >= ТЗДат.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоДатам.ДатаНачала КАК ДатаНачала,
		|	ТарифыПоДатам.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыПоДатам.АдресПолучения КАК АдресПолучения,
		|	ТарифыПоДатам.АдресДоставки КАК АдресДоставки,
		|	ТарифыПоДатам.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыПоДатам.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыПоДатам.СпособДоставки КАК СпособДоставки,
		|	МАКСИМУМ(ТарифыПоДатам.Стоимость1Км) КАК Стоимость1Км
		|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчикаПоДатам
		|ИЗ
		|	ТарифыПоДатам КАК ТарифыПоДатам
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыПоДатам.ДатаНачала,
		|	ТарифыПоДатам.ДатаОкончания,
		|	ТарифыПоДатам.АдресПолучения,
		|	ТарифыПоДатам.АдресДоставки,
		|	ТарифыПоДатам.ЛогистическийТип,
		|	ТарифыПоДатам.КолеснаяФормула,
		|	ТарифыПоДатам.СпособДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ДатаОкончания) КАК ДатаОкончания,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресПолучения КАК АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресДоставки КАК АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.СпособДоставки КАК СпособДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
		|ИЗ
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам КАК АктуальныеМаксимальныеТарифыПеревозчикаПоДатам
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.СпособДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Стоимость1Км
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаНачала КАК ДатаТарифаПеревозчика,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаОкончания КАК ДатаОкончания,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения КАК АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки КАК АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула КАК КолеснаяФормула,
		|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Стоимость1Км) КАК Стоимость1Км,
		|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0) КАК Расстояние,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки КАК СпособДоставки
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
		|ИЗ
		|	АктуальныеМаксимальныеТарифыПеревозчика2 КАК АктуальныеМаксимальныеТарифыПеревозчика2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
		|		ПО АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
		|			И АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки,
		|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0),
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаНачала,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Период КАК Период,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Стоимость КАК Стоимость,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ТарифУказанВручную КАК ТарифУказанВручную
		|ПОМЕСТИТЬ ТарифыУжеЗаписанные
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаЛьготная)
		|	И Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Период <= &НаДату
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	АктуальныеТарифыПеревозчика.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыУжеЗаписанные.Период КАК Период,
		|	АктуальныеТарифыПеревозчика.СпособДоставки КАК СпособДоставки,
		|	АктуальныеТарифыПеревозчика.АдресПолучения КАК АдресПолучения,
		|	АктуальныеТарифыПеревозчика.АдресДоставки КАК АдресДоставки,
		|	АктуальныеТарифыПеревозчика.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеТарифыПеревозчика.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеТарифыПеревозчика.Стоимость1Км КАК Стоимость1Км,
		|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
		|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость,
		|	АктуальныеТарифыПеревозчика.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ АктуальноеИСуществующее
		|ИЗ
		|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
		|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
		|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
		|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
		|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
		|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула
		|			И АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика = ТарифыУжеЗаписанные.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальноеИСуществующее.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	АктуальноеИСуществующее.ДатаОкончания КАК ДатаОкончания,
		|	АктуальноеИСуществующее.Период КАК Период,
		|	АктуальноеИСуществующее.СпособДоставки КАК СпособДоставки,
		|	АктуальноеИСуществующее.АдресПолучения КАК АдресПолучения,
		|	АктуальноеИСуществующее.АдресДоставки КАК АдресДоставки,
		|	АктуальноеИСуществующее.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальноеИСуществующее.КолеснаяФормула КАК КолеснаяФормула,
		|	МАКСИМУМ(АктуальноеИСуществующее.Стоимость1Км) КАК Стоимость1Км,
		|	МАКСИМУМ(ВЫРАЗИТЬ((АктуальноеИСуществующее.Расстояние - &ЛьготноеРасстрояние) * АктуальноеИСуществующее.Стоимость1Км * (1 + &РазмерСтавки) / 100 КАК ЧИСЛО(10, 2))) КАК НоваяСтоимость,
		|	АктуальноеИСуществующее.ТарифУказанВручную КАК ТарифУказанВручную,
		|	АктуальноеИСуществующее.Стоимость КАК Стоимость,
		|	АктуальноеИСуществующее.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ ИтогоБезПустыхТарифов
		|ИЗ
		|	АктуальноеИСуществующее КАК АктуальноеИСуществующее
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальноеИСуществующее.Период,
		|	АктуальноеИСуществующее.СпособДоставки,
		|	АктуальноеИСуществующее.АдресПолучения,
		|	АктуальноеИСуществующее.АдресДоставки,
		|	АктуальноеИСуществующее.ЛогистическийТип,
		|	АктуальноеИСуществующее.КолеснаяФормула,
		|	АктуальноеИСуществующее.ТарифУказанВручную,
		|	АктуальноеИСуществующее.Стоимость,
		|	АктуальноеИСуществующее.Расстояние,
		|	АктуальноеИСуществующее.ДатаТарифаПеревозчика,
		|	АктуальноеИСуществующее.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальноеИСуществующее
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогоБезПустыхТарифов.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	ИтогоБезПустыхТарифов.ДатаОкончания КАК ДатаОкончания,
		|	ИтогоБезПустыхТарифов.Период КАК Период,
		|	ИтогоБезПустыхТарифов.СпособДоставки КАК СпособДоставки,
		|	ИтогоБезПустыхТарифов.АдресПолучения КАК АдресПолучения,
		|	ИтогоБезПустыхТарифов.АдресДоставки КАК АдресДоставки,
		|	ИтогоБезПустыхТарифов.ЛогистическийТип КАК ЛогистическийТип,
		|	ИтогоБезПустыхТарифов.КолеснаяФормула КАК КолеснаяФормула,
		|	ИтогоБезПустыхТарифов.Стоимость1Км КАК Стоимость1Км,
		|	ИтогоБезПустыхТарифов.НоваяСтоимость КАК НоваяСтоимость,
		|	ИтогоБезПустыхТарифов.ТарифУказанВручную КАК ТарифУказанВручную,
		|	ИтогоБезПустыхТарифов.Стоимость КАК Стоимость,
		|	ИтогоБезПустыхТарифов.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ ИтогоБезПустыхСОтбором
		|ИЗ
		|	ИтогоБезПустыхТарифов КАК ИтогоБезПустыхТарифов
		|ГДЕ
		|	(ИтогоБезПустыхТарифов.Стоимость <> ИтогоБезПустыхТарифов.НоваяСтоимость
		|			ИЛИ ИтогоБезПустыхТарифов.НоваяСтоимость = 0
		|			ИЛИ ИтогоБезПустыхТарифов.Стоимость = 0)
		|	И ИтогоБезПустыхТарифов.Расстояние > 0
		|	И ИтогоБезПустыхТарифов.Расстояние > &ЛьготноеРасстрояние
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтогоБезПустыхТарифов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ДатаТарифаПеревозчика, ИтогоБезПустыхСОтбором1.ДатаОкончания) КАК ДатаТарифаПеревозчика,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Период, ИтогоБезПустыхСОтбором1.ДатаОкончания) КАК Период,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.СпособДоставки, ИтогоБезПустыхСОтбором1.СпособДоставки) КАК СпособДоставки,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.АдресПолучения, ИтогоБезПустыхСОтбором1.АдресПолучения) КАК АдресПолучения,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.АдресДоставки, ИтогоБезПустыхСОтбором1.АдресДоставки) КАК АдресДоставки,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ЛогистическийТип, ИтогоБезПустыхСОтбором1.ЛогистическийТип) КАК ЛогистическийТип,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.КолеснаяФормула, ИтогоБезПустыхСОтбором1.КолеснаяФормула) КАК КолеснаяФормула,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Стоимость1Км, 0) КАК Стоимость1Км,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.НоваяСтоимость, 0) КАК НоваяСтоимость,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ТарифУказанВручную, ИтогоБезПустыхСОтбором.ТарифУказанВручную) КАК ТарифУказанВручную,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Стоимость, 0) КАК Стоимость,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Расстояние, ИтогоБезПустыхСОтбором.Расстояние) КАК Расстояние
		|ПОМЕСТИТЬ ИтогоСПустыми
		|ИЗ
		|	ИтогоБезПустыхСОтбором КАК ИтогоБезПустыхСОтбором
		|		ПОЛНОЕ СОЕДИНЕНИЕ ИтогоБезПустыхСОтбором КАК ИтогоБезПустыхСОтбором1
		|		ПО (ИтогоБезПустыхСОтбором1.ДатаОкончания = ИтогоБезПустыхСОтбором.ДатаТарифаПеревозчика)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогоСПустыми.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	ИтогоСПустыми.Период КАК Период,
		|	ИтогоСПустыми.СпособДоставки КАК СпособДоставки,
		|	ИтогоСПустыми.АдресПолучения КАК АдресПолучения,
		|	ИтогоСПустыми.АдресДоставки КАК АдресДоставки,
		|	ИтогоСПустыми.ЛогистическийТип КАК ЛогистическийТип,
		|	ИтогоСПустыми.КолеснаяФормула КАК КолеснаяФормула,
		|	ИтогоСПустыми.Стоимость1Км КАК Стоимость1Км,
		|	ИтогоСПустыми.НоваяСтоимость КАК НоваяСтоимость,
		|	ИтогоСПустыми.ТарифУказанВручную КАК ТарифУказанВручную,
		|	ИтогоСПустыми.Стоимость КАК Стоимость,
		|	ИтогоСПустыми.Расстояние КАК Расстояние
		|ИЗ
		|	ИтогоСПустыми КАК ИтогоСПустыми
		|ГДЕ
		|	ИтогоСПустыми.Период <> ДАТАВРЕМЯ(3999, 12, 31)";
	
	Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);  	
	// rarus tenkam 03.08.2021 mantis 17628 +++
	Запрос.УстановитьПараметр("ЛьготноеРасстрояние", ЛьготноеРасстрояние);  	
	Запрос.УстановитьПараметр("РазмерСтавки", Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка);  	
	// rarus tenkam 03.08.2021 mantis 17628 ---
	// rarus tenkam 25.03.2021 mantis 17101 ---    	
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	РезультатЗапроса = Запрос.Выполнить();
	ТабРезультат = РезультатЗапроса.Выгрузить();
	Если ТабРезультат.Количество() = 0 Тогда
		Возврат;
	Иначе
		Для Каждого ТекТариф Из ТабРезультат Цикл
			// rarus tenkam 03.08.2021 mantis 17628 +++
			
			//// rarus tenkam 21.12.2018 mantis 13791 +++		
			////Если ТекТариф.ТарифУказанВручную Тогда
			////	Продолжить;
			////КонецЕсли;
			//// rarus tenkam 21.12.2018 mantis 13791 ---
			//// rarus tenkam 25.03.2021 mantis 17101 +++	Стоимость может стать нулевой, если контрагент/договор недействительны или истекли
			////Если ТекТариф.Расстояние > 0 И ТекТариф.Стоимость1км > 0 И ТекТариф.Расстояние > ЛьготноеРасстрояние Тогда
			//Если ТекТариф.Расстояние > 0 И ТекТариф.Расстояние > ЛьготноеРасстрояние Тогда
			//// rarus tenkam 25.03.2021 mantis 17101 ---
			//// rarus tenkam 21.12.2018 mantis 13791 +++
			//	//НоваяСтоимость = Окр((ТекТариф.Расстояние - ЛьготноеРасстрояние) * ТекТариф.Стоимость1км * 1.18,-2);
			//	НоваяСтоимость = Окр((ТекТариф.Расстояние - ЛьготноеРасстрояние) * ТекТариф.Стоимость1км * (1 + Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100),-2);
			//	// rarus tenkam 21.12.2018 mantis 13791 ---					
			//	Если ТекТариф.Стоимость <> НоваяСтоимость ИЛИ ТекТариф.Стоимость = 0 Тогда
			// rarus tenkam 03.08.2021 mantis 17628 ---
					ЗаписьРегСведений = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СоздатьМенеджерЗаписи();
					ЗаписьРегСведений.Период 				= ТекТариф.ДатаТарифаПеревозчика;
					ЗаписьРегСведений.УслугаПакета 			= Справочники.Scan_НоменклатураУслуг.ДоставкаЛьготная;
					ЗаписьРегСведений.АдресПолучения 		= ТекТариф.АдресПолучения;
					ЗаписьРегСведений.АдресДоставки 		= ТекТариф.АдресДоставки;
					ЗаписьРегСведений.КолеснаяФормула 		= ТекТариф.КолеснаяФормула;
					ЗаписьРегСведений.ЛогистическийТип 		= ТекТариф.ЛогистическийТип;
					ЗаписьРегСведений.СпособДоставки 		= ТекТариф.СпособДоставки;
					ЗаписьРегСведений.ТарифУказанВручную 	= Ложь;
					// rarus tenkam 03.08.2021 mantis 17628 +++
					//ЗаписьРегСведений.Стоимость 			= НоваяСтоимость;
					ЗаписьРегСведений.Стоимость 			= ТекТариф.НоваяСтоимость;
					// rarus tenkam 03.08.2021 mantis 17628 ---
					ЗаписьРегСведений.Пользователь 			= ПользователиКлиентСервер.ТекущийПользователь();
					Попытка
						ЗаписьРегСведений.Записать();
					Исключение
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Не удалось записать тариф в матрицу тарифов для дилеров.'"));
					КонецПопытки;
			// rarus tenkam 03.08.2021 mantis 17628 +++
			//	КонецЕсли;
			//КонецЕсли;
			// rarus tenkam 03.08.2021 mantis 17628 ---
			
		КонецЦикла;
	КонецЕсли;     
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Завершен пересчет тарифов по услуге Доставка льготная'"));

КонецПроцедуры

Процедура ПересчитатьДоставкуПолную(Параметры = Неопределено) Экспорт
	ИмяСобытия = НСтр("ru = 'ПересчетТарифов.ДоставкаПолная'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начат пересчет тарифов по услуге Доставка полная'"));
		
	// rarus tenkam 31.08.2021 mantis 17628 +++	
	//Если Параметры <> Неопределено И ТипЗнч(Параметры) = Тип("Дата") Тогда
	//	НаДату = Параметры;
	//Иначе
	//	НаДату = ТекущаяДата();
	//КонецЕсли;
	Если Параметры <> Неопределено Тогда
		Если ТипЗнч(Параметры) = Тип("Дата") Тогда
			НаДату = Параметры;
		ИначеЕсли Параметры.Свойство("ДатаУстановкиТарифа") Тогда
			НаДату = Параметры.ДатаУстановкиТарифа;
		КонецЕсли;
	Иначе
		НаДату = ТекущаяДата();
	КонецЕсли;
	// rarus tenkam 31.08.2021 mantis 17628 ---	
	
	//Получим все тарифы 
	Запрос = Новый Запрос;
	
	// rarus tenkam 27.09.2018 mantis 13597 +++
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период) КАК ДатаТарифаПеревозчика,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Стоимость1Км) КАК Стоимость1Км,
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0) КАК Расстояние
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
	//|		ПО Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	//|			И Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ТарифУказанВручную
	//|ПОМЕСТИТЬ ТарифыУжеЗаписанные
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(&НаДату, УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаПолная)) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика,
	//|	АктуальныеТарифыПеревозчика.СпособДоставки,
	//|	АктуальныеТарифыПеревозчика.АдресПолучения,
	//|	АктуальныеТарифыПеревозчика.АдресДоставки,
	//|	АктуальныеТарифыПеревозчика.ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчика.КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчика.Стоимость1Км,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость,
	//|	АктуальныеТарифыПеревозчика.Расстояние
	//|ИЗ
	//|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
	//|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
	//|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
	//|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
	//|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула";
	
	
	// rarus tenkam 25.03.2021 mantis 17101 +++
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период) КАК Период,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения КАК АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки КАК АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип КАК ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула КАК КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки КАК СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент КАК Контрагент
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	АдресПолучения,
	//|	АдресДоставки,
	//|	ЛогистическийТип,
	//|	КолеснаяФормула,
	//|	СпособДоставки,
	//|	Контрагент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчиковМаксПериод.Период КАК Период,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула КАК КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки КАК СпособДоставки,
	//|	МАКСИМУМ(ЕСТЬNULL(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Стоимость1Км, 0)) КАК Стоимость1Км
	//|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
	//|ИЗ
	//|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|		ПО АктуальныеТарифыПеревозчиковМаксПериод.Период = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.Контрагент = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.Период,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Период) КАК ДатаТарифаПеревозчика,		// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ +		
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула КАК КолеснаяФормула,
	//|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Стоимость1Км) КАК Стоимость1Км,		// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ +
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0) КАК Расстояние,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки КАК СпособДоставки
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
	//|ИЗ
	//|	АктуальныеМаксимальныеТарифыПеревозчика2 КАК АктуальныеМаксимальныеТарифыПеревозчика2
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
	//|		ПО АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	//|			И АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
	//|	// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ +++
	//|СГРУППИРОВАТЬ ПО
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки,
	//|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0)
	//|;	// rarus tenkam 21.11.2018 mantis 13766 добавлен МАКСИМУМ ---
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ЛогистическийТип КАК ЛогистическийТип,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.СпособДоставки КАК СпособДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.КолеснаяФормула КАК КолеснаяФормула,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресПолучения КАК АдресПолучения,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресДоставки КАК АдресДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость КАК Стоимость,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ТарифУказанВручную КАК ТарифУказанВручную
	//|ПОМЕСТИТЬ ТарифыУжеЗаписанные
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(&НаДату, УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаПолная)) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
	//|	АктуальныеТарифыПеревозчика.СпособДоставки КАК СпособДоставки,
	//|	АктуальныеТарифыПеревозчика.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеТарифыПеревозчика.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеТарифыПеревозчика.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчика.КолеснаяФормула КАК КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчика.Стоимость1Км КАК Стоимость1Км,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость,
	//|	АктуальныеТарифыПеревозчика.Расстояние КАК Расстояние
	//|ИЗ
	//|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
	//|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
	//|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
	//|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
	//|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула";
	//// rarus tenkam 27.09.2018 mantis 13597 --- 
	
	
	// Получим промежутки времени действия тарифов
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаДат.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончанияДоговора,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияДоговора
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период <= &НаДату
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ КАК ДатыНачалаОкончания
		|ПОМЕСТИТЬ ВсеДатыНачалаОкончания
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания КАК ДатаНачала
		|ИЗ
		|	ВсеДатыНачалаОкончания КАК ВсеДатыНачалаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		нСтрока = ТаблицаДат.Добавить();
		нСтрока.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
	КонецЦикла;
	
	Для Сч=0 По ТаблицаДат.Количество()-1 Цикл
		Если Сч = ТаблицаДат.Количество()-1 Тогда
			ТаблицаДат[Сч].ДатаОкончания = Дата('39991231');
		Иначе
			ТаблицаДат[Сч].ДатаОкончания = ТаблицаДат[Сч+1].ДатаНачала;
		КонецЕсли;
		Если ТаблицаДат[Сч].ДатаНачала = Дата('39991231') Тогда
			ТаблицаДат.Удалить(Сч);
		КонецЕсли;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = // rarus tenkam 03.08.2021 mantis 17628 + изменен запрос
		"ВЫБРАТЬ
		|	ТаблицаДат.ДатаНачала КАК ДатаНачала,
		|	ТаблицаДат.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ТЗДат
		|ИЗ
		|	&ТаблицаДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделий.Период) КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончанияДоговора,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияДоговора,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	&ДополнительныеОтборы
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Стоимость1Км
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период КАК Период,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения КАК АдресПолучения,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки КАК АдресДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки КАК СпособДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ КАК ДатаОкончания,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ ТарифыСДатойОкончания
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип,
		|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула,
		|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Контрагент,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Стоимость1Км
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗДат.ДатаНачала КАК ДатаНачала,
		|	ТЗДат.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыСДатойОкончания.АдресПолучения КАК АдресПолучения,
		|	ТарифыСДатойОкончания.АдресДоставки КАК АдресДоставки,
		|	ТарифыСДатойОкончания.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыСДатойОкончания.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыСДатойОкончания.СпособДоставки КАК СпособДоставки,
		|	ТарифыСДатойОкончания.Контрагент КАК Контрагент,
		|	ТарифыСДатойОкончания.Стоимость1Км КАК Стоимость1Км,
		|	ТарифыСДатойОкончания.Период КАК Период,
		|	ТарифыСДатойОкончания.ДатаОкончания КАК ДатаОкончания1
		|ПОМЕСТИТЬ ТарифыПоДатам
		|ИЗ
		|	ТЗДат КАК ТЗДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТарифыСДатойОкончания КАК ТарифыСДатойОкончания
		|		ПО (ТарифыСДатойОкончания.Период <= ТЗДат.ДатаНачала)
		|			И (ТарифыСДатойОкончания.ДатаОкончания >= ТЗДат.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоДатам.ДатаНачала КАК ДатаНачала,
		|	ТарифыПоДатам.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыПоДатам.АдресПолучения КАК АдресПолучения,
		|	ТарифыПоДатам.АдресДоставки КАК АдресДоставки,
		|	ТарифыПоДатам.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыПоДатам.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыПоДатам.СпособДоставки КАК СпособДоставки,
		|	ТарифыПоДатам.Контрагент КАК Контрагент,
		|	МАКСИМУМ(ТарифыПоДатам.Период) КАК Период
		|ПОМЕСТИТЬ ТарифыПоДатамБезСтоимости
		|ИЗ
		|	ТарифыПоДатам КАК ТарифыПоДатам
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыПоДатам.АдресДоставки,
		|	ТарифыПоДатам.ДатаОкончания,
		|	ТарифыПоДатам.ДатаНачала,
		|	ТарифыПоДатам.ЛогистическийТип,
		|	ТарифыПоДатам.АдресПолучения,
		|	ТарифыПоДатам.КолеснаяФормула,
		|	ТарифыПоДатам.Контрагент,
		|	ТарифыПоДатам.СпособДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоДатамБезСтоимости.ДатаНачала КАК ДатаНачала,
		|	ТарифыПоДатамБезСтоимости.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыПоДатамБезСтоимости.АдресПолучения КАК АдресПолучения,
		|	ТарифыПоДатамБезСтоимости.АдресДоставки КАК АдресДоставки,
		|	ТарифыПоДатамБезСтоимости.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыПоДатамБезСтоимости.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыПоДатамБезСтоимости.СпособДоставки КАК СпособДоставки,
		|	ТарифыПоДатамБезСтоимости.Контрагент КАК Контрагент,
		|	ТарифыПоДатамБезСтоимости.Период КАК Период,
		|	ТарифыСДатойОкончания.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ ТарифыПоДатамСоСтоимостью
		|ИЗ
		|	ТарифыПоДатамБезСтоимости КАК ТарифыПоДатамБезСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыСДатойОкончания КАК ТарифыСДатойОкончания
		|		ПО ТарифыПоДатамБезСтоимости.Период = ТарифыСДатойОкончания.Период
		|			И ТарифыПоДатамБезСтоимости.АдресПолучения = ТарифыСДатойОкончания.АдресПолучения
		|			И ТарифыПоДатамБезСтоимости.АдресДоставки = ТарифыСДатойОкончания.АдресДоставки
		|			И ТарифыПоДатамБезСтоимости.ЛогистическийТип = ТарифыСДатойОкончания.ЛогистическийТип
		|			И ТарифыПоДатамБезСтоимости.КолеснаяФормула = ТарифыСДатойОкончания.КолеснаяФормула
		|			И ТарифыПоДатамБезСтоимости.СпособДоставки = ТарифыСДатойОкончания.СпособДоставки
		|			И ТарифыПоДатамБезСтоимости.Контрагент = ТарифыСДатойОкончания.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоДатамСоСтоимостью.ДатаНачала КАК ДатаНачала,
		|	ТарифыПоДатамСоСтоимостью.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыПоДатамСоСтоимостью.АдресПолучения КАК АдресПолучения,
		|	ТарифыПоДатамСоСтоимостью.АдресДоставки КАК АдресДоставки,
		|	ТарифыПоДатамСоСтоимостью.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыПоДатамСоСтоимостью.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыПоДатамСоСтоимостью.СпособДоставки КАК СпособДоставки,
		|	МАКСИМУМ(ТарифыПоДатамСоСтоимостью.Стоимость1Км) КАК Стоимость1Км
		|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчикаПоДатам
		|ИЗ
		|	ТарифыПоДатамСоСтоимостью КАК ТарифыПоДатамСоСтоимостью
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыПоДатамСоСтоимостью.ДатаНачала,
		|	ТарифыПоДатамСоСтоимостью.ДатаОкончания,
		|	ТарифыПоДатамСоСтоимостью.АдресПолучения,
		|	ТарифыПоДатамСоСтоимостью.АдресДоставки,
		|	ТарифыПоДатамСоСтоимостью.ЛогистическийТип,
		|	ТарифыПоДатамСоСтоимостью.КолеснаяФормула,
		|	ТарифыПоДатамСоСтоимостью.СпособДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыПоДатамБезСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыПоДатамСоСтоимостью
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ДатаОкончания) КАК ДатаОкончания,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресПолучения КАК АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресДоставки КАК АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.СпособДоставки КАК СпособДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Стоимость1Км КАК Стоимость1Км
		|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
		|ИЗ
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам КАК АктуальныеМаксимальныеТарифыПеревозчикаПоДатам
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.СпособДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Стоимость1Км
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаНачала КАК ДатаТарифаПеревозчика,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаОкончания КАК ДатаОкончания,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения КАК АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки КАК АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула КАК КолеснаяФормула,
		|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Стоимость1Км) КАК Стоимость1Км,
		|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0) КАК Расстояние,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки КАК СпособДоставки
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
		|ИЗ
		|	АктуальныеМаксимальныеТарифыПеревозчика2 КАК АктуальныеМаксимальныеТарифыПеревозчика2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
		|		ПО АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
		|			И АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки,
		|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0),
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаНачала,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Период КАК Период,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Стоимость КАК Стоимость,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ТарифУказанВручную КАК ТарифУказанВручную
		|ПОМЕСТИТЬ ТарифыУжеЗаписанные
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаПолная)
		|	И Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Период <= &НаДату
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	АктуальныеТарифыПеревозчика.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыУжеЗаписанные.Период КАК Период,
		|	АктуальныеТарифыПеревозчика.СпособДоставки КАК СпособДоставки,
		|	АктуальныеТарифыПеревозчика.АдресПолучения КАК АдресПолучения,
		|	АктуальныеТарифыПеревозчика.АдресДоставки КАК АдресДоставки,
		|	АктуальныеТарифыПеревозчика.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеТарифыПеревозчика.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеТарифыПеревозчика.Стоимость1Км КАК Стоимость1Км,
		|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
		|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость,
		|	АктуальныеТарифыПеревозчика.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ АктуальноеИСуществующее
		|ИЗ
		|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
		|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
		|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
		|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
		|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
		|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула
		|			И АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика = ТарифыУжеЗаписанные.Период
		|ГДЕ
		|	АктуальныеТарифыПеревозчика.Расстояние > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальноеИСуществующее.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	АктуальноеИСуществующее.ДатаОкончания КАК ДатаОкончания,
		|	АктуальноеИСуществующее.Период КАК Период,
		|	АктуальноеИСуществующее.СпособДоставки КАК СпособДоставки,
		|	АктуальноеИСуществующее.АдресПолучения КАК АдресПолучения,
		|	АктуальноеИСуществующее.АдресДоставки КАК АдресДоставки,
		|	АктуальноеИСуществующее.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальноеИСуществующее.КолеснаяФормула КАК КолеснаяФормула,
		|	МАКСИМУМ(АктуальноеИСуществующее.Стоимость1Км) КАК Стоимость1Км,
		|	МАКСИМУМ(ВЫРАЗИТЬ(АктуальноеИСуществующее.Расстояние * АктуальноеИСуществующее.Стоимость1Км * (1 + &РазмерСтавки / 100) КАК ЧИСЛО(10, 2))) КАК НоваяСтоимость,
		|	АктуальноеИСуществующее.ТарифУказанВручную КАК ТарифУказанВручную,
		|	АктуальноеИСуществующее.Стоимость КАК Стоимость,
		|	АктуальноеИСуществующее.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ ИтогоБезПустыхТарифов
		|ИЗ
		|	АктуальноеИСуществующее КАК АктуальноеИСуществующее
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальноеИСуществующее.Период,
		|	АктуальноеИСуществующее.СпособДоставки,
		|	АктуальноеИСуществующее.АдресПолучения,
		|	АктуальноеИСуществующее.АдресДоставки,
		|	АктуальноеИСуществующее.ЛогистическийТип,
		|	АктуальноеИСуществующее.КолеснаяФормула,
		|	АктуальноеИСуществующее.ТарифУказанВручную,
		|	АктуальноеИСуществующее.Стоимость,
		|	АктуальноеИСуществующее.Расстояние,
		|	АктуальноеИСуществующее.ДатаТарифаПеревозчика,
		|	АктуальноеИСуществующее.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальноеИСуществующее
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогоБезПустыхТарифов.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	ИтогоБезПустыхТарифов.ДатаОкончания КАК ДатаОкончания,
		|	ИтогоБезПустыхТарифов.Период КАК Период,
		|	ИтогоБезПустыхТарифов.СпособДоставки КАК СпособДоставки,
		|	ИтогоБезПустыхТарифов.АдресПолучения КАК АдресПолучения,
		|	ИтогоБезПустыхТарифов.АдресДоставки КАК АдресДоставки,
		|	ИтогоБезПустыхТарифов.ЛогистическийТип КАК ЛогистическийТип,
		|	ИтогоБезПустыхТарифов.КолеснаяФормула КАК КолеснаяФормула,
		|	ИтогоБезПустыхТарифов.Стоимость1Км КАК Стоимость1Км,
		|	ИтогоБезПустыхТарифов.НоваяСтоимость КАК НоваяСтоимость,
		|	ИтогоБезПустыхТарифов.ТарифУказанВручную КАК ТарифУказанВручную,
		|	ИтогоБезПустыхТарифов.Стоимость КАК Стоимость,
		|	ИтогоБезПустыхТарифов.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ ИтогоБезПустыхСОтбором
		|ИЗ
		|	ИтогоБезПустыхТарифов КАК ИтогоБезПустыхТарифов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтогоБезПустыхТарифов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ДатаТарифаПеревозчика, ИтогоБезПустыхСОтбором1.ДатаОкончания) КАК ДатаТарифаПеревозчика,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Период, ИтогоБезПустыхСОтбором1.ДатаОкончания) КАК Период,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.СпособДоставки, ИтогоБезПустыхСОтбором1.СпособДоставки) КАК СпособДоставки,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.АдресПолучения, ИтогоБезПустыхСОтбором1.АдресПолучения) КАК АдресПолучения,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.АдресДоставки, ИтогоБезПустыхСОтбором1.АдресДоставки) КАК АдресДоставки,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ЛогистическийТип, ИтогоБезПустыхСОтбором1.ЛогистическийТип) КАК ЛогистическийТип,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.КолеснаяФормула, ИтогоБезПустыхСОтбором1.КолеснаяФормула) КАК КолеснаяФормула,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Стоимость1Км, 0) КАК Стоимость1Км,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.НоваяСтоимость, 0) КАК НоваяСтоимость,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ТарифУказанВручную, ИтогоБезПустыхСОтбором.ТарифУказанВручную) КАК ТарифУказанВручную,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Стоимость, 1) КАК Стоимость,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Расстояние, ИтогоБезПустыхСОтбором.Расстояние) КАК Расстояние
		|ПОМЕСТИТЬ ИтогоСПустыми
		|ИЗ
		|	ИтогоБезПустыхСОтбором КАК ИтогоБезПустыхСОтбором
		|		ПОЛНОЕ СОЕДИНЕНИЕ ИтогоБезПустыхСОтбором КАК ИтогоБезПустыхСОтбором1
		|		ПО (ИтогоБезПустыхСОтбором1.ДатаОкончания = ИтогоБезПустыхСОтбором.ДатаТарифаПеревозчика)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогоСПустыми.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	ИтогоСПустыми.Период КАК Период,
		|	ИтогоСПустыми.СпособДоставки КАК СпособДоставки,
		|	ИтогоСПустыми.АдресПолучения КАК АдресПолучения,
		|	ИтогоСПустыми.АдресДоставки КАК АдресДоставки,
		|	ИтогоСПустыми.ЛогистическийТип КАК ЛогистическийТип,
		|	ИтогоСПустыми.КолеснаяФормула КАК КолеснаяФормула,
		|	ИтогоСПустыми.Стоимость1Км КАК Стоимость1Км,
		|	ИтогоСПустыми.НоваяСтоимость КАК НоваяСтоимость,
		|	ИтогоСПустыми.ТарифУказанВручную КАК ТарифУказанВручную,
		|	ИтогоСПустыми.Стоимость КАК Стоимость,
		|	ИтогоСПустыми.Расстояние КАК Расстояние
		|ИЗ
		|	ИтогоСПустыми КАК ИтогоСПустыми
		|ГДЕ
		|	ИтогоСПустыми.ДатаТарифаПеревозчика <> ДАТАВРЕМЯ(3999, 12, 31)
		|	И ИтогоСПустыми.НоваяСтоимость <> ИтогоСПустыми.Стоимость";
	
	Запрос.УстановитьПараметр("РазмерСтавки", Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка); // rarus tenkam 03.08.2021 mantis 17628 +  	
	Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);  	
	// rarus tenkam 25.03.2021 mantis 17101 ---    	
	
	
	// rarus tenkam 03.08.2021 mantis 17628 +++
	ДополнительныйОтбор = "ИСТИНА";
	Если Параметры <> Неопределено И Параметры.Свойство("ЛогистическийТип") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип В (&ЛогистическийТип)";
		Запрос.УстановитьПараметр("ЛогистическийТип", Параметры.ЛогистическийТип);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("СпособДоставки") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки В (&СпособДоставки)";
		Запрос.УстановитьПараметр("СпособДоставки", Параметры.СпособДоставки);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("КолеснаяФормула") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула В (&КолеснаяФормула)";
		Запрос.УстановитьПараметр("КолеснаяФормула", Параметры.КолеснаяФормула);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("АдресПолучения") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения В (&АдресПолучения)";
		Запрос.УстановитьПараметр("АдресПолучения", Параметры.АдресПолучения);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("АдресДоставки") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки В (&АдресДоставки)";
		Запрос.УстановитьПараметр("АдресДоставки", Параметры.АдресДоставки);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеОтборы", ДополнительныйОтбор);
	// rarus tenkam 03.08.2021 mantis 17628 ---
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	РезультатЗапроса = Запрос.Выполнить();
	// rarus tenkam 27.09.2018 mantis 13597 +++
	
	//ТабРезультат = РезультатЗапроса.Выгрузить();
	//Если ТабРезультат.Количество() = 0 Тогда
	//	Возврат;
	//Иначе
	//	Для Каждого ТекТариф Из ТабРезультат Цикл
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетЗаписи.Следующий() Цикл
		ТекТариф = ВыборкаДетЗаписи;
	// rarus tenkam 27.09.2018 mantis 13597 ---
	
		// rarus tenkam 03.08.2021 mantis 17628 +++
		//// rarus tenkam 21.12.2018 mantis 13791 +++
		////Если ТекТариф.ТарифУказанВручную Тогда
		////	Продолжить;
		////КонецЕсли;
		//// rarus tenkam 21.12.2018 mantis 13791 ---
		//// rarus tenkam 25.03.2021 mantis 17101 +++	Стоимость может стать нулевой, если контрагент/договор недействительны или истекли
		////Если ТекТариф.Расстояние > 0 И ТекТариф.Стоимость1км > 0 Тогда
		//Если ТекТариф.Расстояние > 0 Тогда
		//// rarus tenkam 25.03.2021 mantis 17101 ---	
		//	// rarus tenkam 21.12.2018 mantis 13791 +++
		//	//НоваяСтоимость = Окр(ТекТариф.Расстояние * ТекТариф.Стоимость1км * 1.18,-2);
		//	НоваяСтоимость = Окр(ТекТариф.Расстояние * ТекТариф.Стоимость1км * (1 + Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100),-2);
		//	// rarus tenkam 21.12.2018 mantis 13791 ---			
		//	Если ТекТариф.Стоимость <> НоваяСтоимость ИЛИ ТекТариф.Стоимость = 0 Тогда
		// rarus tenkam 03.08.2021 mantis 17628 ---
				ЗаписьРегСведений = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СоздатьМенеджерЗаписи();
				ЗаписьРегСведений.Период 				= ТекТариф.ДатаТарифаПеревозчика;
				ЗаписьРегСведений.УслугаПакета 			= Справочники.Scan_НоменклатураУслуг.ДоставкаПолная;
				ЗаписьРегСведений.АдресПолучения 		= ТекТариф.АдресПолучения;
				ЗаписьРегСведений.АдресДоставки 		= ТекТариф.АдресДоставки;
				ЗаписьРегСведений.КолеснаяФормула 		= ТекТариф.КолеснаяФормула;
				ЗаписьРегСведений.ЛогистическийТип 		= ТекТариф.ЛогистическийТип;
				ЗаписьРегСведений.СпособДоставки 		= ТекТариф.СпособДоставки;
				ЗаписьРегСведений.ТарифУказанВручную 	= Ложь;
				// rarus tenkam 03.08.2021 mantis 17628 +++
				//ЗаписьРегСведений.Стоимость 			= НоваяСтоимость;
				ЗаписьРегСведений.Стоимость 			= ВыборкаДетЗаписи.НоваяСтоимость;
				// rarus tenkam 03.08.2021 mantis 17628 +++
				ЗаписьРегСведений.Пользователь 			= ПользователиКлиентСервер.ТекущийПользователь();
				Попытка
					ЗаписьРегСведений.Записать();
				Исключение
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Не удалось записать тариф в матрицу тарифов для дилеров.'"));
				КонецПопытки;
		// rarus tenkam 03.08.2021 mantis 17628 +++
		//	КонецЕсли;
		//КонецЕсли;
		// rarus tenkam 03.08.2021 mantis 17628 ---
	КонецЦикла;
	//КонецЕсли;	// rarus tenkam 27.09.2018 mantis 13597 +
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Завершен пересчет тарифов по услуге Доставка полная'"));
	
КонецПроцедуры

Процедура ПересчитатьДополнительныеОсновныеУслуги(Параметры = Неопределено) Экспорт
	//Не нужно, пересчитывается при записи справочника				
КонецПроцедуры

Процедура ПересчитатьМатрицуТарифовПеревозчика(Параметры = Неопределено) Экспорт
	
	ИмяСобытия = НСтр("ru = 'ПересчетТарифов.ТарифыПеревозчика'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начат пересчет тарифов перевозчика'"));

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.НоменклатураУслуги,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ГруппаПродукта,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СтавкаНДС,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Сумма,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СуммаНДС,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СуммаСНДС,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Стоимость1Км,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Пользователь,
		|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние,0) КАК Расстояние
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
		|		ПО Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
		|			И Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтоимость1км = Окр(?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Расстояние),ВыборкаДетальныеЗаписи.Сумма / ВыборкаДетальныеЗаписи.Расстояние, 0),2);
		Если НоваяСтоимость1км <> ВыборкаДетальныеЗаписи.Стоимость1Км Тогда
			//Перезапишем
			ЗаписьРегСведений = РегистрыСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Контрагент	  		= ВыборкаДетальныеЗаписи.Контрагент;
			ЗаписьРегСведений.ДоговорКонтрагента 	= ВыборкаДетальныеЗаписи.ДоговорКонтрагента;
			ЗаписьРегСведений.НоменклатураУслуги    = ВыборкаДетальныеЗаписи.НоменклатураУслуги;
			ЗаписьРегСведений.ГруппаПродукта    	= ВыборкаДетальныеЗаписи.ГруппаПродукта;
			ЗаписьРегСведений.СтавкаНДС    			= ВыборкаДетальныеЗаписи.СтавкаНДС;
			ЗаписьРегСведений.СпособДоставки    	= ВыборкаДетальныеЗаписи.СпособДоставки;
			ЗаписьРегСведений.АдресПолучения    	= ВыборкаДетальныеЗаписи.АдресПолучения;
			ЗаписьРегСведений.АдресДоставки    		= ВыборкаДетальныеЗаписи.АдресДоставки;
			ЗаписьРегСведений.ЛогистическийТип		= ВыборкаДетальныеЗаписи.ЛогистическийТип;
			ЗаписьРегСведений.КолеснаяФормула		= ВыборкаДетальныеЗаписи.КолеснаяФормула;
			ЗаписьРегСведений.Сумма    				= ВыборкаДетальныеЗаписи.Сумма;
			ЗаписьРегСведений.СуммаНДС    			= ВыборкаДетальныеЗаписи.СуммаНДС;
			ЗаписьРегСведений.СуммаСНДС				= ВыборкаДетальныеЗаписи.СуммаСНДС;	
			ЗаписьРегСведений.Период      			= ВыборкаДетальныеЗаписи.Период;
			ЗаписьРегСведений.Пользователь 			= ПользователиКлиентСервер.ТекущийПользователь();
			ЗаписьРегСведений.Стоимость1км			= НоваяСтоимость1км;
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Завершен пересчет тарифов перевозчика'"));

КонецПроцедуры

Процедура ПолныйПересчет(Параметры = Неопределено) Экспорт
	ПересчитатьМатрицуТарифовПеревозчика(Параметры);
	ПересчитатьПлатона(Параметры);
	ПересчитатьДоставкуПолнуюЛьготную(Параметры);
КонецПроцедуры

Процедура УдалитьСтрокиСПустойСтоимостью() Экспорт	//rarus tenkam 31.03.2021 mantis 17101 +++ 
	ИмяСобытия = НСтр("ru = 'ПересчетТарифов.УдалениеПустыхСтрок'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начато удаление пустых тарифов'"));

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Период КАК Период,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.УслугаПакета КАК УслугаПакета,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Стоимость КАК Стоимость,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ТарифУказанВручную КАК ТарифУказанВручную,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Стоимость = 0
		|	И Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ТарифУказанВручную = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		Набор.Отбор.УслугаПакета.Установить(ВыборкаДетальныеЗаписи.УслугаПакета);
		Набор.Отбор.ЛогистическийТип.Установить(ВыборкаДетальныеЗаписи.ЛогистическийТип);
		Набор.Отбор.СпособДоставки.Установить(ВыборкаДетальныеЗаписи.СпособДоставки);
		Набор.Отбор.КолеснаяФормула.Установить(ВыборкаДетальныеЗаписи.КолеснаяФормула);
		Набор.Отбор.АдресПолучения.Установить(ВыборкаДетальныеЗаписи.АдресПолучения);
		Набор.Отбор.АдресДоставки.Установить(ВыборкаДетальныеЗаписи.АдресДоставки);
		Набор.Записать();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Завершено удаление пустых тарифов'"));

КонецПроцедуры

//rarus tenkam 10.08.2017 mantis 10589 ---

//rarus tenkam 20.12.2018 mantis 13736 +++
Процедура ПересчитатьДоставкуЛьготнуюРасчетПоСкидке(Параметры = Неопределено) Экспорт
	ИмяСобытия = НСтр("ru = 'ПересчетТарифов.ДоставкаЛьготнаяРасчетПоСкидке'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начат пересчет тарифов по услуге Доставка льготная расчет по скидке'"));

	// rarus tenkam 31.08.2021 mantis 17628 +++	
	//Если Параметры <> Неопределено И ТипЗнч(Параметры) = Тип("Дата") Тогда
	//	НаДату = Параметры;
	//Иначе
	//	НаДату = ТекущаяДата();
	//КонецЕсли;
	Если Параметры <> Неопределено Тогда
		Если ТипЗнч(Параметры) = Тип("Дата") Тогда
			НаДату = Параметры;
		ИначеЕсли Параметры.Свойство("ДатаУстановкиТарифа") Тогда
			НаДату = Параметры.ДатаУстановкиТарифа;
		КонецЕсли;
	Иначе
		НаДату = ТекущаяДата();
	КонецЕсли;
	// rarus tenkam 31.08.2021 mantis 17628 ---	
	
	ЛьготаСканииРусь = ПолучитьЛьготуСканииРусь(НаДату);
	ДатаЛьготы = ПолучитьДатуЛьготыСканииРусь(НаДату);	// rarus tenkam 26.12.2018 mantis 13791 +

	// rarus tenkam 31.08.2021 mantis 17628 +++	
	Если ЛьготаСканииРусь = 0 Тогда
		Возврат;
	КонецЕсли;
	// rarus tenkam 31.08.2021 mantis 17628 ---	
		
	//Получим все тарифы
	Запрос = Новый Запрос;
	// rarus tenkam 25.03.2021 mantis 17101 +++
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период) КАК Период,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения КАК АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки КАК АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип КАК ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула КАК КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки КАК СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент КАК Контрагент
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки,
	//|	Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	АдресПолучения,
	//|	АдресДоставки,
	//|	ЛогистическийТип,
	//|	КолеснаяФормула,
	//|	СпособДоставки,
	//|	Контрагент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчиковМаксПериод.Период КАК Период,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула КАК КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки КАК СпособДоставки,
	//|	МАКСИМУМ(ЕСТЬNULL(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Стоимость1Км, 0)) КАК Стоимость1Км,
	//|	МАКСИМУМ(ЕСТЬNULL(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Сумма, 0)) КАК Сумма
	//|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
	//|ИЗ
	//|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&НаДату, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	//|		ПО АктуальныеТарифыПеревозчиковМаксПериод.Период = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Период
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки
	//|			И АктуальныеТарифыПеревозчиковМаксПериод.Контрагент = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Контрагент
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.Период,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Период) КАК ДатаТарифаПеревозчика,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула КАК КолеснаяФормула,
	//|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Стоимость1Км) КАК Стоимость1Км,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки КАК СпособДоставки,
	//|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Сумма) КАК Сумма
	//|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
	//|ИЗ
	//|	АктуальныеМаксимальныеТарифыПеревозчика2 КАК АктуальныеМаксимальныеТарифыПеревозчика2
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула,
	//|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ЛогистическийТип КАК ЛогистическийТип,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.СпособДоставки КАК СпособДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.КолеснаяФормула КАК КолеснаяФормула,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресПолучения КАК АдресПолучения,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.АдресДоставки КАК АдресДоставки,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость КАК Стоимость,
	//|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ТарифУказанВручную КАК ТарифУказанВручную
	//|ПОМЕСТИТЬ ТарифыУжеЗаписанные
	//|ИЗ
	//|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(&НаДату, УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаЛьготнаяПоСкидке)) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
	//|	АктуальныеТарифыПеревозчика.СпособДоставки КАК СпособДоставки,
	//|	АктуальныеТарифыПеревозчика.АдресПолучения КАК АдресПолучения,
	//|	АктуальныеТарифыПеревозчика.АдресДоставки КАК АдресДоставки,
	//|	АктуальныеТарифыПеревозчика.ЛогистическийТип КАК ЛогистическийТип,
	//|	АктуальныеТарифыПеревозчика.КолеснаяФормула КАК КолеснаяФормула,
	//|	АктуальныеТарифыПеревозчика.Стоимость1Км КАК Стоимость1Км,
	//|	АктуальныеТарифыПеревозчика.Сумма КАК Сумма,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
	//|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость
	//|ИЗ
	//|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
	//|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
	//|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
	//|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
	//|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
	//|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула";
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаДат.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончанияДоговора,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияДоговора
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период <= &НаДату
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ КАК ДатыНачалаОкончания
		|ПОМЕСТИТЬ ВсеДатыНачалаОкончания
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания КАК ДатаНачала
		|ИЗ
		|	ВсеДатыНачалаОкончания КАК ВсеДатыНачалаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВсеДатыНачалаОкончания.ДатыНачалаОкончания";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		нСтрока = ТаблицаДат.Добавить();
		нСтрока.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
	КонецЦикла;
	
	Для Сч=0 По ТаблицаДат.Количество()-1 Цикл
		Если Сч = ТаблицаДат.Количество()-1 Тогда
			ТаблицаДат[Сч].ДатаОкончания = Дата('39991231');
		Иначе
			ТаблицаДат[Сч].ДатаОкончания = ТаблицаДат[Сч+1].ДатаНачала;
		КонецЕсли;
		Если ТаблицаДат[Сч].ДатаНачала = Дата('39991231') Тогда
			ТаблицаДат.Удалить(Сч);
		КонецЕсли;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = // rarus tenkam 04.08.2021 mantis 17628 + изменен запрос  
		"ВЫБРАТЬ
		|	ТаблицаДат.ДатаНачала КАК ДатаНачала,
		|	ТаблицаДат.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ТЗДат
		|ИЗ
		|	&ТаблицаДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделий.Период) КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончанияДоговора,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияДоговора,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Стоимость1Км КАК Стоимость1Км,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Сумма КАК Сумма
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	&ДополнительныеОтборы
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончания
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		ИНАЧЕ Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент.ДатаОкончанияДействия
		|	КОНЕЦ,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Стоимость1Км,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период КАК Период,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения КАК АдресПолучения,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки КАК АдресДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки КАК СпособДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ КАК ДатаОкончания,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Стоимость1Км КАК Стоимость1Км,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТарифыСДатойОкончания
		|ИЗ
		|	АктуальныеТарифыПеревозчиковМаксПериод КАК АктуальныеТарифыПеревозчиковМаксПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|		КОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДоговора
		|				И АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора < АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|			ТОГДА АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияДоговора
		|		ИНАЧЕ АктуальныеТарифыПеревозчиковМаксПериод.ДатаОкончанияДействияКонтрагента
		|	КОНЕЦ,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Период,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресПолучения,
		|	АктуальныеТарифыПеревозчиковМаксПериод.АдресДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.ЛогистическийТип,
		|	АктуальныеТарифыПеревозчиковМаксПериод.КолеснаяФормула,
		|	АктуальныеТарифыПеревозчиковМаксПериод.СпособДоставки,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Контрагент,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Стоимость1Км,
		|	АктуальныеТарифыПеревозчиковМаксПериод.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальныеТарифыПеревозчиковМаксПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗДат.ДатаНачала КАК ДатаНачала,
		|	ТЗДат.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыСДатойОкончания.АдресПолучения КАК АдресПолучения,
		|	ТарифыСДатойОкончания.АдресДоставки КАК АдресДоставки,
		|	ТарифыСДатойОкончания.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыСДатойОкончания.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыСДатойОкончания.СпособДоставки КАК СпособДоставки,
		|	ТарифыСДатойОкончания.Контрагент КАК Контрагент,
		|	ТарифыСДатойОкончания.Стоимость1Км КАК Стоимость1Км,
		|	ТарифыСДатойОкончания.Сумма КАК Сумма,
		|	ТарифыСДатойОкончания.Период КАК Период
		|ПОМЕСТИТЬ ТарифыПоДатам
		|ИЗ
		|	ТЗДат КАК ТЗДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТарифыСДатойОкончания КАК ТарифыСДатойОкончания
		|		ПО (ТарифыСДатойОкончания.Период <= ТЗДат.ДатаНачала)
		|			И (ТарифыСДатойОкончания.ДатаОкончания >= ТЗДат.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоДатам.ДатаНачала КАК ДатаНачала,
		|	ТарифыПоДатам.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыПоДатам.АдресПолучения КАК АдресПолучения,
		|	ТарифыПоДатам.АдресДоставки КАК АдресДоставки,
		|	ТарифыПоДатам.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыПоДатам.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыПоДатам.СпособДоставки КАК СпособДоставки,
		|	ТарифыПоДатам.Контрагент КАК Контрагент,
		|	МАКСИМУМ(ТарифыПоДатам.Период) КАК Период
		|ПОМЕСТИТЬ ТарифыПоДатамБезСтоимости
		|ИЗ
		|	ТарифыПоДатам КАК ТарифыПоДатам
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыПоДатам.АдресДоставки,
		|	ТарифыПоДатам.ДатаОкончания,
		|	ТарифыПоДатам.ДатаНачала,
		|	ТарифыПоДатам.ЛогистическийТип,
		|	ТарифыПоДатам.АдресПолучения,
		|	ТарифыПоДатам.КолеснаяФормула,
		|	ТарифыПоДатам.Контрагент,
		|	ТарифыПоДатам.СпособДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоДатамБезСтоимости.ДатаНачала КАК ДатаНачала,
		|	ТарифыПоДатамБезСтоимости.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыПоДатамБезСтоимости.АдресПолучения КАК АдресПолучения,
		|	ТарифыПоДатамБезСтоимости.АдресДоставки КАК АдресДоставки,
		|	ТарифыПоДатамБезСтоимости.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыПоДатамБезСтоимости.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыПоДатамБезСтоимости.СпособДоставки КАК СпособДоставки,
		|	ТарифыПоДатамБезСтоимости.Контрагент КАК Контрагент,
		|	ТарифыПоДатамБезСтоимости.Период КАК Период,
		|	ТарифыСДатойОкончания.Стоимость1Км КАК Стоимость1Км,
		|	ТарифыСДатойОкончания.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТарифыПоДатамСоСтоимостью
		|ИЗ
		|	ТарифыПоДатамБезСтоимости КАК ТарифыПоДатамБезСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыСДатойОкончания КАК ТарифыСДатойОкончания
		|		ПО ТарифыПоДатамБезСтоимости.Период = ТарифыСДатойОкончания.Период
		|			И ТарифыПоДатамБезСтоимости.АдресПолучения = ТарифыСДатойОкончания.АдресПолучения
		|			И ТарифыПоДатамБезСтоимости.АдресДоставки = ТарифыСДатойОкончания.АдресДоставки
		|			И ТарифыПоДатамБезСтоимости.ЛогистическийТип = ТарифыСДатойОкончания.ЛогистическийТип
		|			И ТарифыПоДатамБезСтоимости.КолеснаяФормула = ТарифыСДатойОкончания.КолеснаяФормула
		|			И ТарифыПоДатамБезСтоимости.СпособДоставки = ТарифыСДатойОкончания.СпособДоставки
		|			И ТарифыПоДатамБезСтоимости.Контрагент = ТарифыСДатойОкончания.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПоДатамСоСтоимостью.ДатаНачала КАК ДатаНачала,
		|	ТарифыПоДатамСоСтоимостью.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыПоДатамСоСтоимостью.АдресПолучения КАК АдресПолучения,
		|	ТарифыПоДатамСоСтоимостью.АдресДоставки КАК АдресДоставки,
		|	ТарифыПоДатамСоСтоимостью.ЛогистическийТип КАК ЛогистическийТип,
		|	ТарифыПоДатамСоСтоимостью.КолеснаяФормула КАК КолеснаяФормула,
		|	ТарифыПоДатамСоСтоимостью.СпособДоставки КАК СпособДоставки,
		|	МАКСИМУМ(ТарифыПоДатамСоСтоимостью.Стоимость1Км) КАК Стоимость1Км,
		|	МАКСИМУМ(ТарифыПоДатамСоСтоимостью.Сумма) КАК Сумма
		|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчикаПоДатам
		|ИЗ
		|	ТарифыПоДатамСоСтоимостью КАК ТарифыПоДатамСоСтоимостью
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыПоДатамСоСтоимостью.ДатаНачала,
		|	ТарифыПоДатамСоСтоимостью.ДатаОкончания,
		|	ТарифыПоДатамСоСтоимостью.АдресПолучения,
		|	ТарифыПоДатамСоСтоимостью.АдресДоставки,
		|	ТарифыПоДатамСоСтоимостью.ЛогистическийТип,
		|	ТарифыПоДатамСоСтоимостью.КолеснаяФормула,
		|	ТарифыПоДатамСоСтоимостью.СпособДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыПоДатамБезСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыПоДатамСоСтоимостью
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТарифыСДатойОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ДатаОкончания) КАК ДатаОкончания,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресПолучения КАК АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресДоставки КАК АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.СпособДоставки КАК СпособДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Стоимость1Км КАК Стоимость1Км,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Сумма КАК Сумма
		|ПОМЕСТИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
		|ИЗ
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам КАК АктуальныеМаксимальныеТарифыПеревозчикаПоДатам
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.СпособДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Стоимость1Км,
		|	АктуальныеМаксимальныеТарифыПеревозчикаПоДатам.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальныеМаксимальныеТарифыПеревозчикаПоДатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаНачала КАК ДатаТарифаПеревозчика,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаОкончания КАК ДатаОкончания,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения КАК АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки КАК АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула КАК КолеснаяФормула,
		|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Стоимость1Км) КАК Стоимость1Км,
		|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0) КАК Расстояние,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки КАК СпособДоставки,
		|	МАКСИМУМ(АктуальныеМаксимальныеТарифыПеревозчика2.Сумма) КАК Сумма
		|ПОМЕСТИТЬ АктуальныеТарифыПеревозчика
		|ИЗ
		|	АктуальныеМаксимальныеТарифыПеревозчика2 КАК АктуальныеМаксимальныеТарифыПеревозчика2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
		|		ПО АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
		|			И АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресПолучения,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.АдресДоставки,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ЛогистическийТип,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.КолеснаяФормула,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.СпособДоставки,
		|	ЕСТЬNULL(Scan_РасстояниеМеждуАдресами.Расстояние, 0),
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаОкончания,
		|	АктуальныеМаксимальныеТарифыПеревозчика2.ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальныеМаксимальныеТарифыПеревозчика2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Период КАК Период,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.АдресДоставки КАК АдресДоставки,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Стоимость КАК Стоимость,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ТарифУказанВручную КАК ТарифУказанВручную
		|ПОМЕСТИТЬ ТарифыУжеЗаписанные
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.УслугаПакета = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ДоставкаЛьготнаяПоСкидке)
		|	И Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.Период <= &НаДату
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	АктуальныеТарифыПеревозчика.ДатаОкончания КАК ДатаОкончания,
		|	ТарифыУжеЗаписанные.Период КАК Период,
		|	АктуальныеТарифыПеревозчика.СпособДоставки КАК СпособДоставки,
		|	АктуальныеТарифыПеревозчика.АдресПолучения КАК АдресПолучения,
		|	АктуальныеТарифыПеревозчика.АдресДоставки КАК АдресДоставки,
		|	АктуальныеТарифыПеревозчика.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальныеТарифыПеревозчика.КолеснаяФормула КАК КолеснаяФормула,
		|	АктуальныеТарифыПеревозчика.Стоимость1Км КАК Стоимость1Км,
		|	АктуальныеТарифыПеревозчика.Сумма КАК Сумма,
		|	ЕСТЬNULL(ТарифыУжеЗаписанные.ТарифУказанВручную, ЛОЖЬ) КАК ТарифУказанВручную,
		|	ЕСТЬNULL(ТарифыУжеЗаписанные.Стоимость, 0) КАК Стоимость,
		|	АктуальныеТарифыПеревозчика.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ АктуальноеИСуществующее
		|ИЗ
		|	АктуальныеТарифыПеревозчика КАК АктуальныеТарифыПеревозчика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифыУжеЗаписанные КАК ТарифыУжеЗаписанные
		|		ПО АктуальныеТарифыПеревозчика.СпособДоставки = ТарифыУжеЗаписанные.СпособДоставки
		|			И АктуальныеТарифыПеревозчика.АдресПолучения = ТарифыУжеЗаписанные.АдресПолучения
		|			И АктуальныеТарифыПеревозчика.АдресДоставки = ТарифыУжеЗаписанные.АдресДоставки
		|			И АктуальныеТарифыПеревозчика.ЛогистическийТип = ТарифыУжеЗаписанные.ЛогистическийТип
		|			И АктуальныеТарифыПеревозчика.КолеснаяФормула = ТарифыУжеЗаписанные.КолеснаяФормула
		|			И АктуальныеТарифыПеревозчика.ДатаТарифаПеревозчика = ТарифыУжеЗаписанные.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальноеИСуществующее.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	АктуальноеИСуществующее.ДатаОкончания КАК ДатаОкончания,
		|	АктуальноеИСуществующее.Период КАК Период,
		|	АктуальноеИСуществующее.СпособДоставки КАК СпособДоставки,
		|	АктуальноеИСуществующее.АдресПолучения КАК АдресПолучения,
		|	АктуальноеИСуществующее.АдресДоставки КАК АдресДоставки,
		|	АктуальноеИСуществующее.ЛогистическийТип КАК ЛогистическийТип,
		|	АктуальноеИСуществующее.КолеснаяФормула КАК КолеснаяФормула,
		|	МАКСИМУМ(АктуальноеИСуществующее.Стоимость1Км) КАК Стоимость1Км,
		|	МАКСИМУМ(АктуальноеИСуществующее.Сумма) КАК Сумма,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА АктуальноеИСуществующее.Сумма = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ((АктуальноеИСуществующее.Сумма - &ЛьготаСканииРусь) * (1 + &РазмерСтавки / 100) КАК ЧИСЛО(10, 2))
		|		КОНЕЦ) КАК НоваяСтоимость,
		|	АктуальноеИСуществующее.ТарифУказанВручную КАК ТарифУказанВручную,
		|	АктуальноеИСуществующее.Стоимость КАК Стоимость,
		|	АктуальноеИСуществующее.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ ИтогоБезПустыхТарифов
		|ИЗ
		|	АктуальноеИСуществующее КАК АктуальноеИСуществующее
		|
		|СГРУППИРОВАТЬ ПО
		|	АктуальноеИСуществующее.Период,
		|	АктуальноеИСуществующее.СпособДоставки,
		|	АктуальноеИСуществующее.АдресПолучения,
		|	АктуальноеИСуществующее.АдресДоставки,
		|	АктуальноеИСуществующее.ЛогистическийТип,
		|	АктуальноеИСуществующее.КолеснаяФормула,
		|	АктуальноеИСуществующее.ТарифУказанВручную,
		|	АктуальноеИСуществующее.Стоимость,
		|	АктуальноеИСуществующее.Расстояние,
		|	АктуальноеИСуществующее.ДатаОкончания,
		|	АктуальноеИСуществующее.ДатаТарифаПеревозчика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктуальноеИСуществующее
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогоБезПустыхТарифов.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	ИтогоБезПустыхТарифов.ДатаОкончания КАК ДатаОкончания,
		|	ИтогоБезПустыхТарифов.Период КАК Период,
		|	ИтогоБезПустыхТарифов.СпособДоставки КАК СпособДоставки,
		|	ИтогоБезПустыхТарифов.АдресПолучения КАК АдресПолучения,
		|	ИтогоБезПустыхТарифов.АдресДоставки КАК АдресДоставки,
		|	ИтогоБезПустыхТарифов.ЛогистическийТип КАК ЛогистическийТип,
		|	ИтогоБезПустыхТарифов.КолеснаяФормула КАК КолеснаяФормула,
		|	ИтогоБезПустыхТарифов.Стоимость1Км КАК Стоимость1Км,
		|	ИтогоБезПустыхТарифов.Сумма КАК Сумма,
		|	ИтогоБезПустыхТарифов.НоваяСтоимость КАК НоваяСтоимость,
		|	ИтогоБезПустыхТарифов.ТарифУказанВручную КАК ТарифУказанВручную,
		|	ИтогоБезПустыхТарифов.Стоимость КАК Стоимость,
		|	ИтогоБезПустыхТарифов.Расстояние КАК Расстояние
		|ПОМЕСТИТЬ ИтогоБезПустыхСОтбором
		|ИЗ
		|	ИтогоБезПустыхТарифов КАК ИтогоБезПустыхТарифов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтогоБезПустыхТарифов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ДатаТарифаПеревозчика, ИтогоБезПустыхСОтбором1.ДатаОкончания) КАК ДатаТарифаПеревозчика,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Период, ИтогоБезПустыхСОтбором1.ДатаОкончания) КАК Период,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.СпособДоставки, ИтогоБезПустыхСОтбором1.СпособДоставки) КАК СпособДоставки,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.АдресПолучения, ИтогоБезПустыхСОтбором1.АдресПолучения) КАК АдресПолучения,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.АдресДоставки, ИтогоБезПустыхСОтбором1.АдресДоставки) КАК АдресДоставки,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ЛогистическийТип, ИтогоБезПустыхСОтбором1.ЛогистическийТип) КАК ЛогистическийТип,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.КолеснаяФормула, ИтогоБезПустыхСОтбором1.КолеснаяФормула) КАК КолеснаяФормула,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Стоимость1Км, 0) КАК Стоимость1Км,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.НоваяСтоимость, 0) КАК НоваяСтоимость,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.ТарифУказанВручную, ИтогоБезПустыхСОтбором.ТарифУказанВручную) КАК ТарифУказанВручную,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Стоимость, 1) КАК Стоимость,
		|	ЕСТЬNULL(ИтогоБезПустыхСОтбором.Расстояние, ИтогоБезПустыхСОтбором.Расстояние) КАК Расстояние
		|ПОМЕСТИТЬ ИтогоСПустыми
		|ИЗ
		|	ИтогоБезПустыхСОтбором КАК ИтогоБезПустыхСОтбором
		|		ПОЛНОЕ СОЕДИНЕНИЕ ИтогоБезПустыхСОтбором КАК ИтогоБезПустыхСОтбором1
		|		ПО (ИтогоБезПустыхСОтбором1.ДатаОкончания = ИтогоБезПустыхСОтбором.ДатаТарифаПеревозчика)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогоСПустыми.ДатаТарифаПеревозчика КАК ДатаТарифаПеревозчика,
		|	ИтогоСПустыми.Период КАК Период,
		|	ИтогоСПустыми.СпособДоставки КАК СпособДоставки,
		|	ИтогоСПустыми.АдресПолучения КАК АдресПолучения,
		|	ИтогоСПустыми.АдресДоставки КАК АдресДоставки,
		|	ИтогоСПустыми.ЛогистическийТип КАК ЛогистическийТип,
		|	ИтогоСПустыми.КолеснаяФормула КАК КолеснаяФормула,
		|	ИтогоСПустыми.Стоимость1Км КАК Стоимость1Км,
		|	ИтогоСПустыми.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ИтогоСПустыми.НоваяСтоимость < 0
		|			ТОГДА 0
		|		ИНАЧЕ ИтогоСПустыми.НоваяСтоимость
		|	КОНЕЦ КАК НоваяСтоимость,
		|	ИтогоСПустыми.ТарифУказанВручную КАК ТарифУказанВручную,
		|	ИтогоСПустыми.Стоимость КАК Стоимость,
		|	ИтогоСПустыми.Расстояние КАК Расстояние
		|ИЗ
		|	ИтогоСПустыми КАК ИтогоСПустыми
		|ГДЕ
		|	ИтогоСПустыми.ДатаТарифаПеревозчика <> ДАТАВРЕМЯ(3999, 12, 31)
		|	И ИтогоСПустыми.НоваяСтоимость <> ИтогоСПустыми.Стоимость";
	
	Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);  	
	// rarus tenkam 04.08.2021 mantis 17628 +++
	Запрос.УстановитьПараметр("ЛьготаСканииРусь", ЛьготаСканииРусь);  	
	Запрос.УстановитьПараметр("РазмерСтавки", Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка);  	
	// rarus tenkam 04.08.2021 mantis 17628 ---
	// rarus tenkam 25.03.2021 mantis 17101 ---
	
	// rarus tenkam 03.08.2021 mantis 17628 +++
	ДополнительныйОтбор = "ИСТИНА";
	Если Параметры <> Неопределено И Параметры.Свойство("ЛогистическийТип") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип В (&ЛогистическийТип)";
		Запрос.УстановитьПараметр("ЛогистическийТип", Параметры.ЛогистическийТип);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("СпособДоставки") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки В (&СпособДоставки)";
		Запрос.УстановитьПараметр("СпособДоставки", Параметры.СпособДоставки);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("КолеснаяФормула") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула В (&КолеснаяФормула)";
		Запрос.УстановитьПараметр("КолеснаяФормула", Параметры.КолеснаяФормула);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("АдресПолучения") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения В (&АдресПолучения)";
		Запрос.УстановитьПараметр("АдресПолучения", Параметры.АдресПолучения);
	КонецЕсли;
	Если Параметры <> Неопределено И Параметры.Свойство("АдресДоставки") Тогда
		ДополнительныйОтбор = ДополнительныйОтбор + " И Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки В (&АдресДоставки)";
		Запрос.УстановитьПараметр("АдресДоставки", Параметры.АдресДоставки);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеОтборы", ДополнительныйОтбор);
	// rarus tenkam 03.08.2021 mantis 17628 ---
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетЗаписи.Следующий() Цикл
		ТекТариф = ВыборкаДетЗаписи;  		
		
		// rarus tenkam 31.08.2021 mantis 17628 +++	
		//// rarus tenkam 20.02.2019 mantis 14109 +++
		//Если ЛьготаСканииРусь = 0 Тогда
		//	Продолжить;
		//КонецЕсли;
		//// rarus tenkam 20.02.2019 mantis 14109 ---
		// rarus tenkam 31.08.2021 mantis 17628 ---	
	
		// rarus tenkam 04.08.2021 mantis 17628 +++
	
		//// rarus tenkam 21.12.2018 mantis 13791 +++
		////Если ТекТариф.ТарифУказанВручную Тогда
		////	Продолжить;
		////КонецЕсли;
		//// rarus tenkam 21.12.2018 mantis 13791 ---
		//Если ТекТариф.Сумма > 0 Тогда
		//	НоваяСтоимость = Окр((ТекТариф.Сумма - ЛьготаСканииРусь) * (1 + Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100),-2);
		//	Если ТекТариф.Стоимость <> НоваяСтоимость Тогда
		// rarus tenkam 04.08.2021 mantis 17628 ---
			ЗаписьРегСведений = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СоздатьМенеджерЗаписи();
				// rarus tenkam 21.12.2018 mantis 13791 +++
				//ЗаписьРегСведений.Период 				= ТекТариф.ДатаТарифаПеревозчика;
				ЗаписьРегСведений.Период 				= Макс(ТекТариф.ДатаТарифаПеревозчика, ДатаЛьготы);
				// rarus tenkam 21.12.2018 mantis 13791 ---
				ЗаписьРегСведений.УслугаПакета 			= Справочники.Scan_НоменклатураУслуг.ДоставкаЛьготнаяПоСкидке;
				ЗаписьРегСведений.АдресПолучения 		= ТекТариф.АдресПолучения;
				ЗаписьРегСведений.АдресДоставки 		= ТекТариф.АдресДоставки;
				ЗаписьРегСведений.КолеснаяФормула 		= ТекТариф.КолеснаяФормула;
				ЗаписьРегСведений.ЛогистическийТип 		= ТекТариф.ЛогистическийТип;
				ЗаписьРегСведений.СпособДоставки 		= ТекТариф.СпособДоставки;
				ЗаписьРегСведений.ТарифУказанВручную 	= Ложь;
				// rarus tenkam 04.08.2021 mantis 17628 +++
				//ЗаписьРегСведений.Стоимость 			= НоваяСтоимость;
				ЗаписьРегСведений.Стоимость 			= ТекТариф.НоваяСтоимость;
				// rarus tenkam 04.08.2021 mantis 17628 ---
	            ЗаписьРегСведений.Пользователь 			= ПользователиКлиентСервер.ТекущийПользователь();
				Попытка
					ЗаписьРегСведений.Записать();
				Исключение
				КонецПопытки;
		// rarus tenkam 04.08.2021 mantis 17628 +++
	
		//КонецЕсли;
		//// rarus tenkam 25.03.2021 mantis 17101 +++ контрагент/договор недействителен или истек
		//ИначеЕсли ТекТариф.Сумма = 0 Тогда
		//	НоваяСтоимость = 0;
		//	Если ТекТариф.Стоимость <> НоваяСтоимость Тогда
		//		ЗаписьРегСведений = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СоздатьМенеджерЗаписи();
		//		ЗаписьРегСведений.Период 				= Макс(ТекТариф.ДатаТарифаПеревозчика, ДатаЛьготы);
		//		ЗаписьРегСведений.УслугаПакета 			= Справочники.Scan_НоменклатураУслуг.ДоставкаЛьготнаяПоСкидке;
		//		ЗаписьРегСведений.АдресПолучения 		= ТекТариф.АдресПолучения;
		//		ЗаписьРегСведений.АдресДоставки 		= ТекТариф.АдресДоставки;
		//		ЗаписьРегСведений.КолеснаяФормула 		= ТекТариф.КолеснаяФормула;
		//		ЗаписьРегСведений.ЛогистическийТип 		= ТекТариф.ЛогистическийТип;
		//		ЗаписьРегСведений.СпособДоставки 		= ТекТариф.СпособДоставки;
		//		ЗаписьРегСведений.ТарифУказанВручную 	= Ложь;
		//		ЗаписьРегСведений.Стоимость 			= НоваяСтоимость;
		//		ЗаписьРегСведений.Пользователь 			= ПользователиКлиентСервер.ТекущийПользователь();
		//		Попытка
		//			ЗаписьРегСведений.Записать();
		//		Исключение
		//		КонецПопытки;
		//	КонецЕсли;
		//	// rarus tenkam 25.03.2021 mantis 17101 ---
		//КонецЕсли;
		// rarus tenkam 04.08.2021 mantis 17628 ---
	
	КонецЦикла;

	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,НСтр("ru = 'Завершен пересчет тарифов по услуге Доставка льготная расчет по скидке'"));

КонецПроцедуры

Функция ПолучитьЛьготуСканииРусь(НаДату = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЦеныУслугПоЛогистикеСрезПоследних.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.Scan_ЦеныУслугПоЛогистике.СрезПоследних(&НаДату, Услуга = &ДоставкаЛьготнаяПоСкидке) КАК Scan_ЦеныУслугПоЛогистикеСрезПоследних";
	
	Запрос.УстановитьПараметр("ДоставкаЛьготнаяПоСкидке", Справочники.Scan_НоменклатураУслуг.ДоставкаЛьготнаяПоСкидке);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
//rarus tenkam 20.12.2018 mantis 13736 ---

// rarus tenkam 21.12.2018 mantis 13791 +++
Функция ПолучитьДатуЛьготыСканииРусь(НаДату = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЦеныУслугПоЛогистикеСрезПоследних.Сумма КАК Сумма,
		|	Scan_ЦеныУслугПоЛогистикеСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.Scan_ЦеныУслугПоЛогистике.СрезПоследних(&НаДату, Услуга = &ДоставкаЛьготнаяПоСкидке) КАК Scan_ЦеныУслугПоЛогистикеСрезПоследних";
	
	Запрос.УстановитьПараметр("ДоставкаЛьготнаяПоСкидке", Справочники.Scan_НоменклатураУслуг.ДоставкаЛьготнаяПоСкидке);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Период;
	КонецЕсли;
	
	Возврат Дата('00010101');
	
КонецФункции
// rarus tenkam 21.12.2018 mantis 13791 ---

Функция ПолучитьКрайнююДатуНачалаТарифов(КонтрагентСсылка) Экспорт // rarus tenkam 04.08.2021 mantis 17628 +++
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделий.Период) КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент = &КонтрагентСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент";
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Период; 		
	КонецЕсли;
	
	Возврат Дата('00010101');
	
КонецФункции // rarus tenkam 04.08.2021 mantis 17628 ---

Функция ПолучитьКрайнююДатуНачалаТарифовПоДоговору(ДоговорСсылка) Экспорт // rarus tenkam 04.08.2021 mantis 17628 +++
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделий.Период) КАК Период,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента = &ДоговорКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Период; 		
	КонецЕсли;
	
	Возврат Дата('00010101');
	
КонецФункции // rarus tenkam 04.08.2021 mantis 17628 ---

Функция ПолучитьСтруктуруПараметровПоКонтрагенту(КонтрагентСсылка) Экспорт // rarus tenkam 04.08.2021 mantis 17628 +++
	СтруктураПараметров = Новый Структура;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	МассивСпособДоставки = Новый Массив;
	МассивЛогистическийТип = Новый Массив;
	МассивКолеснаяФормула = Новый Массив;
	МассивАдресПолучения = Новый Массив;
	МассивАдресДоставки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент КАК Контрагент,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки КАК СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип КАК ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула КАК КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения КАК АдресПолучения,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки КАК АдресДоставки
		|ПОМЕСТИТЬ ТарифыКонтрагента
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий КАК Scan_МатрицаТарифовПоДоставкеИзделий
		|ГДЕ
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент = &КонтрагентСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_МатрицаТарифовПоДоставкеИзделий.ЛогистическийТип,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.Контрагент,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.СпособДоставки,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.КолеснаяФормула,
		|	Scan_МатрицаТарифовПоДоставкеИзделий.АдресПолучения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыКонтрагента.СпособДоставки КАК СпособДоставки
		|ИЗ
		|	ТарифыКонтрагента КАК ТарифыКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыКонтрагента.СпособДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыКонтрагента.ЛогистическийТип КАК ЛогистическийТип
		|ИЗ
		|	ТарифыКонтрагента КАК ТарифыКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыКонтрагента.ЛогистическийТип
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыКонтрагента.КолеснаяФормула КАК КолеснаяФормула
		|ИЗ
		|	ТарифыКонтрагента КАК ТарифыКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыКонтрагента.КолеснаяФормула
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыКонтрагента.АдресПолучения КАК АдресПолучения
		|ИЗ
		|	ТарифыКонтрагента КАК ТарифыКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыКонтрагента.АдресПолучения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыКонтрагента.АдресДоставки КАК АдресДоставки
		|ИЗ
		|	ТарифыКонтрагента КАК ТарифыКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	ТарифыКонтрагента.АдресДоставки";
	
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаСпособДоставки = РезультатЗапроса[1].Выбрать(); 	
	Пока ВыборкаСпособДоставки.Следующий() Цикл
		МассивСпособДоставки.Добавить(ВыборкаСпособДоставки.СпособДоставки);
	КонецЦикла;
	
	ВыборкаЛогистическийТип = РезультатЗапроса[2].Выбрать(); 	
	Пока ВыборкаЛогистическийТип.Следующий() Цикл
		МассивЛогистическийТип.Добавить(ВыборкаЛогистическийТип.ЛогистическийТип);
	КонецЦикла;
	
	ВыборкаКолеснаяФормула = РезультатЗапроса[3].Выбрать(); 	
	Пока ВыборкаКолеснаяФормула.Следующий() Цикл
		МассивКолеснаяФормула.Добавить(ВыборкаКолеснаяФормула.КолеснаяФормула);
	КонецЦикла;
	
	ВыборкаАдресПолучения = РезультатЗапроса[4].Выбрать(); 	
	Пока ВыборкаАдресПолучения.Следующий() Цикл
		МассивАдресПолучения.Добавить(ВыборкаАдресПолучения.АдресПолучения);
	КонецЦикла;
	
	ВыборкаАдресДоставки = РезультатЗапроса[5].Выбрать(); 	
	Пока ВыборкаАдресДоставки.Следующий() Цикл
		МассивАдресДоставки.Добавить(ВыборкаАдресДоставки.АдресДоставки);
	КонецЦикла;
	
	СтруктураПараметров.Вставить("СпособДоставки", МассивСпособДоставки);
	СтруктураПараметров.Вставить("ЛогистическийТип", МассивЛогистическийТип);
	СтруктураПараметров.Вставить("КолеснаяФормула", МассивКолеснаяФормула);
	СтруктураПараметров.Вставить("АдресПолучения", МассивАдресПолучения);
	СтруктураПараметров.Вставить("АдресДоставки", МассивАдресДоставки);
	СтруктураПараметров.Вставить("ДатаУстановкиТарифа", ТекущаяДата());		
		
	Возврат СтруктураПараметров;
	                   	
КонецФункции // rarus tenkam 04.08.2021 mantis 17628 ---
