
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивОпций = РегистрыСведений.Scan_СоответствиеЦеновыхПакетовИОпцийПродуктов.ПолучитьОпцииПродуктов(Объект.Ссылка);
		Для Каждого ЭлементОпции Из МассивОпций Цикл
			НоваяОпция = ОпцииПродуктов.Добавить();
			НоваяОпция.Опция = ЭлементОпции;
		КонецЦикла;
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаОпции Из ОпцииПродуктов Цикл
		РегистрыСведений.Scan_СоответствиеЦеновыхПакетовИОпцийПродуктов.ЗаписатьСоответствие(СтрокаОпции.Опция, ТекущийОбъект.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
  
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 ---
