Перем АвтоматическиОтправлятьПФ;  //rarus tenkam 26.04.2017 mantis 9444 +
Перем ПроверитьДатуПередачиДилеру;	//rarus tenkam 23.11.2017 mantis 11774 +

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ЭтотОбъект.ПровереноАП = Истина И НЕ Отказ Тогда	//rarus sergei 07.10.2016 mantis 7609 +
		//rarus sergei 17.08.2016 mantis 7122 ++
		Если ЭтотОбъект.Сторнирован = Ложь Тогда
			//rarus tenkam 30.11.2016 mantis 7750 ++ закомментировала
			////Проверка согласования документа
			//Если ТребуетСогласования И (НЕ Scan_ОбщегоНазначения_проф.ДокументСогласован(Ссылка)) Тогда
			//	Scan_ОбщегоНазначенияТиповые.СообщитьОбОшибкеПользователю("Документ """ + Ссылка + """ необходимо согласовать!", Отказ);
			//	Возврат;
			//КонецЕсли;
			//rarus tenkam 30.11.2016 mantis 7750 --
			//ДатаПроведения = ТекущаяДата();		//rarus tenkam 31.10.2017 mantis 11695 +
			// регистр Scan_ЗаявкиНаДействия Приход
			Движения.Scan_ЗаявкиНаДействия.Записывать = Истина;
			Для Каждого ТекСтрокаПродуктыПоЗаявке Из ПродуктыПоЗаявке Цикл
				Движение = Движения.Scan_ЗаявкиНаДействия.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				// rarus tenkam 12.08.2019 mantis 14427 +++
				//Движение.Изделие = ТекСтрокаПродуктыПоЗаявке.Продукт.Изделие;
				Движение.Изделие = ТекСтрокаПродуктыПоЗаявке.Изделие;
				// rarus tenkam 12.08.2019 mantis 14427 ---
				Движение.ЗаявкаНаДействие = Ссылка;
				Движение.Заказано = 1;
				Движение.ХозяйственныеОперации = ХозОперация;
				Движение.Пользователь = Менеджер;
			КонецЦикла;
			
			//регистр Scan_КорректировкаИнформацииПоЗаявкам
			Если ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
				//rarus tenkam 08.02.2017 mantis 8331 +++
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
				//rarus tenkam 08.02.2017 mantis 8331 ---
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК	ИЛИ
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
		        ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК Тогда
				
				Если ЭтотОбъект.Движения.Scan_КорректировкаИнформацииПоЗаявкам.Количество() <> 0 тогда
					НаборЗаписей = РегистрыСведений.Scan_КорректировкаИнформацииПоЗаявкам.СоздатьНаборЗаписей(); 
					НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 
					НаборЗаписей.Записать();
				КонецЕсли;
				Движения.Scan_КорректировкаИнформацииПоЗаявкам.Записывать = Истина;
				Для каждого строка Из ПродуктыПоЗаявке Цикл
					Движение = Движения.Scan_КорректировкаИнформацииПоЗаявкам.Добавить();
					// rarus tenkam 12.08.2019 mantis 14427 +++
					//ЗаявкаПеревозчику = ПолучитьЗаявкуПеревозчику(Строка.Продукт.Изделие);
					ЗаявкаПеревозчику = ПолучитьЗаявкуПеревозчику(Строка.Изделие);					
					// rarus tenkam 12.08.2019 mantis 14427 ---
					
					Если ЗаявкаПеревозчику <> Неопределено Тогда
						Движение.Перевозчик = ЗаявкаПеревозчику.Перевозчик;
						Движение.ЗаявкаПеревозчику = ЗаявкаПеревозчику;
						Движение.ДатаПолученияПлан = ЗаявкаПеревозчику.ДатаПолучения;
						Движение.ДатаДоставкиПлан = ЗаявкаПеревозчику.ДатаДоставки;
						Движение.Перевозчик = ЗаявкаПеревозчику.Перевозчик;
						Движение.Грузополучатель = ЗаявкаПеревозчику.КомпанияПолучатель;
						Движение.МестоДоставки = ЗаявкаПеревозчику.МестоДоставки;
						Движение.СпособДоставки = ЗаявкаПеревозчику.СпособДоставкиИзделий;
						//Движение.ПриемВВыходныеДни = ЗаявкаПеревозчику.ВозможностьПриемаВВыходныеДни; ////rarus sergei 30.09.2016 mantis 7122 + замечания заказчика в комментариях к постановке
						Движение.Операция = ЗаявкаПеревозчику.ХозОперация;
						//rarus tenkam 06.10.2016 mantis 7183 ++
						//Если ЗаявкаПеревозчику.ПодтвержденаПеревозчиком =ИСТИНА Тогда
						Если ЗаявкаПеревозчику.Исполнена Тогда
							Движение.СтатусИзделия = Перечисления.Scan_СтатусыИзделий.Исполнена;
						ИначеЕсли ЗаявкаПеревозчику.ПодтвержденаПеревозчиком Тогда
							//rarus tenkam 06.10.2016 mantis 7183 --
							Движение.СтатусИзделия = Перечисления.Scan_СтатусыИзделий.ДоставкаПодтверждена;
						Иначе
							Движение.СтатусИзделия = Перечисления.Scan_СтатусыИзделий.СогласованиеДоставки;
						КонецЕсли; 
					Иначе	
						
						Движение.СтатусИзделия =Перечисления.Scan_СтатусыИзделий.Новая;
						Движение.ДатаДоставкиПлан = ДатаДоставкиПлановая;
						Движение.Грузополучатель = Грузополучатель;	
						Движение.МестоДоставки = МестоДоставки;
						Движение.СпособДоставки = СпособДоставки;
						Движение.Операция = ХозОперация;
					КонецЕсли;
					Движение.ПриемВВыходныеДни =  ПриемВВыходныеИПраздничные;
					Движение.Регистратор = Ссылка;
					Движение.Период = Дата;
					// rarus tenkam 12.08.2019 mantis 14427 +++
					//Движение.Изделие = строка.Продукт.Изделие;
					Движение.Изделие = строка.Изделие;
					// rarus tenkam 12.08.2019 mantis 14427 ---
					Движение.ЗаявкаНаДействие = Ссылка;
					// rarus tenkam 12.08.2019 mantis 14427 +++
					//Движение.КонечныйКлиент = строка.Продукт.Клиент;
					Если ЗначениеЗаполнено(строка.Изделие.ЗаказНаЗавод) Тогда
						ТекКлиент = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(строка.Изделие.ЗаказНаЗавод, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.Клиент, Дата);
						Движение.КонечныйКлиент = ТекКлиент;
					КонецЕсли;
					// rarus tenkam 12.08.2019 mantis 14427 ---
					Движение.GuidСтроки = Новый УникальныйИдентификатор();
					//Движение.СтатусИзделия = Строка.СтатусИзделия;
				КонецЦикла; 
			КонецЕсли; 
			//rarus sergei 17.08.2016 mantis 7122 ++
		Иначе
			НаборЗаписей=РегистрыНакопления.Scan_ЗаявкиНаДействия.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 
			НаборЗаписей.Записать();			
			
			//регистр Scan_КорректировкаИнформацииПоЗаявкам
			НаборЗаписей = РегистрыСведений.Scan_КорректировкаИнформацииПоЗаявкам.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 
			НаборЗаписей.Записать();	
		КонецЕсли;
		
		//rarus abrant 13.07.2017 mantis 9146 +++
		//нужно будет вернуть обратно после проверки!!
		Если Scan_ПраваИНастройки.Scan_Право("ВключитьУчетОказанныхУслуг") Тогда
			Если не Отказ Тогда
				Если ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
					ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ
					ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ
					ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
					ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
					ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
					ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
					ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК Тогда
					
					Если (ЭтотОбъект.СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.Исполнена ИЛИ
						ЭтотОбъект.СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.ДоставкаЗавершена) И
						ЗначениеЗаполнено(ЭтотОбъект.ДатаПолучения) И
						ЗначениеЗаполнено(ЭтотОбъект.МестоДоставки.АдресСкладаЛогистический) И
						ЗначениеЗаполнено(ЭтотОбъект.МестоПолучения.АдресСкладаЛогистический) И
						ЗначениеЗаполнено(ЭтотОбъект.СпособДоставки) И
						ЭтотОбъект.ПровереноАП Тогда
						
						//rarus abrant 14.07.2017 mantis 9146 +++
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт,
						|	Scan_ЗаявкаНаДействиеОказанныеУслуги.Стоимость,
						|	Scan_ЗаявкаНаДействиеОказанныеУслуги.Изделие КАК Изделие
						|ИЗ
						|	Документ.Scan_ЗаявкаНаДействие.ОказанныеУслуги КАК Scan_ЗаявкаНаДействиеОказанныеУслуги
						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
						|		ПО Scan_ЗаявкаНаДействиеОказанныеУслуги.Изделие = Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие
						|			И Scan_ЗаявкаНаДействиеОказанныеУслуги.Ссылка = Scan_ЗаявкаПеревозчикуСоставЗаявки.ЗаявкаНаДействие
						|ГДЕ
						|	Scan_ЗаявкаНаДействиеОказанныеУслуги.Ссылка = &Ссылка";
						Запрос.УстановитьПараметр("Ссылка", Ссылка);
						
						УслугиДилеру = Запрос.Выполнить().Выгрузить();
						
						
						НаборЗаписей = РегистрыСведений.Scan_РеестрОказанныхУслугДилеру.СоздатьНаборЗаписей();
						
						НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
						Для каждого УслугаДилеру из УслугиДилеру Цикл
							
							//rarus tenkam 15.11.2017 mantis (9146) 11774 +++ bug
							Если НЕ ЗначениеЗаполнено(УслугаДилеру.ДатаДоставкиФакт) ИЛИ НЕ ЗначениеЗаполнено(УслугаДилеру.Изделие) Тогда
								Продолжить;
							КонецЕсли;
							//rarus tenkam 15.11.2017 mantis 11774---
							
							НоваяЗапись = НаборЗаписей.Добавить();
							НоваяЗапись.Период 				= ЭтотОбъект.ДатаПолучения;
							НоваяЗапись.Изделие 			= УслугаДилеру.Изделие;
							НоваяЗапись.Контрагент			= ЭтотОбъект.Грузополучатель;//вопрос
							НоваяЗапись.ГруппаПродукта		= УслугаДилеру.Изделие.ТипПродукта.ВидПродукта.ГруппаПродукта;
							НоваяЗапись.СпособДоставки		= ЭтотОбъект.СпособДоставки;
							НоваяЗапись.АдресПолучения		= ЭтотОбъект.МестоПолучения.АдресСкладаЛогистический;
							НоваяЗапись.АдресДоставки		= ЭтотОбъект.МестоДоставки.АдресСкладаЛогистический;
							НоваяЗапись.ЛогистическийТип	= УслугаДилеру.Изделие.ТипПродуктаЛогистический;
							НоваяЗапись.КолеснаяФормула		= УслугаДилеру.Изделие.МодельПродукта.КолеснаяФормула;
							НоваяЗапись.Пользователь 		= ПользователиКлиентСервер.ТекущийПользователь();
							НоваяЗапись.Сумма 				= УслугаДилеру.Стоимость;
							НоваяЗапись.ПакетУслуг			= ЭтотОбъект.ПакетУслуг;	//rarus tenkam 14.08.2017 mantis 10589 +
							
							НоваяЗапись.ДатаДоставкиФакт	= УслугаДилеру.ДатаДоставкиФакт;
						КонецЦикла;
						
						НаборЗаписей.Записать();
						
						//Для каждого УслугаДилеру из ЭтотОбъект.ОказанныеУслуги.Выгрузить() Цикл
						//	МенеджерЗаписи = РегистрыСведений.Scan_РеестрОказанныхУслугДилеру.СоздатьМенеджерЗаписи();
						//	МенеджерЗаписи.Период 				= ЭтотОбъект.ДатаПолучения;
						//	МенеджерЗаписи.Изделие 				= УслугаДилеру.Изделие;
						//	МенеджерЗаписи.Контрагент			= ЭтотОбъект.Грузополучатель;//вопрос
						//	МенеджерЗаписи.СпособДоставки		= ЭтотОбъект.СпособДоставки;
						//	МенеджерЗаписи.АдресПолучения		= ЭтотОбъект.МестоПолучения.АдресСкладаЛогистический;
						//	МенеджерЗаписи.АдресДоставки		= ЭтотОбъект.МестоДоставки.АдресСкладаЛогистический;
						//	МенеджерЗаписи.ЛогистическийТип		= УслугаДилеру.Изделие.ТипПродуктаЛогистический;
						//	МенеджерЗаписи.КолеснаяФормула		= УслугаДилеру.Изделие.МодельПродукта.КолеснаяФормула;
						//	МенеджерЗаписи.Пользователь 		= ПользователиКлиентСервер.ТекущийПользователь();
						//	Попытка
						//		МенеджерЗаписи.Записать(Ложь);
						//	Исключение
						//	КонецПопытки;
						//КонецЦикла;
						//rarus abrant 14.07.2017 mantis 9146 ---
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//rarus abrant 13.07.2017 mantis 9146 ---
	КонецЕсли; //rarus sergei 07.10.2016 mantis 7609 -
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//rarus sergei 05.10.2016 mantis 7162 ++

	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.МестоДоставки) Тогда
	//	//Сообщить("Поле ""Место доставки"" не заполнено"); 
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле  = "МестоДоставки";
	//	Сообщение.Текст = "Поле ""Место доставки"" не заполнено";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Сообщить();
	//	Отказ = Истина;	
	//	Возврат;
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СпособДоставки) Тогда
	//	//Сообщить("Поле ""способ доставки"" не заполнено"); 
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле  = "СпособДоставки";
	//	Сообщение.Текст = "Поле ""способ доставки"" не заполнено";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Сообщить();
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;

	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаДоставкиПлановая) Тогда
	//	//Сообщить("Поле ""Дата доставки (плановая)"" не заполнено"); 
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле  = "ДатаДоставкиПлановая";
	//	Сообщение.Текст = "Поле ""Дата доставки (плановая)"" не заполнено";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Сообщить();
	//	Отказ = Истина;	
	//	Возврат;
	//КонецЕсли; 	
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Грузополучатель) Тогда
	//	//Сообщить("Поле ""Грузополучатель"" не заполнено"); 
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле  = "Грузополучатель";
	//	Сообщение.Текст = "Поле ""Грузополучатель"" не заполнено";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Сообщить();
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
	//	//Сообщить("Поле ""Договор"" не заполнено"); 
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле  = "Договор";
	//	Сообщение.Текст = "Поле ""Договор"" не заполнено";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Сообщить();
	//	Отказ = Истина;	
	//	Возврат;
	//КонецЕсли;
	
	//rarus tenkam 26.12.2016 mantis 7609 ++ (закомментировала, полностью изменила проверку)
	
	//Отказ = ПроверитьВЗависимостиОтХозОперацииЗаполнениеПолей();
	////rarus sergei 05.10.2016 mantis 7162 --
	//
	////rarus sergei 07.10.2016 mantis 7609 ++	
	//Если НЕ Отказ Тогда 
	//	Отказ = ПроверитьЛогикуЗаполненияВЗависимостиОтХозОперации();
	//КонецЕсли; 
	////rarus sergei 07.10.2016 mantis 7609 --	

	//
	////rarus sergei 21.11.2016 mantis 7121 ++
	//Если НЕ Отказ Тогда
	//    Отказ = ПроверитьДоговора();
	//КонецЕсли;
	////rarus sergei 21.11.2016 mantis 7121 --
	//Если НЕ Отказ И ЭтотОбъект.ПродуктыПоЗаявке.Количество()=0 Тогда
	//	//Сообщить("В табличной части ""Продукты по заявке"" не выбран ни один продукт"); 
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле  = "ПродуктыПоЗаявке[0].Продукт";
	//	Сообщение.Текст = "В табличной части ""Продукты по заявке"" не выбран ни один продукт";
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Сообщить();
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//Если НЕ Отказ Тогда //rarus sergei 05.10.2016 mantis 7162 + 
	//	Отказ = ПроверитьТабличнуюЧастьПродуктыПоЗаявке(РежимЗаписи);
	//КонецЕсли;
	
	//rarus tenkam 26.12.2016 mantis 7609 --
	
	// rarus tenkam 12.08.2019 mantis 14427 +++
	////rarus tenkam 12.08.2016 mantis 7219 ++ (баг с отображением связанных документов)
	////В будущем ошибок не должно быть => этот кусок кода будет лишним
	//Если НЕ Отказ Тогда
	//	Для Каждого СтрокаПродукты Из ПродуктыПоЗаявке Цикл
	//		Если ЗначениеЗаполнено(СтрокаПродукты.Продукт.Изделие) И НЕ ЗначениеЗаполнено(СтрокаПродукты.Изделие) Тогда
	//			СтрокаПродукты.Изделие = СтрокаПродукты.Продукт.Изделие;
	//		КонецЕсли;
	//	КонецЦикла;	
	//КонецЕсли;
	////rarus tenkam 12.08.2016 mantis 7219 ++ (баг с отображением связанных документов)
	// rarus tenkam 12.08.2019 mantis 14427 ---
	
	//rarus tenkam 10.10.2016 mantis 7167 ++ (баг)
	МенеджерНовый = ПользователиКлиентСервер.ТекущийПользователь();	
	Если МенеджерНовый <> Менеджер Тогда
		Менеджер = МенеджерНовый;
		Организация = МенеджерНовый.Организация;
		ПодразделениеКомпании = МенеджерНовый.ПодразделениеОрганизации;
	КонецЕсли;
	//rarus tenkam 10.10.2016 mantis 7167 --
	
	//rarus tenkam 26.12.2016 mantis 7609 ++ (закомментировала, полностью изменила проверку)
	////rarus sergei 05.12.2016 mantis 7188 ++
	//Если НЕ Отказ Тогда
	//	Если Scan_ПраваИНастройки.Scan_Право("ВыполнятьПроверкуНаличияОдобренияНаПолучениеПродукта") И  
	//		(ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	//		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	//		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	//		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение) Тогда
	//		Для каждого строкаТЧ Из ПродуктыПоЗаявке Цикл
	//			Если НЕ строкаТЧ.Продукт.ЗаказНаЗавод.ОдобреноПолучениеПродукта Тогда
	//				Сообщить("Внимание! У Изделия № " + строкаТЧ.Продукт.Изделие.НомерИзделия +" в заказе не установлен признак ""одобрено получение продукта"". Дальнейшие действия с изделием запрещены");
	//				Отказ = Истина;	
	//			КонецЕсли;
	//		КонецЦикла; 	
	//	КонецЕсли; 
	//КонецЕсли; 	
	////rarus sergei 05.12.2016 mantis 7188 --
	//rarus tenkam 26.12.2016 mantis 7609 --
	
	//rarus sergei 09.11.2016 mantis 7163 ++
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus sergei 09.11.2016 mantis 7163 --
	
	// rarus tenkam 19.06.2019 mantis 12631 +++
	Если ЭтотОбъект.ЭтоНовый() И (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		
		МассивИзделий = ПродуктыПоЗаявке.ВыгрузитьКолонку("Изделие");
		ПроверитьУжеЕстьЗаявкаНаПродажу(Отказ, МассивИзделий, ДокументОснование);	//rarus tenkam 21.06.2019 mantis 14557 + (новый аргумент ДокументОснование) 
	КонецЕсли;
	// rarus tenkam 19.06.2019 mantis 12631 ---
	
	
	//rarus tenkam 05.05.2017 mantis 9423 +++
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
			//rarus abrant 05.06.2017 mantis 9423 +++
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК
			//rarus abrant 05.06.2017 mantis 9423 ---
			Тогда
			ДатаДоставки = ?(ЗначениеЗаполнено(ДатаДоставкиПлановая), ДатаДоставкиПлановая, ДатаИВремяПоручения);
			ДатаДоставкиСтарая = ?(ЗначениеЗаполнено(Ссылка.ДатаДоставкиПлановая), Ссылка.ДатаДоставкиПлановая, Ссылка.ДатаИВремяПоручения);
			
			Если (ЭтоНовый() ИЛИ НЕ Ссылка.Проведен) ИЛИ
				(ДатаДоставки <> ДатаДоставкиСтарая ИЛИ ПродуктыПоЗаявке.Количество() <> Ссылка.ПродуктыПоЗаявке.Количество()) Тогда
				
				ДокументСсылка = ?(ЭтоНовый(), Неопределено, Ссылка);
				Результат = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьКоличествоСвободныхМест(МестоДоставки,ДатаДоставки,ПродуктыПоЗаявке.Количество(),ДокументСсылка,ТекущаяДата());
			
				Если Результат < 0 Тогда
					//rarus anch 16.05.2017 mantis 9423 +++
					//ТекстСообщения = "Внимание! Планируемый лимит изделий в месте доставки превышен на " + Результат*(-1) + " изделий";
					ТекстСообщения = "Внимание! Планируемый лимит изделий в месте доставки превышен на " + Результат*(-1) + " шт. Справочно: Емкость в месте доставки - " + " " + ЭтотОбъект.МестоДоставки.КоличествоПродуктовНаПлощадке + " шт.";
                    //rarus anch 16.05.2017 mantis 9423 +++
					Сообщить(ТекстСообщения);
					Отказ = Истина;			
				КонецЕсли;		
			КонецЕсли;  			
		КонецЕсли;
		
		//rarus abrant 05.06.2017 mantis 9424 +++
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение 			ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение 								ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство				ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство								ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу 	ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу 	ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение 						ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство						Тогда
			
			Если Договор.ДатаОкончания < ДатаДоставкиПлановая 					И
				//rarus abrant 13.06.2017 mantis 9424 +++
				Договор.Бессрочный = Ложь И
				//rarus abrant 13.06.2017 mantis 9424 ---
				(Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Подряда 	ИЛИ
				Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения) Тогда
				//rarus abrant 30.06.2017 mantis 9424 +++
				СКем = "";
				Если ЗначениеЗаполнено(Хранитель) Тогда
					СКем = " с хранителем 2";
				ИначеЕсли ЗначениеЗаполнено(Подрядчик) Тогда	
					СКем = " с поставщиком услуг";
				КонецЕсли;
				//ТекстСообщения = "Заявка на действие №" + Номер + " не может быть оформлена в связи с истечением срока действия договора " + Договор.ВидДоговора + " " + Договор.НомерДоговора + ".";
				ТекстСообщения = "Документ не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + СКем + ".";
				//rarus abrant 30.06.2017 mantis 9424 ---
				Сообщить(ТекстСообщения);
				Отказ = Истина;
			КонецЕсли;
 		КонецЕсли;
		//rarus abrant 05.06.2017 mantis 9424 ---
	КонецЕсли;
	//rarus tenkam 05.05.2017 mantis 9423 ---

	АвтоматическиОтправлятьПФ = Ложь; 	//rarus tenkam 26.04.2017 mantis 9444 +
	//rarus tenkam 30.11.2016 mantis 7750 ++
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ТребуетСогласования Тогда
			Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьСогласование") Тогда
				Если (НЕ Scan_ОбщегоНазначения_проф.ДокументСогласован(Ссылка)) Тогда
					// rarus tenkam 07.11.2018 mantis 13672 +++
					//Scan_ОбщегоНазначенияТиповые.СообщитьОбОшибкеПользователю("Документ """ + Ссылка + """ необходимо согласовать!", Отказ);
					ТекстОшибки = "Документ должен быть согласован.";
					Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
						ТекстОшибки = ТекстОшибки + " Необходимо записать документ.";
					КонецЕсли;
					Сообщить(ТекстОшибки);
					Отказ = Истина;
					// rarus tenkam 07.11.2018 mantis 13672 ---
					Возврат;
				Иначе	//документ согласован
					//1. Если это корректировка и док. основания не был сторнирован, то согласовывали корректировку, сторнируем исходный документ
					Если Корректировка И НЕ ДокументОснование.Сторнирован Тогда
						Scan_ВспомогательныеФункцииСервер.СторнироватьЗаявкуКорректировки(ДокументОснование);
						//rarus tenkam 06.03.2017 mantis 6897 +++
						//Документ больше не требует согласования
						ТребуетСогласования = Ложь;
						//rarus tenkam 06.03.2017 mantis 6897 ---
					Иначе
						//2. Если это аннулирование, то согласовали сторнирование документа
						Если НЕ Сторнирован Тогда
							Scan_ВспомогательныеФункцииСервер.ОбработатьСторнированиеЗаявки(Ссылка);
							Сторнирован = Истина;
							СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.Аннулирована;
							ЭтотОбъект.ДополнительныеСвойства.Вставить("ОтправитьАннулированнуюЗаявкуНаДействие", Истина); 	//rarus tenkam 12.12.2017 mantis 11858 +
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		Иначе
			// Это корректировка в случае отсутствия убытия на маршрут
			Если Корректировка И НЕ ДокументОснование.Сторнирован Тогда
				Scan_ВспомогательныеФункцииСервер.СторнироватьЗаявкуКорректировки(ДокументОснование);
			КонецЕсли;				
		КонецЕсли;
		
		//rarus tenkam 26.04.2017 mantis 9444 +++ (раскомментировано по 11216)
		//rarus tenkam 25.09.2017 mantis 11216 +++
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу 			ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение 			ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу	ИЛИ		// rarus tenkam 23.01.2019 mantis 13827 + 
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение 								ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу	 			ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство				ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство								ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу 	Тогда
		//rarus tenkam 25.09.2017 mantis 11216 ---
			СтароеПровереноАП = Ссылка.ПровереноАП;
			Если ПровереноАП И Scan_ПраваИНастройки.Scan_Право("АвтоматическаяОтправкаПФЗаявокНаДействие") Тогда
				Если НЕ Ссылка.Проведен ИЛИ СтароеПровереноАП <> ПровереноАП Тогда
					АвтоматическиОтправлятьПФ = Истина;
				КонецЕсли; 
			КонецЕсли;
			//rarus tenkam 26.04.2017 mantis 9444 ---
		КонецЕсли;	// rarus tenkam 25.09.2017 mantis 11216 +
		
		//rarus tenkam 10.11.2017 mantis 8465 +++
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство И Не ЗначениеЗаполнено(Подрядчик) Тогда
			Подрядчик = Грузополучатель;
		КонецЕсли;
		//rarus tenkam 10.11.2017 mantis 8465 ---
		
		//rarus tenkam 23.11.2017 mantis 11774 +++
		СтарыйСтатус = Ссылка.СтатусЗаявки;
		
		// rarus tenkam 10.04.2018 mantis 12988 +++
		Если НЕ ЗначениеЗаполнено(СтарыйСтатус) Тогда
			//rarus pechek 18.02.2020 mantis 15560 +++
			Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь Тогда 
				СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.ВРаботе;
			Иначе
				//rarus pechek 18.02.2020 mantis 15560 +++
				СтарыйСтатус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
			КонецЕсли;
			//rarus pechek 23.01.2020 mantis 15560 +++
		ИначеЕсли СтарыйСтатус = Справочники.Scan_СтатусыЗаявокНаДействие.Новая и ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь Тогда	 
			СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.ВРаботе;
			//rarus pechek 23.01.2020 mantis 15560 ---
		КонецЕсли;		
		// rarus tenkam 10.04.2018 mantis 12988 ---
		
		Если СтарыйСтатус <> СтатусЗаявки Тогда
			Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу) И
				СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.ВРаботе Тогда
				ПроверитьДатуПередачиДилеру = Истина
			ИначеЕсли ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь И
				(СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.Новая ИЛИ СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.ВРаботе) Тогда //rarus pechek 23.01.2020 mantis 15560 было  СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.Новая
				ПроверитьДатуПередачиДилеру = Истина;			
			КонецЕсли;
		КонецЕсли;

		//rarus tenkam 23.11.2017 mantis 11774 ---
		//rarus pechek 23.01.2020 mantis 15560 +++
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь Тогда	
			СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
		КонецЕсли;
		//rarus pechek 23.01.2020 mantis 15560 ---
	КонецЕсли;
	//rarus tenkam 30.11.2016 mantis 7750 --
	
	//rarus vikhle 01.12.2020 mt 16823 +++
	Если Не Отказ И ПродуктыПоЗаявке.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(ПродуктыПоЗаявке.Изделие КАК Справочник.Scan_Изделия) КАК Изделие
		               |ПОМЕСТИТЬ ПродуктыПоЗаявке
		               |ИЗ
		               |	&ПродуктыПоЗаявке КАК ПродуктыПоЗаявке
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПродуктыПоЗаявке.Изделие КАК Изделие
		               |ИЗ
		               |	ПродуктыПоЗаявке КАК ПродуктыПоЗаявке
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ПродуктыПоЗаявке.Изделие.НомерИзделия";
		Запрос.УстановитьПараметр("ПродуктыПоЗаявке",ПродуктыПоЗаявке.Выгрузить());
		ОтсортированнаяТЗ = Запрос.Выполнить().Выгрузить();
		ПродуктыПоЗаявке.Загрузить(ОтсортированнаяТЗ);
	КонецЕсли;	
	//rarus vikhle 01.12.2020 mt 16823 ---
	
КонецПроцедуры

//rarus tenkam mantis 7750 ++
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) //rarus tenkam mantis 7750 ++
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_ЗаявкаНаДействие") Тогда
		// На основании заявки создается только заявка-корректировка
		Грузоотправитель = ДанныеЗаполнения.Грузоотправитель;
		Грузополучатель = ДанныеЗаполнения.Грузополучатель;
		ДатаВыкупа = ДанныеЗаполнения.ДатаВыкупа;
		ДатаДоставкиПлановая = ДанныеЗаполнения.ДатаДоставкиПлановая;
		ДатаИВремяПоручения = ДанныеЗаполнения.ДатаИВремяПоручения;
		ДатаПередачиВПроизводство = ДанныеЗаполнения.ДатаПередачиВПроизводство;
		ДатаПолучения = ДанныеЗаполнения.ДатаПолучения;
		ДатаПродажи = ДанныеЗаполнения.ДатаПродажи;
		Договор = ДанныеЗаполнения.Договор;
		ДоговорСПоставщиком = ДанныеЗаполнения.ДоговорСПоставщиком;
		Комментарий = ДанныеЗаполнения.Комментарий;
		МестоДоставки = ДанныеЗаполнения.МестоДоставки;
		МестоПолучения = ДанныеЗаполнения.МестоПолучения;
		Подрядчик = ДанныеЗаполнения.Подрядчик;
		ПриемВВыходныеИПраздничные = ДанныеЗаполнения.ПриемВВыходныеИПраздничные;
		СпособДоставки = ДанныеЗаполнения.СпособДоставки;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		//rarus tenkam 06.03.2017 mantis 6897 +++ баг
		//Сторнирован = ДанныеЗаполнения.Сторнирован;
		//ТребуетСогласования = ДанныеЗаполнения.ТребуетСогласования;
		ТребуетСогласования = Ложь;
		//rarus tenkam 06.03.2017 mantis 6897 ---
		ХозОперация = ДанныеЗаполнения.ХозОперация;
		Хранитель = ДанныеЗаполнения.Хранитель;
		ШтрихКод = ДанныеЗаполнения.ШтрихКод;

		ДатаСоздания = ТекущаяДата();
		СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.Новая;
		Корректировка = Истина;
		ПровереноАП = Ложь;
		Для Каждого ТекСтрокаКонтактныеЛица Из ДанныеЗаполнения.КонтактныеЛица Цикл
			НоваяСтрока = КонтактныеЛица.Добавить();
			НоваяСтрока.ВидКонтактнойИнформации = ТекСтрокаКонтактныеЛица.ВидКонтактнойИнформации;
			НоваяСтрока.КонтактноеЛицо = ТекСтрокаКонтактныеЛица.КонтактноеЛицо;
			НоваяСтрока.Представление = ТекСтрокаКонтактныеЛица.Представление;
		КонецЦикла;
		Для Каждого ТекСтрокаПродуктыПоЗаявке Из ДанныеЗаполнения.ПродуктыПоЗаявке Цикл
			НоваяСтрока = ПродуктыПоЗаявке.Добавить();
			НоваяСтрока.Изделие = ТекСтрокаПродуктыПоЗаявке.Изделие;
			// rarus tenkam 12.08.2019 mantis 14427 +++
			//НоваяСтрока.Продукт = ТекСтрокаПродуктыПоЗаявке.Продукт;
			// rarus tenkam 12.08.2019 mantis 14427 ---
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) //rarus tenkam mantis 7750 ++
	//rarus tenkam 24.10.2017 mantis 11439 +++
	//ТекПодрядчик = ?(ТипЗнч(Подрядчик) = Тип("СправочникСсылка.Scan_Дилеры"), Подрядчик.Контрагент, Подрядчик);		//rarus tenkam 31.01.2017 mantis 8400 +
	ТекПодрядчик = Подрядчик;
	//rarus tenkam 24.10.2017 mantis 11439 ---
	
	//rarus tenkam 16.01.2017 mantis 8172 ++
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ
		//ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение ИЛИ		//rarus tenkam 12.07.2017 mantis 10166 +	
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство) Тогда	
		
		// Места хранения должны принадлежать одному контрагенту, а именно тому, который указан в поле «поставщику услуг»
		//rarus bonmak 15.04.2020 14456 ++
		//rarus bonmak 03.06.2020 16165 ++
		Если МестоПолучения.Контрагент <> ТекПодрядчик Тогда
		//Если НЕ РегистрыСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.ЕстьСвязьКомпанияКонтрагент(МестоПолучения.СтанцияДилера, ТекПодрядчик) Тогда 
		//rarus bonmak 03.06.2020 16165 --	
		//rarus bonmak 15.04.2020 14456 --
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Место получения не принадлежит поставщику услуг!";
			Сообщение.Поле = "МестоПолучения";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
		//rarus bonmak 15.04.2020 14456 ++
		//rarus bonmak 03.06.2020 16165 ++
		Если МестоДоставки.Контрагент <> ТекПодрядчик Тогда
		//Если НЕ РегистрыСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.ЕстьСвязьКомпанияКонтрагент(МестоДоставки.СтанцияДилера, ТекПодрядчик) Тогда 
		//rarus bonmak 03.06.2020 16165 --	
		//rarus bonmak 15.04.2020 14456 --
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Место доставки не принадлежит поставщику услуг!";
			Сообщение.Поле = "МестоДоставки";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	//rarus tenkam 12.07.2017 mantis 10166 +++
	Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение Тогда
		//rarus bonmak 15.04.2020 14456 ++
		//rarus bonmak 03.06.2020 16165 ++
		Если МестоДоставки.Контрагент <> ТекПодрядчик Тогда
		//Если НЕ РегистрыСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.ЕстьСвязьКомпанияКонтрагент(МестоДоставки.СтанцияДилера, ТекПодрядчик) Тогда 
		//rarus bonmak 03.06.2020 16165 --	
		//rarus bonmak 15.04.2020 14456 --	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Место доставки не принадлежит поставщику услуг!";
			Сообщение.Поле = "МестоДоставки";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	//rarus tenkam 12.07.2017 mantis 10166 ---
	
	Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу Тогда		
		// Место получения должно принадлежать "поставщику услуг", а место доставки – хранителю 2
		//rarus bonmak 15.04.2020 14456 ++
		//rarus bonmak 03.06.2020 16165 ++
		Если МестоПолучения.Контрагент <> ТекПодрядчик Тогда
		//Если НЕ РегистрыСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.ЕстьСвязьКомпанияКонтрагент(МестоПолучения.СтанцияДилера, ТекПодрядчик) Тогда 
		//rarus bonmak 03.06.2020 16165 --	
		//rarus bonmak 15.04.2020 14456 --
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Место получения не принадлежит поставщику услуг!";
			Сообщение.Поле = "МестоПолучения";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
		//rarus tenkam 16.03.2017 mantis 7623 +++
		//ТекХранитель = ?(ТипЗнч(Хранитель) = Тип("СправочникСсылка.Scan_Дилеры"), Хранитель.Контрагент, Хранитель);	//rarus tenkam 24.10.2017 mantis 11439 +
		
		//rarus tenkam 24.10.2017 mantis 11439 +++
		//Если МестоДоставки.Контрагент <> ТекХранитель Тогда
		//rarus bonmak 15.04.2020 14456 ++
		//rarus bonmak 03.06.2020 16165 ++
		Если МестоДоставки.Контрагент <> Хранитель Тогда
		//Если НЕ РегистрыСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.ЕстьСвязьКомпанияКонтрагент(МестоДоставки.СтанцияДилера, Хранитель) Тогда 
		//rarus bonmak 03.06.2020 16165 --	
		//rarus bonmak 15.04.2020 14456 --
			//rarus tenkam 24.10.2017 mantis 11439 ---
		//rarus tenkam 16.03.2017 mantis 7623 ---
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Место доставки не принадлежит хранителю 2!";
			Сообщение.Поле = "МестоДоставки";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;	
	//rarus tenkam 16.01.2017 mantis 8172 -- 	
	
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство) Тогда
		
		// Факт адреса должен совпадать
		Если МестоПолучения.АдресСкладаФактический <> МестоДоставки.АдресСкладаФактический Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Фактические адреса места получения и места доставки не совпадают!";
			Сообщение.Поле = "МестоДоставки";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	//rarus tenkam 15.02.2017 mantis 7177 +++
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ 		//rarus tenkam 14.08.2017 mantis 9319 +
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК ИЛИ 		//rarus tenkam 26.09.2017 mantis 10742 +
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		
		//rarus tenkam 27.02.2017 mantis 8415 +++
		Если СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.Новая ИЛИ СтатусЗаявки = Справочники.Scan_СтатусыЗаявокНаДействие.ВРаботе Тогда
			ПроверятьДатыПродажиИПередачи = Истина;
		Иначе
			ПроверятьДатыПродажиИПередачи = Ложь;
		КонецЕсли;
		//rarus tenkam 27.02.2017 mantis 8415 ---
		
		// rarus tenkam 30.12.2020 mantis 16934 +++
		ПроверятьСОПИЗаказчика = НЕ Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.Scan_ВидыДоговоров.СПокупателем");
		// rarus tenkam 30.12.2020 mantis 16934 +++
		
		// "Заказчик" и "Грузополучатель", "СОП" и "Договор" должены совпадать
		Для Индекс = 0 по ПродуктыПоЗаявке.Количество()-1 Цикл
			// rarus tenkam 12.08.2019 mantis 14427 +++ 
			//ТекПродукт = ПродуктыПоЗаявке.Получить(Индекс);
			ТекСтрока = ПродуктыПоЗаявке.Получить(Индекс);
			// rarus tenkam 12.08.2019 mantis 14427 ---
			
			// rarus tenkam 12.08.2019 mantis 14427 +++ 
			//Если НЕ ЗначениеЗаполнено(ТекПродукт.Продукт.Заказчик) Тогда 
			//	ТекЗаказчик = Неопределено;
			//ИначеЕсли ТипЗнч(ТекПродукт.Продукт.Заказчик) = Тип("СправочникСсылка.Организации") Тогда
			//	ТекЗаказчик = "ЭтоОрганизация";
			//	Сообщение = Новый СообщениеПользователю();
			//	Сообщение.Текст = "В строке " + (Индекс+1) + " заказчик продукта " + ТекПродукт.Продукт.Заказчик + " является организацией!";
			//	Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Продукт";
			//	Сообщение.УстановитьДанные(ЭтотОбъект);
			//	Сообщение.Сообщить();
			//	Отказ = Истина;	
			//ИначеЕсли ТипЗнч(ТекПродукт.Продукт.Заказчик) = Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			//	ТекЗаказчик = ТекПродукт.Продукт.Заказчик;
			//ИначеЕсли ТипЗнч(ТекПродукт.Продукт.Заказчик) = Тип("СправочникСсылка.Scan_Дилеры") Тогда
			//	ТекЗаказчик = ТекПродукт.Продукт.Заказчик.Контрагент;
			//КонецЕсли;
			
			// rarus tenkam 21.08.2019 mantis 14793 +++
			//Если НЕ ЗначениеЗаполнено(ТекСтрока.Изделие.ЗаказНаЗавод) ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.Изделие.ЗаказНаЗавод.Заказчик) Тогда
			//	ТекЗаказчик = Неопределено;
			//Иначе	// теперь тип заказчика только контрагент
			//	ТекЗаказчик = ТекСтрока.Изделие.ЗаказНаЗавод.Заказчик;
			
			Если ЗначениеЗаполнено(ТекСтрока.Изделие.ЗаказНаЗавод) Тогда
				ТекЗаказчик = ТекСтрока.Изделие.ЗаказНаЗавод.Заказчик;
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Изделие.СОП) Тогда
				ТекЗаказчик = ТекСтрока.Изделие.СОП.Владелец;
			Иначе
				ТекЗаказчик = Неопределено;
			КонецЕсли; 
			Если ТекЗаказчик = Справочники.Scan_Контрагенты.ПустаяСсылка() Тогда
				ТекЗаказчик = Неопределено;
			// rarus tenkam 21.08.2019 mantis 14793 ---   			
			КонецЕсли;   
			// rarus tenkam 12.08.2019 mantis 14427 ---
			
			Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда 
				ТекГрузополучатель = Неопределено;
			ИначеЕсли ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Scan_Контрагенты") Тогда
				ТекГрузополучатель = Грузополучатель;
			//rarus tenkam 24.10.2017 mantis 11439 +++
			//ИначеЕсли ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Scan_Дилеры") Тогда 	
			//	ТекГрузополучатель = Грузополучатель.Контрагент;
			//rarus tenkam 24.10.2017 mantis 11439 ---
			КонецЕсли;
			
			//ТекЗаказчик = ?(ТипЗнч(ТекПродукт.Продукт.Заказчик) = Тип("СправочникСсылка.Scan_Контрагенты"),ТекПродукт.Продукт.Заказчик, ТекПродукт.Продукт.Заказчик.Контрагент);
			//ТекГрузополучатель = ?(ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Scan_Контрагенты"), Грузополучатель, Грузополучатель.Контрагент);
			//Если ТекЗаказчик <> "ЭтоОрганизация" Тогда	// rarus tenkam 12.08.2019 mantis 14427 +
			
			Если ТекЗаказчик <> ТекГрузополучатель И 
				ПроверятьСОПИЗаказчика Тогда	// rarus tenkam 30.12.2020 mantis 16934 +
				Сообщение = Новый СообщениеПользователю();
				// rarus tenkam 12.08.2019 mantis 14427 +++
				//Сообщение.Текст = "В строке " + (Индекс+1) + " заказчик продукта " + ТекПродукт.Продукт.Заказчик + " не соответствует грузополучателю "+ Грузополучатель;
				//Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Продукт";
				Сообщение.Текст = "В строке " + (Индекс+1) + " заказчик продукта " + ТекЗаказчик + " не соответствует грузополучателю "+ ТекГрузополучатель;
				Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Изделие";
				// rarus tenkam 12.08.2019 mantis 14427 ---
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;		
			КонецЕсли;
			//КонецЕсли;	// rarus tenkam 12.08.2019 mantis 14427 +
						
			// rarus tenkam 12.08.2019 mantis 14427 +++
			
			//Если ТекПродукт.Продукт.СОП <> Договор Тогда
			//	Сообщение = Новый СообщениеПользователю();                            
			//	Сообщение.Текст = "В строке " + (Индекс+1) + " СОП продукта " + ТекПродукт.Продукт.СОП + " не соответствует договору " + Договор;
			//	Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Продукт";
			//	Сообщение.УстановитьДанные(ЭтотОбъект);
			//	Сообщение.Сообщить();
			//	Отказ = Истина;	
			//КонецЕсли;
			//
			////rarus tenkam 27.02.2017 mantis 8415 +++
			//Если ПроверятьДатыПродажиИПередачи Тогда
			//	Если ЗначениеЗаполнено(ТекПродукт.Продукт.ДатаПередачиИзделияДилеру) И ЗначениеЗаполнено(ТекПродукт.Продукт.ДатаПродажиИзделия) Тогда
			//		Сообщение = Новый СообщениеПользователю();                            
			//		Сообщение.Текст = "Повторная продажа запрещена! В строке " + (Индекс+1) + " у продукта есть дата передачи дилеру и дата продажи!";
			//		Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Продукт";
			//		Сообщение.УстановитьДанные(ЭтотОбъект);
			//		Сообщение.Сообщить();
			//		Отказ = Истина;		
			//	КонецЕсли;
			//КонецЕсли;
			////rarus tenkam 27.02.2017 mantis 8415 ---

			// rarus tenkam 09.08.2021 mantis 18059 +++
			//Если ТекСтрока.Изделие.СОП <> Договор И 
			Если НЕ Справочники.Scan_ДоговорыВзаиморасчетов.ДоговорыПодчинены(ТекСтрока.Изделие.СОП, Договор) И 
			// rarus tenkam 09.08.2021 mantis 18059 ---
				ПроверятьСОПИЗаказчика Тогда	// rarus tenkam 30.12.2020 mantis 16934 +
				Сообщение = Новый СообщениеПользователю();                            
				Сообщение.Текст = "В строке " + (Индекс+1) + " СОП продукта " + ТекСтрока.Изделие.СОП + " не соответствует договору " + Договор;
				Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Изделие";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;	
			КонецЕсли;	
			//rarus bonmak 03.09.2020 14375 ++
			ЭтоБУ = Ложь;
			Если Scan_ПраваИНастройки.Scan_Право("ИспользоватьЗадачиСНакладными") Тогда 
				ЭтоБУ = ТекСтрока.Изделие.БУ; 
			КонецЕсли;
			//rarus bonmak 03.09.2020 14375 --
			Если НЕ ЭтоБУ Тогда //rarus bonmak 03.09.2020 14375 добавил условие			
				Если ПроверятьДатыПродажиИПередачи И ЗначениеЗаполнено(ТекСтрока.Изделие.ЗаказНаЗавод) Тогда
					
					ДатаПередачиИзделияДилеру = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(ТекСтрока.Изделие.ЗаказНаЗавод,
					Перечисления.Scan_КлючевыеДаты.ПолучитьОбъектКлючевойДатыПоПеречислению(Перечисления.Scan_КлючевыеДаты.ДатаПередачиИзделияДилеру), 
					Перечисления.Scan_КлючевыеДаты.ДатаПередачиИзделияДилеру, ТекущаяДата());
					
					ДатаПродажиИзделия = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(ТекСтрока.Изделие.ЗаказНаЗавод,
					Перечисления.Scan_КлючевыеДаты.ПолучитьОбъектКлючевойДатыПоПеречислению(Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия), 
					Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия, ТекущаяДата());
					
					Если ЗначениеЗаполнено(ДатаПередачиИзделияДилеру) И ЗначениеЗаполнено(ДатаПродажиИзделия) Тогда
						Сообщение = Новый СообщениеПользователю();                            
						Сообщение.Текст = "Повторная продажа запрещена! В строке " + (Индекс+1) + " у продукта есть дата передачи дилеру и дата продажи!";
						Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Изделие";
						Сообщение.УстановитьДанные(ЭтотОбъект);
						Сообщение.Сообщить();
						Отказ = Истина;		
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			// rarus tenkam 12.08.2019 mantis 14427 ---
		КонецЦикла;
	КонецЕсли; 	
	//rarus tenkam 15.02.2017 mantis 7177 ---
	
	//rarus tenkam 26.12.2016 mantis 7609 ++ (переделала процедуру проверки заполнения полей)

	//// СПОСОБ ДОСТАВКИ
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
	//rarus tenkam 08.02.2017 mantis 8331 +++
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
	//rarus tenkam 08.02.2017 mantis 8331 ---
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
	
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СпособДоставки) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "СпособДоставки";
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "Поле ""Способ доставки"" не заполнено";
			Сообщение.Текст = НСтр("ru = 'Поле ""Способ доставки"" не заполнено""'; en = 'Field ""Delivery Method"" not filled'");
			//rarus FominskiyAS 24.04.2019  mantis 14191 --- 
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//// МЕСТО ПОЛУЧЕНИЯ
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
	//rarus tenkam 08.02.2017 mantis 8331 +++
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
	//rarus tenkam 08.02.2017 mantis 8331 ---
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение ИЛИ	//tenkam 16.01.2017 mantis 8172 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу ИЛИ	
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ	
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство ИЛИ	//tenkam 16.01.2017 mantis 8172 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ 		//rarus tenkam 14.08.2017 mantis 9319 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу) Тогда	//tenkam 16.01.2017 mantis 8172 +	

		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь Тогда 		//rarus tenkam 14.08.2017 mantis 9319 +
			ЗаголовокПоля = "Место продажи";	
		Иначе
			ЗаголовокПоля = "Место получения";	
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.МестоПолучения) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "МестоПолучения";
			Сообщение.Текст = "Поле """ + ЗаголовокПоля + """ не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//rarus tenkam 26.09.2017 mantis 10742 +++
	Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК Тогда		
		
		// rarus tenkam 27.03.2019 mantis 14260 +++
		////rarus tenkam 24.11.2017 mantis 11353 +++
		//Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК Тогда
		////rarus tenkam 24.11.2017 mantis 11353 ---
		//
		//	// Место получения должно принадлежать "Скании-Русь"
		//	Если МестоПолучения.Контрагент <> Справочники.Scan_Контрагенты.СканияРусь Тогда
		//		Сообщение = Новый СообщениеПользователю();
		//		Сообщение.Текст = "Место получения не принадлежит Скании-Русь!";
		//		Сообщение.Поле = "МестоПолучения";
		//		Сообщение.УстановитьДанные(ЭтотОбъект);
		//		Сообщение.Сообщить();
		//		Отказ = Истина;	
		//	КонецЕсли;
		//КонецЕсли;	//rarus tenkam 24.11.2017 mantis 11353 +
		// rarus tenkam 27.03.2019 mantis 14260 ---
		
		Если МестоПолучения.ТипСклада <> Перечисления.Scan_ТипыСклада.АдресДоставки Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "МестоПолучения";
			Сообщение.Текст = "В поле ""Место продажи"" должен быть указан склад с типом ""Адрес доставки""!";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;		
	КонецЕсли;	
	//rarus tenkam 26.09.2017 mantis 10742 ---

	// rarus tenkam 13.02.2018 mantis 12775 +++
	Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК Тогда		
		
		Если МестоПолучения.ТипСклада <> Перечисления.Scan_ТипыСклада.Хранение Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "МестоПолучения";
			Сообщение.Текст = "В поле ""Место получения"" должен быть указан склад с типом ""Хранение""!";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	//rarus tenkam 13.02.2018 mantis 12775 ---

	
	//// ГРУЗООТПРАВИТЕЛЬ
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
	//rarus tenkam 08.02.2017 mantis 8331 +++
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
	//rarus tenkam 08.02.2017 mantis 8331 ---
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ 		//rarus tenkam 14.08.2017 mantis 9319 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Грузоотправитель) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "Грузоотправитель";
			Сообщение.Текст = "Поле ""Грузоотправитель"" не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// rarus tenkam 28.03.2019 mantis 14260 +++
	////rarus tenkam 14.08.2017 mantis 9319 +++  	
	//Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК Тогда 	//rarus tenkam 26.09.2017 mantis 10742 +
	//	//ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь Тогда		//rarus tenkam 24.11.2017 mantis 11353 +	
	//	Если Грузоотправитель <> Справочники.Scan_Контрагенты.СканияРусь Тогда
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Поле  = "Грузоотправитель";
	//		Сообщение.Текст = "Грузоотправитель не Скания-Русь!";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	////rarus tenkam 14.08.2017 mantis 9319 ---
	// rarus tenkam 28.03.2019 mantis 14260 ---
	
	
	//// ХРАНИТЕЛЬ
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Хранитель) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "Хранитель";
			Сообщение.Текст = "Поле ""Хранитель 2"" не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	//// ПОДРЯДЧИК и ДОГОВОР С ПОДРЯДЧИКОМ
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Подрядчик) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "Подрядчик";
			Сообщение.Текст = "Поле ""Поставщик услуг"" не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДоговорСПоставщиком) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "ДоговорСПоставщиком";
			Сообщение.Текст = "Поле ""Договор с поставщиком"" не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	//// МЕСТО ДОСТАВКИ												
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
	//rarus tenkam 08.02.2017 mantis 8331 +++
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
	//rarus tenkam 08.02.2017 mantis 8331 ---
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение ИЛИ	//tenkam 16.01.2017 mantis 8172 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу ИЛИ	
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ	
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство ИЛИ	//tenkam 16.01.2017 mantis 8172 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу) Тогда	//tenkam 16.01.2017 mantis 8172 +	
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.МестоДоставки) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "МестоДоставки";
			Сообщение.Текст = "Поле ""Место доставки"" не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
			
		//rarus tenkam 08.02.2017 mantis 8331 +++
		Иначе
			Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение) И	//rarus tenkam 28.07.2017 mantis 10597 + 
				ЭтотОбъект.МестоДоставки.ТипСклада <> Перечисления.Scan_ТипыСклада.Хранение Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле  = "МестоДоставки";
				Сообщение.Текст = "В поле ""Место доставки"" должен быть указан склад с типом ""Хранение""!";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
				
			ИначеЕсли (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство  ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство) И	//rarus tenkam 28.07.2017 mantis 10597 +  
				ЭтотОбъект.МестоДоставки.ТипСклада <> Перечисления.Scan_ТипыСклада.Производство Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле  = "МестоДоставки";
				Сообщение.Текст = "В поле ""Место доставки"" должен быть указан склад с типом ""Производство""!";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			//rarus tenkam 04.04.2017 mantis 9116 +++
			ИначеЕсли (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) И 
				ЭтотОбъект.МестоДоставки.ТипСклада <> Перечисления.Scan_ТипыСклада.АдресДоставки Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле  = "МестоДоставки";
				Сообщение.Текст = "В поле ""Место доставки"" должен быть указан склад с типом ""Адрес доставки""!";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
				//rarus tenkam 04.04.2017 mantis 9116 ---
			КонецЕсли;
			
		//rarus tenkam 08.02.2017 mantis 8331 ---
		КонецЕсли;
	КонецЕсли;
	
	//// ДАТА ДОСТАВКИ (ПЛАНОВАЯ)
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
	//rarus tenkam 08.02.2017 mantis 8331 +++
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
	//rarus tenkam 08.02.2017 mantis 8331 ---
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаДоставкиПлановая) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "ДатаДоставкиПлановая";
			//rarus FominskiyAS 08.07.2019  mantis 14191 +++
			//Сообщение.Текст = "Поле ""Дата доставки (плановая)"" не заполнено";
			Сообщение.Текст = НСтр("ru = 'Поле ""Дата доставки (плановая)"" не заполнено'; en = 'Field """" delivery date (plan) """" not filled'");
			//rarus FominskiyAS 08.07.2019  mantis 14191 ---  
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//// ГРУЗОПОЛУЧАТЕЛЬ											
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
	//rarus tenkam 08.02.2017 mantis 8331 +++
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
	//rarus tenkam 08.02.2017 mantis 8331 ---
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ 		//rarus tenkam 14.08.2017 mantis 9319 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +		
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Грузополучатель) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "Грузополучатель";
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "Поле ""Грузополучатель"" не заполнено";
			Сообщение.Текст = НСтр("ru = 'Поле ""Грузополучатель"" не заполнено'; en = 'Field "" consignee"" not filled'");
			//rarus FominskiyAS 24.04.2019  mantis 14191 ---
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//// ДОГОВОР											
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
	//rarus tenkam 08.02.2017 mantis 8331 +++
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
	//rarus tenkam 08.02.2017 mantis 8331 ---
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ 		//rarus tenkam 14.08.2017 mantis 9319 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +  		
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "Договор";
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "Поле ""Договор"" не заполнено";
			Сообщение.Текст = НСтр("ru = 'Поле ""Договор"" не заполнено'; en = 'Field ""Agreement"" not filled'");
			//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	//// ДАТА ВЫКУПА
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ		
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу) Тогда
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение Тогда
			ЗаголовокПоля  = "Дата выкупа и постановки на хранение";
		Иначе
			ЗаголовокПоля  = "Дата выкупа";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаВыкупа) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "ДатаВыкупа";
			Сообщение.Текст = "Поле """ + ЗаголовокПоля + """ не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	////ДАТА ПРОДАЖИ
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь ИЛИ 		//rarus tenkam 14.08.2017 mantis 9319 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК ИЛИ 		//rarus tenkam 26.09.2017 mantis 10742 +
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаПродажи) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "ДатаПродажи";
			Сообщение.Текст = "Поле ""ДатаПродажи"" не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

    //// ДАТА И ВРЕМЯ ПОРУЧЕНИЯ
	//Видимость
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу) Тогда
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение Тогда
			ЗаголовокПоля = "Дата постановки на хранение";
		ИначеЕсли ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу ИЛИ 
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК ИЛИ
				ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство Тогда
			ЗаголовокПоля = "Дата снятия с хранения";
		ИначеЕсли ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу Тогда 
			ЗаголовокПоля = "Дата снятия с хранения и передачи на хранение 3-му лицу";
		ИначеЕсли ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу Тогда 
			ЗаголовокПоля = "Дата передачи на хранение 3-му лицу";
		Иначе
			ЗаголовокПоля = "Дата поручения";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаИВремяПоручения) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "ДатаИВремяПоручения";
			Сообщение.Текст = "Поле """ + ЗаголовокПоля + """ не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
			
	//// ДАТА ПЕРЕДАЧИ В ПРОИЗВОДСТВО
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ
	ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство) Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаПередачиВПроизводство) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "ДатаПередачиВПроизводство";
			Сообщение.Текст = "Поле ""ДатаПередачиВПроизводство"" не заполнено";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Дальше перенесла кусок из проверки "при записи"
	Отказ = (Отказ ИЛИ ПроверитьЛогикуЗаполненияВЗависимостиОтХозОперации());
	Если НЕ Отказ Тогда
	    Отказ = ПроверитьДоговора();
	КонецЕсли;
	Если НЕ Отказ Тогда 
		Отказ = ПроверитьТабличнуюЧастьПродуктыПоЗаявке();
	КонецЕсли;
		
	//rarus BProg_Dekin 12.11.2019 0014452 ++ "ОдобреноПолучениеПродукта" удален
	//Если НЕ Отказ Тогда
	//	Если Scan_ПраваИНастройки.Scan_Право("ВыполнятьПроверкуНаличияОдобренияНаПолучениеПродукта") И  
	//		(ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
	//		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу ИЛИ
	//		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
	//		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение) 
	//	Тогда
	//		Для каждого строкаТЧ Из ПродуктыПоЗаявке Цикл
	//			// rarus tenkam 12.08.2019 mantis 14427 +++
	//			//Если НЕ строкаТЧ.Продукт.ЗаказНаЗавод.ОдобреноПолучениеПродукта Тогда
	//			//	Сообщить("Внимание! У Изделия № " + строкаТЧ.Продукт.Изделие.НомерИзделия +" в заказе не установлен признак ""одобрено получение продукта"". Дальнейшие действия с изделием запрещены");
	//			Если ЗначениеЗаполнено(строкаТЧ.Изделие.ЗаказНаЗавод) И НЕ строкаТЧ.Изделие.ЗаказНаЗавод.ОдобреноПолучениеПродукта Тогда
	//				Сообщить("Внимание! У Изделия № " + строкаТЧ.Изделие.НомерИзделия +" в заказе не установлен признак ""одобрено получение продукта"". Дальнейшие действия с изделием запрещены");
	//			// rarus tenkam 12.08.2019 mantis 14427 --
	//				Отказ = Истина;	
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли; 
	//КонецЕсли; 	
	//rarus BProg_Dekin 12.11.2019 0014452 --
	//rarus tenkam 26.12.2016 mantis 7609 --
	
	//rarus tenkam 24.01.2017 mantis 8172 +++
	Если ЗначениеЗаполнено(МестоПолучения) и ЗначениеЗаполнено(МестоДоставки) И
		МестоПолучения = МестоДоставки Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле  = "МестоДоставки";
		Сообщение.Текст = "Место получения и место доставки не должны совпадать!";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;		
	//rarus tenkam 24.01.2017 mantis 8172 ---
	
	//rarus tenkam 09.08.2017 mantis 10589 +++
	//// ПАКЕТ УСЛУГ
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
		//rarus tenkam 08.02.2017 mantis 8331 +++
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ   
		//rarus tenkam 08.02.2017 mantis 8331 ---
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК	ИЛИ		//rarus tenkam 26.09.2017 mantis 10742 +
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК) Тогда
		
		Если Scan_ПраваИНастройки.Scan_Право("ВключитьУчетОказанныхУслуг") И Scan_ПраваИНастройки.Scan_Право("ВыполнятьПроверкуЗаполненияОказанныхУслуг") И ПровереноАП Тогда
			Если НЕ ЗначениеЗаполнено(ПакетУслуг) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле  = "ПакетУслуг";
				Сообщение.Текст = "Пакет услуг не заполнен!";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказа = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	//rarus tenkam 09.08.2017 mantis 10589 ---
	                      		
	//rarus tenkam 08.02.2018 mantis 12721 +++
	//// ТРАНЗИТНОЕ ВРЕМЯ
	Если ЗначениеЗаполнено(МестоДоставки) И ЗначениеЗаполнено(МестоПолучения) И ЗначениеЗаполнено(СпособДоставки) Тогда
		ТранзитноеВремя = Справочники.Scan_МестаХранения.ПолучитьСрокДоставки(МестоПолучения.АдресСкладаЛогистический,МестоДоставки.АдресСкладаЛогистический,СпособДоставки); 
		Если ТранзитноеВремя = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "ДатаПолучения";
			Сообщение.Текст = "Транзитное время не задано. Обратитесь в отдел логистики!";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;			
	//rarus tenkam 08.02.2018 mantis 12721 ---
	
	// rarus tenkam 18.04.2018 mantis 12979 +++
	
	//// ПРОДУКТЫ ПО ЗАЯВКЕ
	ОтказНетИзделий = Ложь;
	Для Каждого ТекСтрока Из ПродуктыПоЗаявке Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Изделие) Тогда
			ОтказНетИзделий = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ОтказНетИзделий Тогда
		Сообщить("Проведение документа невозможно в связи с отсутствием продукта в системе. Запишите заявку и вернитесь к ее оформлению позже.");
		Отказ = Истина;
	КонецЕсли;
	// rarus tenkam 18.04.2018 mantis 12979 ---
	
	// Rarus tenkam 14.12.2021 mantis 18574 +++
	Если (ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство ИЛИ
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ  
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство) Тогда
		
		// Контрагент должен быть в списке кузовостроителей продукта
		ТекКонтрагент = ?(ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство, Грузополучатель, Подрядчик);
		
		Для Индекс = 0 по ПродуктыПоЗаявке.Количество()-1 Цикл
			ТекСтрока = ПродуктыПоЗаявке.Получить(Индекс);
			
			ТекИзделие = ТекСтрока.Изделие;
			ТекЗаказНаЗавод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекИзделие, "ЗаказНаЗавод");
			
			ПараметрыОтбора = Новый Структура("Кузовщик", ТекКонтрагент);
			МассивНайденных = ТекЗаказНаЗавод.ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора);	
			
			Если МассивНайденных.Количество() = 0 Тогда
				Сообщение = Новый СообщениеПользователю();                            
				Сообщение.Текст = "В строке " + (Индекс+1) + " грузополучатель не соответствует контрагенту заказа - кузовостроителю.";
				Сообщение.Поле = "ПродуктыПоЗаявке[" + Индекс + "].Изделие";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;	
			КонецЕсли;		
		КонецЦикла; 	
		
		// Место доставки должно быть в списке мест договора подряда
		ТекДоговор = ?(ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство, Договор, ДоговорСПоставщиком);
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДоговор, "ВидДоговора");
		Если ВидДоговора = ПредопределенноеЗначение("Перечисление.Scan_ВидыДоговоров.Подряда") Тогда
			ПараметрыОтбора = Новый Структура("МестоХранения", МестоДоставки);
			МассивНайденных = ТекДоговор.МестаХранения.НайтиСтроки(ПараметрыОтбора);	
			Если МассивНайденных.Количество() = 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Поле  = "МестоДоставки";
				Сообщение.Текст = "Место доставки не соответствует контрагенту.";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	// Rarus tenkam 14.12.2021 mantis 18574 ---
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования) //rarus tenkam mantis 7750 ++
	Если ОбъектКопирования.Сторнирован Тогда
		Сторнирован = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ) //rarus tenkam 26.04.2017 mantis 9444+++
	
	// раскомментировано по mantis 11216 
	//22.08.2017
	Если НЕ Отказ И АвтоматическиОтправлятьПФ И ХозОперация <> Справочники.Scan_ХозяйственныеОперации.Доставка Тогда
		СообщениеОтправки = "";
		ВсеОк = Ложь;
		Scan_ОтправкаПисемПоЭлектроннойПочте.ОтправитьПФЗаявки(Ссылка, СообщениеОтправки, ВсеОк); //rarus BProg_Gladkov 02.05.2020 0015962 +- Перемещена в Scan_ОтправкаПисемПоЭлектроннойПочте	
		Если ЗначениеЗаполнено(СообщениеОтправки) Тогда		//rarus tenkam 15.08.2017 mantis 9319 +
			Сообщить(СообщениеОтправки);
		КонецЕсли;
		//05.05.2017 +++
		Если ВсеОк Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПоменятьСтатус", ИСТИНА);
		КонецЕсли;
		//05.05.2017 ---
	КонецЕсли;     	
	
	//rarus tenkam 23.11.2017 mantis 11774 +++
	Если НЕ Отказ И ПроверитьДатуПередачиДилеру = Истина Тогда
		Для Каждого ТекСтрока Из ПродуктыПоЗаявке Цикл
			// rarus tenkam 12.08.2019 mantis 14427 +++
			//Scan_ВспомогательныеФункцииСервер.УстановитьДатуПередачиДилеру(ТекСтрока.Продукт);
			Scan_ВспомогательныеФункцииСервер.УстановитьДатуПередачиДилеру(ТекСтрока.Изделие);
			// rarus tenkam 12.08.2019 mantis 14427 ---
		КонецЦикла;
		Scan_ВспомогательныеФункцииСервер.УстановитьИсполнениеЗаявкиСПродажей(Ссылка);
	КонецЕсли;
	//rarus tenkam 23.11.2017 mantis 11774 ---
	
КонецПроцедуры //rarus tenkam 26.04.2017 mantis 9444---

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//rarus sergei 21.11.2016 mantis 7121 ++
Функция ПроверитьДоговора()
	// rarus kabany 26.05.2021 17790 +++
	// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» получим дату первичного договора
	Если ЗначениеЗаполнено(ЭтотОбъект.Договор) И (ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Соглашение 
		ИЛИ ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.ДопСоглашениеКСОП) Тогда	
		дПервогоДоговора = Scan_ВспомогательныеФункцииСервер.ПолучитьДатуНачалаПервогоДоговора(ЭтотОбъект.Договор);
	Иначе
		дПервогоДоговора = ЭтотОбъект.Договор.ДатаНачала; 	
	КонецЕсли;
	// rarus kabany 26.05.2021 17790 ---
	//проверку будем осуществлять в разрезе хоз операций
	Если ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ 
		//rarus tenkam 08.02.2017 mantis 8331 +++
		 ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
		 ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство Тогда   
		//rarus tenkam 08.02.2017 mantis 8331 ---
		Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.Договор.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.Договор.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.Договор.Бессрочный = Истина Тогда
			// rarus kabany 26.05.2021 17790 +++
			// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» проверяем дату первичного договора					
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
				Возврат Истина;
			КонецЕсли;
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала Тогда
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		Иначе
			// rarus kabany 26.05.2021 17790 +++	
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
				И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания)) Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;		
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
			//	И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда //rarus bonmak 05.04.2021 17514
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 --	
		КонецЕсли;	
			
	//Передача в производство	
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство Тогда
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата передачи в производство меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаПередачиВПроизводство > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + "  с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
		//договор подряда с поставщиком
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорПодряда = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорПодряда(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорПодряда = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорПодряда(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорПодряда.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ДоговорПодряда.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата передачи в производство меньше даты начала действия договора подряда № "+ ДоговорПодряда.НомерДоговора +" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ДоговорПодряда.ДатаНачала ИЛИ ЭтотОбъект.ДатаПередачиВПроизводство > ДоговорПодряда.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора подряда № "+ ДоговорПодряда.НомерДоговора +" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		//Покупка у поставщика и передача на хранение 3-му лицу	
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаНаХранениеТретьемуЛицу Тогда
		
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата выкупа меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаВыкупа > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + "  с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		// Договор хранения с хранителем 2	
		Если  ТипЗнч(ЭтотОбъект.Хранитель)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Хранитель);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Хранитель.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаВыкупа < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата выкупа меньше даты начала действия договора хранения с хранителем 2!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаВыкупа < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаВыкупа > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора  " + НРег(Строка(ДоговорХранения.ВидДоговора)) + " " + ДоговорХранения.Наименование + "  с хранителем 2!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		//Покупка у поставщика и передача ТК
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК Тогда
		//Договор с грузополучателем
		Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.Договор.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.Договор.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.Договор.Бессрочный = Истина Тогда
			// rarus kabany 26.05.2021 17790 +++
			// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» проверяем дату первичного договора
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
				Возврат Истина;
			КонецЕсли;		
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала Тогда
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		Иначе
			// rarus kabany 26.05.2021 17790 +++					
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
				И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))  Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;						
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
			//	И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда //rarus bonmak 05.04.2021 17514
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		КонецЕсли;
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + "  с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;

	//Покупка у поставщика и продажа 3-му лицу
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу Тогда
		//Договор с грузополучателем
		Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.Договор.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.Договор.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.Договор.Бессрочный = Истина Тогда
			// rarus kabany 26.05.2021 17790 +++
			// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» проверяем дату первичного договора					
			Если ЭтотОбъект.ДатаВыкупа < дПервогоДоговора Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата выкупа меньше даты начала действия договора с грузополучателем!");
				Возврат Истина;
			КонецЕсли;		
			//Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.Договор.ДатаНачала Тогда
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата выкупа меньше даты начала действия договора с грузополучателем!");
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		Иначе
			// rarus kabany 26.05.2021 17790 +++					
			Если ЭтотОбъект.ДатаВыкупа < дПервогоДоговора ИЛИ (ЭтотОбъект.ДатаВыкупа > ЭтотОбъект.Договор.ДатаОкончания 
				И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания)) Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!");
				Возврат Истина;
			КонецЕсли;					
			//Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.Договор.ДатаНачала ИЛИ (ЭтотОбъект.ДатаВыкупа > ЭтотОбъект.Договор.ДатаОкончания 
			//	И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда //rarus bonmak 05.04.2021 17514
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		КонецЕсли;
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата выкупа меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаВыкупа > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + "  с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	//Покупка у поставщика с постановкой на хранение
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаСПостановкойНаХранение Тогда
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата выкупа и постановки на хранение меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаВыкупа < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаВыкупа > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + "  с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;		
	    // Договор хранения с поставщиком услуг	
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаВыкупа < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата выкупа и постановки на хранение меньше даты начала действия договора хранения с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаВыкупа < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаВыкупа > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорХранения.ВидДоговора)) + " " + ДоговорХранения.Наименование + "  с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
	//Покупка у поставщика, продажа 3-му лицу и передача ТК
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК Тогда
		//Договор с грузополучателем
		Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.Договор.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.Договор.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.Договор.Бессрочный = Истина Тогда
			// rarus kabany 26.05.2021 17790 +++
			// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» проверяем дату первичного договора					
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
				Возврат Истина;
			КонецЕсли;						
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала Тогда
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		Иначе
			// rarus kabany 26.05.2021 17790 +++					
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
				И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания)) Тогда 
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;						
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
			//	И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда //rarus bonmak 05.04.2021 17514
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		КонецЕсли;	
		
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + " с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	//Постановка на хранение
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПостановкаНаХранение Тогда
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаИВремяПоручения < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата постановки на хранение меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаИВремяПоручения < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаИВремяПоручения > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + " с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
		
		// Договор хранения с поставщиком услуг	
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаИВремяПоручения < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата постановки на хранение меньше даты начала действия договора хранения с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаИВремяПоручения < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаИВремяПоручения > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорХранения.ВидДоговора)) + " " + ДоговорХранения.Наименование + " с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;

	//Снятие с хранения и передача в производство
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство Тогда
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата передачи в производство меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаПередачиВПроизводство > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + " с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
		//договор подряда с поставщиком
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорПодряда = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорПодряда(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорПодряда = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорПодряда(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорПодряда.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ДоговорПодряда.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата передачи в производство меньше даты начала действия договора подряда № "+ ДоговорПодряда.НомерДоговора +" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаПередачиВПроизводство < ДоговорПодряда.ДатаНачала ИЛИ ЭтотОбъект.ДатаПередачиВПроизводство > ДоговорПодряда.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора подряда № "+ ДоговорПодряда.НомерДоговора +" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
	//Снятие с хранения и передача на хранение 3-му лицу
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаНаХранениеТретьемуЛицу Тогда
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаИВремяПоручения < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата снятия с хранения и передачи на хранение 3-му лицу меньше даты начала действия договора № " +ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора +" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаИВремяПоручения < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаИВремяПоручения > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора № "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		// Договор хранения с поставщиком услуг	
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаИВремяПоручения < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата снятия с хранения и передачи на хранение 3-му лицу меньше даты начала действия договора хранения № " +ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаИВремяПоручения < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаИВремяПоручения > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора хранения № "+ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		// Договор хранения с хранителем 2	
		Если  ТипЗнч(ЭтотОбъект.Хранитель)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Хранитель);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Хранитель.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаИВремяПоручения < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата снятия с хранения и передачи на хранение 3-му лицу меньше даты начала действия договора хранения № "+ДоговорХранения.НомерДоговора+" с хранителем 2!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаИВремяПоручения < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаИВремяПоручения > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора хранения № "+ДоговорХранения.НомерДоговора+" с хранителем 2!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
	//Снятие с хранения и передача ТК
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК Тогда
		//Договор с грузополучателем
		Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.Договор.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.Договор.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.Договор.Бессрочный = Истина Тогда
			// rarus kabany 26.05.2021 17790 +++
			// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» проверяем дату первичного договора					
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
				Возврат Истина;
			КонецЕсли;						
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала Тогда
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		Иначе
			// rarus kabany 26.05.2021 17790 +++					
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
				И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;		
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
			//	И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда //rarus bonmak 05.04.2021 17514
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		КонецЕсли;
		
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + " с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		// Договор хранения с поставщиком услуг	
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаДоставкиПлановая < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора хранения № " +ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаДоставкиПлановая < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаДоставкиПлановая > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора хранения № "+ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
	//Снятие с хранения и продажа 3-му лицу
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу Тогда
		//Договор с грузополучателем
		Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.Договор.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.Договор.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.Договор.Бессрочный = Истина Тогда
			// rarus kabany 26.05.2021 17790 +++
			// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» проверяем дату первичного договора					
			Если ЭтотОбъект.ДатаПродажи < дПервогоДоговора Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата продажи меньше даты начала действия договора с грузополучателем!");
				Возврат Истина;
			КонецЕсли;						
			//Если ЭтотОбъект.ДатаПродажи < ЭтотОбъект.Договор.ДатаНачала Тогда
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата продажи меньше даты начала действия договора с грузополучателем!");
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		Иначе
			// rarus kabany 26.05.2021 17790 +++				
			Если ЭтотОбъект.ДатаПродажи < дПервогоДоговора ИЛИ (ЭтотОбъект.ДатаПродажи > ЭтотОбъект.Договор.ДатаОкончания 
				И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;						
			//Если ЭтотОбъект.ДатаПродажи < ЭтотОбъект.Договор.ДатаНачала ИЛИ (ЭтотОбъект.ДатаПродажи > ЭтотОбъект.Договор.ДатаОкончания 
			//	И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда //rarus bonmak 05.04.2021 17514
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		КонецЕсли;
		
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаПродажи < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата продажи меньше даты начала действия договора № " +ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаПродажи < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаПродажи > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + " с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		// Договор хранения с поставщиком услуг	
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаПродажи < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата продажи меньше даты начала действия договора хранения № " +ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаПродажи < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаПродажи > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора хранения № "+ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
	//Снятие с хранения, продажа 3-му лицу и передача ТК
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК Тогда
		//Договор с грузополучателем
		Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.Договор.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.Договор.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.Договор.Бессрочный = Истина Тогда
			// rarus kabany 26.05.2021 17790 +++
			// для видов договора «Соглашение о поставке» или «Доп. соглашение о поставке» проверяем дату первичного договора					
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
				Возврат Истина;
			КонецЕсли;		
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала Тогда
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора с грузополучателем!");
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		Иначе
			// rarus kabany 26.05.2021 17790 +++				
			Если ЭтотОбъект.ДатаДоставкиПлановая < дПервогоДоговора ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
				И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания)) Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;		
			//Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.Договор.ДатаНачала ИЛИ (ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.Договор.ДатаОкончания 
			//	И ЗначениеЗаполнено(ЭтотОбъект.Договор.ДатаОкончания))Тогда //rarus bonmak 05.04.2021 17514
			//	Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(Договор.ВидДоговора)) + " " + Договор.Наименование + " с грузополучателем!"); //rarus abrant 03.07.2017 mantis 9424 +
			//	Возврат Истина;
			//КонецЕсли;
			// rarus kabany 26.05.2021 17790 ---
		КонецЕсли;
		
		//Договор с поставщиком услуг
		Если ЭтотОбъект.ДоговорСПоставщиком.ВидДоговора = Перечисления.Scan_ВидыДоговоров.Хранения И ЭтотОбъект.ДоговорСПоставщиком.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ЭтотОбъект.ДоговорСПоставщиком.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора № " +ЭтотОбъект.ДоговорСПоставщиком.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаДоставкиПлановая < ЭтотОбъект.ДоговорСПоставщиком.ДатаНачала ИЛИ ЭтотОбъект.ДатаДоставкиПлановая > ЭтотОбъект.ДоговорСПоставщиком.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора " + НРег(Строка(ДоговорСПоставщиком.ВидДоговора)) + " " + ДоговорСПоставщиком.Наименование + " с поставщиком услуг!"); //rarus abrant 03.07.2017 mantis 9424 +
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
		
		// Договор хранения с поставщиком услуг	
		Если  ТипЗнч(ЭтотОбъект.Подрядчик)= Тип("СправочникСсылка.Scan_Контрагенты") Тогда
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик);
		Иначе
			ДоговорХранения = Справочники.Scan_ДоговорыВзаиморасчетов.ПолучитьДоговорХранения(ЭтотОбъект.Подрядчик.Контрагент);
		КонецЕсли;
		Если ДоговорХранения.МестаХранения.Количество() = 0 Тогда
			Сообщить("Внимание! Документ "+ЭтотОбъект.Ссылка +" не проведен. У договора "+ДоговорХранения.НомерДоговора+" не указаны места хранения! Для договора с видом ""хранение"" обязательно должны быть указаны места хранения");
			Возврат Истина;
		КонецЕсли; 
		Если ДоговорХранения.Бессрочный = Истина Тогда
			Если ЭтотОбъект.ДатаДоставкиПлановая < ДоговорХранения.ДатаНачала Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка+ " не проведен. Дата доставки меньше даты начала действия договора хранения № " +ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли; 
		Иначе
			Если ЭтотОбъект.ДатаДоставкиПлановая < ДоговорХранения.ДатаНачала ИЛИ ЭтотОбъект.ДатаДоставкиПлановая > ДоговорХранения.ДатаОкончания Тогда
				Сообщить("Документ "+ ЭтотОбъект.Ссылка +" не проведен. Проверьте сроки действия договора хранения № "+ДоговорХранения.НомерДоговора+" с поставщиком услуг!");
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;
КонецФункции
//rarus sergei 21.11.2016 mantis 7121 --

//rarus sergei 07.10.2016 mantis 7609 ++
Функция ПроверитьЛогикуЗаполненияВЗависимостиОтХозОперации()
	Если ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ
		//rarus tenkam 08.02.2017 mantis 8331 +++
		 ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
		 ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство Тогда   
		//rarus tenkam 08.02.2017 mantis 8331 ---
		Если ЭтотОбъект.ДатаПолучения >= ЭтотОбъект.ДатаДоставкиПлановая Тогда
			Сообщить("Дата  и  время доставки не должно совпадать с датой и временем получения");	
			Возврат Истина;
		КонецЕсли; 
		
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК 
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК 
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК 
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК Тогда
		Если ЭтотОбъект.ДатаПолучения >= ЭтотОбъект.ДатаДоставкиПлановая Тогда
			Сообщить("Дата и время доставки не должно совпадать, или быть меньше даты и времени получения");	
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	ТранзитноеВремя = Справочники.Scan_МестаХранения.ПолучитьСрокДоставки(ЭтотОбъект.МестоПолучения.АдресСкладаЛогистический,ЭтотОбъект.МестоДоставки.АдресСкладаЛогистический,ЭтотОбъект.СпособДоставки);
	Если ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка 
		//rarus tenkam 08.02.2017 mantis 8331 +++
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение   
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство    
		//rarus tenkam 08.02.2017 mantis 8331 ---
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК Тогда
		МинимальнаяДатаПолучения = ЭтотОбъект.ДатаДоставкиПлановая - 24*60*60*ТранзитноеВремя;
		Если МинимальнаяДатаПолучения< ЭтотОбъект.ДатаПолучения ТОгда
			Если ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ 
				//rarus tenkam 08.02.2017 mantis 8331 +++
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ  
				ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство Тогда   
				//rarus tenkam 08.02.2017 mantis 8331 ---
				Сообщить("Указанная дата получения больше допустимой(дата доставки минус транзитное время)");
				Возврат Истина;
			ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК Тогда
				Сообщить("Указанная дата снятия с хранения больше допустимой(дата доставки минус транзитное время)");
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК 
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК 
		ИЛИ ЭтотОбъект.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК Тогда
		МинимальнаяДатаДоставки = ЭтотОбъект.ДатаПолучения + 24*60*60*ТранзитноеВремя;   
		Если МинимальнаяДатаДоставки> ЭтотОбъект.ДатаДоставкиПлановая Тогда
			Сообщить("Указанная дата доставки меньше допустимой(дата получения плюс транзитное время)");
			Возврат Истина;
		КонецЕсли;
	
	 
		
	КонецЕсли;
	Возврат ЛОжь;
КонецФункции
//rarus sergei 07.10.2016 mantis 7609 --

//rarus tenkam 26.12.2016 mantis 7609 --
Функция ПроверитьТабличнуюЧастьПродуктыПоЗаявке()	//rarus tenkam 26.12.2016 mantis 7609 + (убрала из аргумента режимзаписи)
	Для каждого строка Из ЭтотОбъект.ПродуктыПоЗаявке Цикл
		// rarus tenkam 12.08.2019 mantis 14427 +++
		//Если строка.Продукт = Справочники.Scan_Продукты.ПустаяСсылка() Тогда
		Если строка.Изделие = Справочники.Scan_Изделия.ПустаяСсылка() Тогда
		// rarus tenkam 12.08.2019 mantis 14427 ---
			Сообщение = Новый СообщениеПользователю;
			// rarus tenkam 12.08.2019 mantis 14427 +++
			//Сообщение.Поле  = "ПродуктыПоЗаявке[строка.НомерСтроки].Продукт";
			Сообщение.Поле  = "ПродуктыПоЗаявке[строка.НомерСтроки].Изделие";
			// rarus tenkam 12.08.2019 mantis 14427 ---
			Сообщение.Текст = "В табличной части ""Продукты по заявке"" есть пустая строка";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Возврат Истина;
		КонецЕсли;	
		//rarus sergei 01.09.2016 mantis 7122 ++ 
		//Если ЭтотОбъект.Корректировка = Ложь и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//	Запрос = Новый Запрос;
		//	Запрос.Текст ="ВЫБРАТЬ
		//	              |	Scan_ЗаявкаНаДействие.Ссылка
		//	              |ИЗ
		//	              |	Документ.Scan_ЗаявкаНаДействие КАК Scan_ЗаявкаНаДействие
		//	              |ГДЕ
		//	              |	Scan_ЗаявкаНаДействие.ПродуктыПоЗаявке.Продукт = &СсылкаПродукт
		//	              |	И Scan_ЗаявкаНаДействие.Проведен = ИСТИНА
		//	              |	И (Scan_ЗаявкаНаДействие.ДатаДоставкиПлановая = &ДатаДоставки
		//	              |				И Scan_ЗаявкаНаДействие.МестоДоставки = &МестоДоставки
		//	              |			ИЛИ Scan_ЗаявкаНаДействие.ДатаДоставкиПлановая = &ДатаДоставки
		//	              |				И Scan_ЗаявкаНаДействие.Грузополучатель = &Грузополучатель
		//	              |			ИЛИ Scan_ЗаявкаНаДействие.МестоДоставки = &МестоДоставки
		//	              |				И Scan_ЗаявкаНаДействие.Грузополучатель = &Грузополучатель)
		//	              |	И Scan_ЗаявкаНаДействие.Ссылка <> &ДокументСсылка";
		//	Запрос.УстановитьПараметр("СсылкаПродукт",строка.Продукт);
		//	Запрос.УстановитьПараметр("ДатаДоставки",ЭтотОбъект.ДатаДоставкиПлановая);
		//	Запрос.УстановитьПараметр("МестоДоставки",ЭтотОбъект.МестоДоставки);
		//	Запрос.УстановитьПараметр("Грузополучатель",ЭтотОбъект.Грузополучатель);
		//	Запрос.УстановитьПараметр("ДокументСсылка",Ссылка);


		//    Результат = Запрос.Выполнить();
		//	Если НЕ Результат.Пустой() Тогда
		//		ТаблицаРезультат = Результат.Выгрузить();	
		//		Сообщение = Новый СообщениеПользователю;
		//		Сообщение.Поле  = "ПродуктыПоЗаявке[строка.НомерСтроки].Продукт";
		//		Сообщение.Текст = "Нельзя провести документ. Так как Продукт "+строка.Продукт+" есть в табличной части Документа "+ТаблицаРезультат[0].Ссылка;
		//		Сообщение.УстановитьДанные(ЭтотОбъект);
		//		Сообщение.Сообщить();
		//	Возврат Истина;
		//		
		//	КонецЕсли;
		//КонецЕсли;
		//rarus sergei 01.09.2016 mantis 7122 --
	КонецЦикла; 
	Возврат Ложь;
КонецФункции

Функция ПолучитьЗаявкуПеревозчику(Изделие)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаПеревозчику
	               |ИЗ
	               |	РегистрСведений.Scan_КорректировкаИнформацииПоЗаявкам КАК Scan_КорректировкаИнформацииПоЗаявкам
	               |ГДЕ
	               |	Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаНаДействие = &СсылкаДокумент
	               |	И Scan_КорректировкаИнформацииПоЗаявкам.Изделие = &СсылкаИзделие
	               |	И Scan_КорректировкаИнформацииПоЗаявкам.ЗаявкаПеревозчику <> ЗНАЧЕНИЕ(Документ.Scan_ЗаявкаПеревозчику.ПустаяСсылка)";
	Запрос.УстановитьПараметр("СсылкаДокумент",Ссылка);
	Запрос.УстановитьПараметр("СсылкаИзделие",Изделие);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено
	Иначе
		ТЗ = Результат.Выгрузить();
		Возврат ТЗ[0].ЗаявкаПеревозчику;
	
	КонецЕсли; 
КонецФункции
	
Функция ПроверитьПоДокументамОснованиям()
	НетДокументаОснование = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ЗаявкаПеревозчикуДокументыОснования.Ссылка
	               |ИЗ
	               |	Документ.Scan_ЗаявкаПеревозчику.ДокументыОснования КАК Scan_ЗаявкаПеревозчикуДокументыОснования
	               |ГДЕ
	               |	Scan_ЗаявкаПеревозчикуДокументыОснования.Документ = &СсылкаДокумент";
	Запрос.УстановитьПараметр("СсылкаДокумент",Ссылка);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		               |	Scan_ЗаявкаНаДействие.Ссылка
		               |ИЗ
		               |	Документ.Scan_ЗаявкаНаДействие КАК Scan_ЗаявкаНаДействие
		               |ГДЕ
		               |	Scan_ЗаявкаНаДействие.ДокументОснование = &СсылкаДокумент";
	Запрос.УстановитьПараметр("СсылкаДокумент",Ссылка);
	Результат = Запрос.Выполнить();	
	Если НЕ Результат.Пустой() Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	Возврат Истина;	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ ПроверитьПоДокументамОснованиям() Тогда
		Сообщить("Нельзя пометить на удаление документ, являющийся основанием");
		Отказ = Истина;
		КонецЕсли;
КонецПроцедуры
 
// rarus tenkam 19.06.2019 mantis 12631 +++
Процедура ПроверитьУжеЕстьЗаявкаНаПродажу(Отказ, МассивИзделий, ДокументОснование)		//rarus tenkam 21.06.2019 mantis 14557 + (новый аргумент ДокументОснование)
	ТаблицаИзделиеЗаявка = Новый ТаблицаЗначений;
	ТаблицаИзделиеЗаявка.Колонки.Добавить("Изделие", Новый ОписаниеТипов("СправочникСсылка.Scan_Изделия"));
	ТаблицаИзделиеЗаявка.Колонки.Добавить("ЗаявкаНаПродажу", Новый ОписаниеТипов("ДокументСсылка.Scan_ЗаявкаНаДействие"));
	Для Каждого ТекСтрока Из МассивИзделий Цикл
		ЗаявкаНаПродажу = ПолучитьЗаявкуНаПродажу(ТекСтрока, ДокументОснование);	//rarus tenkam 21.06.2019 mantis 14557 + (новый аргумент ДокументОснование)
		Если ЗначениеЗаполнено(ЗаявкаНаПродажу) Тогда
			НоваяСтрока = ТаблицаИзделиеЗаявка.Добавить();
			НоваяСтрока.Изделие = ТекСтрока;
			НоваяСтрока.ЗаявкаНаПродажу = ЗаявкаНаПродажу;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаИзделиеЗаявка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаявки.Изделие КАК Изделие,
		|	ИзделияЗаявки.ЗаявкаНаПродажу КАК ЗаявкаНаПродажу
		|ПОМЕСТИТЬ ВремТаблица
		|ИЗ
		|	&ИзделияЗаявки КАК ИзделияЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремТаблица.Изделие КАК Изделие,
		|	ВремТаблица.ЗаявкаНаПродажу КАК ЗаявкаНаПродажу
		|ИЗ
		|	ВремТаблица КАК ВремТаблица
		|ИТОГИ ПО
		|	ЗаявкаНаПродажу";
	Запрос.УстановитьПараметр("ИзделияЗаявки", ТаблицаИзделиеЗаявка); 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаявкаНаПродажу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаявкаНаПродажу.Следующий() Цикл
		// Вставить обработку выборки ВыборкаЗаявкаНаПродажу
	
		ВыборкаДетальныеЗаписи = ВыборкаЗаявкаНаПродажу.Выбрать();
	    СообщениеОбОшибке = "Для шасси ";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СообщениеОбОшибке = СообщениеОбОшибке + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.Изделие,"НомерИзделия") + ", ";
		КонецЦикла;
		СообщениеОбОшибке = Лев(СообщениеОбОшибке, СтрДлина(СообщениеОбОшибке)-2) + " уже есть заявка на продажу №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаЗаявкаНаПродажу.ЗаявкаНаПродажу, "Номер");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, ВыборкаЗаявкаНаПродажу.ЗаявкаНаПродажу);
	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

Функция ПолучитьЗаявкуНаПродажу(ТекИзделие, ДокументОснование)	//rarus tenkam 21.06.2019 mantis 14557 + (новый аргумент ДокументОснование)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Scan_ЗаявкаНаДействие.ПродуктыПоЗаявке КАК Scan_ЗаявкаНаДействиеПродуктыПоЗаявке
		|ГДЕ
		|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Изделие = &ТекИзделие
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка <> &ДокументОснование		//rarus tenkam 21.06.2019 mantis 14557 + (новый аргумент ДокументОснование)
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Аннулирована)
		|	И Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.СтатусЗаявки <> ЗНАЧЕНИЕ(Справочник.Scan_СтатусыЗаявокНаДействие.Исполнена)
		|	И (Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.СнятиеСХраненияИПродажаТретьемуЛицу)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусь)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК)
		|			ИЛИ Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК))
		//rarus bonmak 16822 21.12.2020 ++
		|   УПОРЯДОЧИТЬ ПО
	    |   Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка.Дата УБЫВ";
		//rarus bonmak 16822 21.12.2020 --
	
		Запрос.УстановитьПараметр("ТекИзделие", ТекИзделие);
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			//rarus bonmak 16822 21.12.2020 ++
			ВернутьСсылкуДокумента = Истина;
			Если ТекИзделие.БУ Тогда
				ВернутьСсылкуДокумента = Ложь;
				фЗаказНаЗавод = ТекИзделие.ЗаказНаЗавод;
				ДатаПродажиВЗаявке = ВыборкаДетальныеЗаписи.Ссылка.ДатаПродажи;
				Если ЗначениеЗаполнено(ДатаПродажиВЗаявке) Тогда 					
					//Сначала проверяем повторную продажу БУ
					ОбъектКлючевойДаты = ТекИзделие; 
					ПеречислениеДата = Перечисления.Scan_КлючевыеДаты.ДатаПередачиБУИзделияДилеру;
					ПродолжитьПроверку = ПроверитьДатуВЗАявке(ОбъектКлючевойДаты, ПеречислениеДата, ДатаПродажиВЗаявке, ВернутьСсылкуДокумента, Истина);					
					Если ПродолжитьПроверку Тогда
						ПеречислениеДата = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУДилеру;
						ПродолжитьПроверку = ПроверитьДатуВЗАявке(ОбъектКлючевойДаты, ПеречислениеДата, ДатаПродажиВЗаявке, ВернутьСсылкуДокумента, Истина);						
						Если ПродолжитьПроверку Тогда
							ПеречислениеДата = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУКлиенту;
							ПродолжитьПроверку = ПроверитьДатуВЗАявке(ОбъектКлючевойДаты, ПеречислениеДата, ДатаПродажиВЗаявке, ВернутьСсылкуДокумента, Истина);	
							Если ПродолжитьПроверку Тогда
								//Проверяем продажу новой машины
								ОбъектКлючевойДаты = фЗаказНаЗавод; 
								ПеречислениеДата = Перечисления.Scan_КлючевыеДаты.ДатаПередачиИзделияДилеру;
								ПродолжитьПроверку = ПроверитьДатуВЗАявке(ОбъектКлючевойДаты, ПеречислениеДата, ДатаПродажиВЗаявке, ВернутьСсылкуДокумента);					
								Если ПродолжитьПроверку Тогда
									ПеречислениеДата = Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия;
									ПродолжитьПроверку = ПроверитьДатуВЗАявке(ОбъектКлючевойДаты, ПеречислениеДата, ДатаПродажиВЗаявке, ВернутьСсылкуДокумента);						
									Если ПродолжитьПроверку Тогда
										ПеречислениеДата = Перечисления.Scan_КлючевыеДаты.ДатаПродажиКлиенту;
										ПродолжитьПроверку = ПроверитьДатуВЗАявке(ОбъектКлючевойДаты, ПеречислениеДата, ДатаПродажиВЗаявке, ВернутьСсылкуДокумента);	
										Если ПродолжитьПроверку Тогда
											ВернутьСсылкуДокумента = Истина;
										КонецЕсли;
									КонецЕсли; 
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли; 
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			//rarus bonmak 16822 21.12.2020 --
			Если ВернутьСсылкуДокумента Тогда //rarus bonmak 16822 21.12.2020 добавил условие и отработку ложь
				Возврат ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЕсли;
			
		Возврат ПредопределенноеЗначение("Документ.Scan_ЗаявкаНаДействие.ПустаяСсылка");	
	КонецФункции
// rarus tenkam 19.06.2019 mantis 12631 ---

Функция ПроверитьДатуВЗАявке(ОбъектКлючевойДаты, ПеречислениеДата, ДатаПродажиВЗаявке, ВернутьСсылкуДокумента, ПроверкаБуДат = Ложь) //rarus bonmak 16822 21.12.2020 ++
	ПродолжитьПроверку = Истина;
	
	СтруктураОтбора   = Новый Структура("Объект,ОбъектКлючевойДаты,ВидКлючевойДаты", ОбъектКлючевойДаты, Перечисления.Scan_КлючевыеДаты.ПолучитьОбъектКлючевойДатыПоПеречислению(ПеречислениеДата), ПеречислениеДата);
	СтруктураСведений = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведенияСПериодом(ТекущаяДата(), СтруктураОтбора);
	фКлючеваяДата   = СтруктураСведений.Значение;
	ДатаЗаписи        = СтруктураСведений.Период;
	Если ПроверкаБуДат Тогда
		Если фКлючеваяДата = Дата(1,1,1) Тогда
			СтруктураСведений = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведенияСПериодом(ДатаЗаписи - 1, СтруктураОтбора);
			фКлючеваяДата    = СтруктураСведений.Значение;									
		КонецЕсли;
	КонецЕсли;
	
	Если фКлючеваяДата <> Дата(1,1,1) Тогда 
		Если ДатаПродажиВЗаявке >= фКлючеваяДата Тогда
			ВернутьСсылкуДокумента = Истина;
		КонецЕсли;
		ПродолжитьПроверку = Ложь;
	КонецЕсли;
	
	Возврат ПродолжитьПроверку; 
КонецФункции //rarus bonmak 16822 21.12.2020 --

#КонецОбласти

