//rarus bonmak 15.08.2019 14576 ++

// Функция записи параметров в регистр сведений
// Параметры
//  ТекСсылка    – СправочникСсылка.Scan_ЗаказыНаЗавод – Заказ на завод,  СправочникСсылка.Scan_Изделия - Изделия
//  ВидЗапроса   – ПеречислениеСсылка.Scan_ВидыЗапроса
//  Реквизит     – строка, наименование реквизита
//  Значение     - булево, Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод, число, строка, дата
// Возвращаемое значение:
//   Булево      – ошибка записи значения
Процедура ЗаписьЗначенияРегистраСведения(ТекСсылка, ВидЗапроса, Реквизит, Значение, НаДату = Неопределено, Пользователь = Неопределено) Экспорт		
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(ТекСсылка) Тогда
		Возврат;
	КонецЕсли;
	//rarus bonmak 21.08.2020 16210 ++
	//фВидЗапроса = Метаданные.Перечисления.Scan_ВидыЗапроса.ЗначенияПеречисления[Перечисления.Scan_ВидыЗапроса.Индекс(ВидЗапроса)].Имя; 
	фВидЗапроса = ВидЗапроса.ИмяПредопределенныхДанных;
	//rarus bonmak 21.08.2020 16210 --
	Если ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetOrderToDelivery Тогда //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник 
		Если НЕ Scan_ПраваИНастройки.Scan_Право("РазрешитьОтправкуЛокальныхСтатусовЗаказовНаЗаводВ1БД") Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
		
	Если ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetProduct ИЛИ	//rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetAdditionalProperty Тогда	// rarus tenkam 29.04.2021 mantis 17659 + 
		
		// rarus vikhle 01.03.2022 m 18879 +++
		//Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystemProduct) Тогда
		//	Возврат;	
		//КонецЕсли;
		//IDExternalSystem = ТекСсылка.IDExternalSystemProduct;
		
		Если ТипЗнч(ТекСсылка) = Тип("СправочникСсылка.Scan_Изделия") Тогда
			Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystemProduct) Тогда
				Возврат;	
			Иначе
				IDExternalSystem = ТекСсылка.IDExternalSystemProduct;	
			КонецЕсли;
		Иначе
			IDExternalSystem = ТекСсылка.IDExternalSystem; 	
		КонецЕсли;
		// rarus vikhle 01.03.2022 m 18879 ---
		
	ИначеЕсли ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetLocation Тогда //rarus bonmak 02.12.2019 14375 ++ //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		//Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystemProduct) Тогда
		//	Возврат;	
		//КонецЕсли;
		IDExternalSystem = ТекСсылка.IDExternalSystem;
		//rarus bonmak 02.12.2019 14375 --
	ИначеЕсли ВидЗапроса = Справочники.Scan_ВидыЗапроса.CreateProduct ИЛИ	//rarus bonmak 18.05.2020 14375 ++ //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		ВидЗапроса = Справочники.Scan_ВидыЗапроса.CreateSOP Тогда 
		IDExternalSystem = "";
		//rarus bonmak 18.05.2020 14375 --
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystem) Тогда
			Возврат;	
		КонецЕсли;
		IDExternalSystem = ТекСсылка.IDExternalSystem;
	КонецЕсли;
		
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли; 
	
	Если Пользователь = Неопределено Тогда
		ТекПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Иначе
		ТекПользователь = Пользователь;
	КонецЕсли;
	//Получим текст запроса
	
	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + фВидЗапроса;	
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(фВидЗапроса ,Ложь);
	Если ВидЗапроса <> Справочники.Scan_ВидыЗапроса.CreateProduct Тогда //rarus bonmak 18.05.2020 14375 добавил условие //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		СтруктураПараметров.Вставить("GUID", IDExternalSystem);
	КонецЕсли;
		
	// rarus tenkam 12.11.2020 mantis 16181 +++
	Если ВидЗапроса = Справочники.Scan_ВидыЗапроса.CreateSOP ИЛИ
		 ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetSOP Тогда
		СтруктураПараметров = Scan_ВебСервисыРазборОтветов.СОППолучитьСтруктуруДанныхДляОтправкив1БД(ТекСсылка, , фВидЗапроса);
	КонецЕсли;
	// rarus tenkam 12.11.2020 mantis 16181 ---
	
	СтруктураПараметров.Вставить(Реквизит, Значение);

	//просто формируем сообщение для записи в регистр, при отправке будет формироваться повторно
	ТекстЗапроса = Scan_ВебСервисы.СформироватьСообщениеОбмена(фВидЗапроса, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	
	ЗаписьРегСведений = РегистрыСведений.Scan_Обмен1БДОчередьПоОтправкеРеквизитов.СоздатьМенеджерЗаписи();
	ЗаписьРегСведений.ВидЗапроса	= ВидЗапроса;
	ЗаписьРегСведений.Объект		= ТекСсылка;
	ЗаписьРегСведений.Реквизит 		= Реквизит;	
	ЗаписьРегСведений.Прочитать(); 
	
	ЗаписьРегСведений.ВидЗапроса	= ВидЗапроса;
	ЗаписьРегСведений.Объект		= ТекСсылка;
	ЗаписьРегСведений.Реквизит 		= Реквизит;
	ЗаписьРегСведений.Значение    	= Значение;	
	ЗаписьРегСведений.ТекстЗапроса  = ТекстЗапроса;	
	ЗаписьРегСведений.Пользователь 	= ТекПользователь;
	ЗаписьРегСведений.ДатаИзменения = ДатаЗаписи;

	Попытка
		ЗаписьРегСведений.Записать();				
	Исключение
		ТекстСообщения = Нстр("ru = 'Ошибка записи реквизита <'; en = 'Error recording props  <'") + Реквизит + Нстр("ru = '> для отправки в 1БД: '; en = '> to send to 1DB: '") + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		ЗаписьЖурналаРегистрации("Регистр сведений. Очередь по отправке реквизитов в 1БД (scania)", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		Отказ = Истина;
	КонецПопытки; 
	
	Возврат;
КонецПроцедуры // ЗаписьЗначенияРегистраСведения()

//вид запроса - ссылка на перечисление виды запросов
Процедура УдалитьЗаписи(Объект, ВидЗапроса) Экспорт
	НаборЗаписей = РегистрыСведений.Scan_Обмен1БДОчередьПоОтправкеРеквизитов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.ВидЗапроса.Установить(ВидЗапроса);

	Попытка
		НаборЗаписей.Записать();
	Исключение		
		ТекстСообщения = Нстр("ru = 'Не удалось удалить данные по причине:'; en = 'Unable to delete data due to:'") + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		ЗаписьЖурналаРегистрации("Регистр сведений. Очередь по отправке реквизитов в 1БД (scania)", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		
	КонецПопытки;
КонецПроцедуры
//rarus bonmak 15.08.2019 14576 --

