
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 09.01.2020 15279 ++
	НастройкиИзРегистра = РегистрыСведений.Scan_НастройкиЗагрузкиИзмененныхОбъектов1БД.ПолучитьНастройки();
	НастройкиИзменяемыхОбъектов.Загрузить(НастройкиИзРегистра);
	Scan_СборСтатистики.Scan_ПриОткрытииФормы(ЭтотОбъект.ИмяФормы); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры //rarus bonmak 09.01.2020 15279 --

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда) //rarus bonmak 09.01.2020 15279 ++
	ЗаписатьИЗакрытьПослеПодтверждения();
КонецПроцедуры //rarus bonmak 09.01.2020 15279 --

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) //rarus bonmak 09.01.2020 15279 ++
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьПослеПодтверждения", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
КонецПроцедуры //rarus bonmak 09.01.2020 15279 --

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьПослеПодтверждения(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт //rarus bonmak 09.01.2020 15279 ++
	Отказ = Ложь;
	ЗаписатьНаСервере(Отказ);
	
	Если НЕ Отказ тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 09.01.2020 15279 --

&НаСервере
Процедура ЗаписатьНаСервере(Отказ) //rarus bonmak 09.01.2020 15279 ++
	Для Каждого Строка Из НастройкиИзменяемыхОбъектов Цикл
		Отказ = РегистрыСведений.Scan_НастройкиЗагрузкиИзмененныхОбъектов1БД.ЗаписьЗначенияРегистраСведения(Строка.ТипИзменяемыхОбъектов, Строка);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры //rarus bonmak 09.01.2020 15279 --

#КонецОбласти
