//rarus tenkam 18.10.2016 mantis 6897 ++
&НаСервере
Процедура ОбновитьМоделиНаСервере()
	ИмяМетода = "GetListOfProductModel";
	СообщениеОбОшибке = "";
	Отказ = Ложь;
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	ПредопредМарка = Справочники.Scan_МаркиПродуктов.Scania;
	Если ЗначениеЗаполнено(ПредопредМарка.IDExternalSystem) Тогда
		СтруктураПараметров.МаркаGUID = ПредопредМарка.IDExternalSystem;
	КонецЕсли;
	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	Если НЕ Отказ Тогда
		СсылкаЭлемента = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникМоделиПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	КонецЕсли;
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМодели(Команда)
	ОбновитьМоделиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДиалогомНаСервере();
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	Элементы.ФормаГруппаИнтеграция.Видимость = Scan_ПраваИНастройки.Scan_Право("ОбменСПредставительством");
КонецПроцедуры
//rarus tenkam 18.10.2016 mantis 6897 --