//rarus sergei 12.12.2016 mantis 8057 ++

// Функция - Получить контактных лиц по месту хранения
//
// Параметры:
//  МестоХраненияСсылка - СправочникСсылка.Scan_МестаХранения - Место хранения, контактных лиц которого необходимо получить
// 
// Возвращаемое значение:
// Массив - массив ссылок на контактных лиц
//
Функция ПолучитьКонтактныхЛицПоМестуХранения(МестоХраненияСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.КонтактноеЛицо КАК КонтактноеЛицо,
				   	//rarus pechek 2.04.2020 15672 +++
	               |	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.ДоступностьВПФ КАК ДоступностьВПФ
				   	//rarus pechek 2.04.2020 15672 ---
	               |ИЗ
	               |	РегистрСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения КАК Scan_ВзаимосвязьКонтактныхЛицИМестХранения
	               |ГДЕ
	               |	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.МестоХранения = &МестоХраненияСсылка";
	Запрос.УстановитьПараметр("МестоХраненияСсылка", МестоХраненияСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
	МассивКЛ = Новый Массив();
	Для Каждого СтрокаРезультата Из Результат Цикл
		//rarus pechek 2.04.2020 15672 +++
		//МассивКЛ.Добавить(СтрокаРезультата.КонтактноеЛицо);
		МассивКЛ.Добавить(новый Структура("КонтактноеЛицо,ДоступностьВПФ",СтрокаРезультата.КонтактноеЛицо,СтрокаРезультата.ДоступностьВПФ));
		//rarus pechek 2.04.2020 15672 ---
	КонецЦикла;
	Возврат МассивКЛ;    
КонецФункции
//rarus sergei 12.12.2016 mantis 8057 --
