//rarus tenkam 04.08.2017 mantis 10589 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.Услуга) Тогда
		Запись.Услуга = Справочники.Scan_НоменклатураУслуг.УслугаПлатон;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры           

&НаКлиенте
Процедура КоэффициентВзиманияПлатыПриИзменении(Элемент)
	Запись.ДействующийРазмерПлатыЗа1Км = Запись.ТарифОплатыЗа1Км * Запись.КоэффициентВзиманияПлаты;
КонецПроцедуры

&НаКлиенте
Процедура ТарифОплатыЗа1КмПриИзменении(Элемент)
	Запись.ДействующийРазмерПлатыЗа1Км = Запись.ТарифОплатыЗа1Км * Запись.КоэффициентВзиманияПлаты;
КонецПроцедуры
//rarus tenkam 04.08.2017 mantis 10589 ---
