//rarus vikhle 26.08.2020 mt 16274 +++
&НаКлиенте
Процедура Отправить(Команда)
	Вложение = Новый Структура;
	Результат.АвтоМасштаб = Истина;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	Вложение.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор));
	ТекущаяДата = Строка(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")); 
	Вложение.Вставить("Представление",  "Отчет Список Отгрузок от " + ТекущаяДата);
		
	СписокВложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = Новый Структура;
		Шаблон = Scan_ПраваИНастройки.Scan_Право("ШаблонПисьмаСОтчетомСписокОтгрузок");
		ПараметрыОтправки.Вставить("Кому", ПолучитьАдресатов(Шаблон));
		ПараметрыОтправки.Вставить("Тема", "Отчет Список отгрузок от "  + ТекущаяДата);
		ПараметрыОтправки.Вставить("Вложения", СписокВложений);
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресатов (Шаблон)
	Возврат Справочники.Scan_ШаблоныПисем.ПолучитьПолучателейПисьма(Шаблон,Неопределено);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scan_СборСтатистики.Scan_ПриОткрытииОтчета(РеквизитФормыВЗначение("Отчет").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +
КонецПроцедуры
//rarus vikhle 26.08.2020 mt 16274 +++

