Функция РезультатИзделийПоЗаявке(ДокументОснование,ИзделияИзАРМ) Экспорт 

	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		// rarus tenkam 23.03.2018 mantis 9428 +++
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Scan_ЗаявкаНаДействие") Тогда
			// rarus tenkam 23.03.2018 mantis 9428 ---
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Изделие КАК Изделие
			|ИЗ
			|	Документ.Scan_ЗаявкаНаДействие.ПродуктыПоЗаявке КАК Scan_ЗаявкаНаДействиеПродуктыПоЗаявке
			|ГДЕ
			|	Scan_ЗаявкаНаДействиеПродуктыПоЗаявке.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ДокументОснование);	
			// rarus tenkam 23.03.2018 mantis 9428 +++	
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Scan_ЗаявкаПеревозчику") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие КАК Изделие
			|ИЗ
			|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
			|ГДЕ
			|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		КонецЕсли;
		// rarus tenkam 23.03.2018 mantis 9428 ---	
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаИзАРМ.Изделие КАК Изделие
		               |ПОМЕСТИТЬ ВТ_ИзделияИзАРМ
		               |ИЗ
		               |	&ИзделияИзАРМ КАК ТаблицаИзАРМ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ИзделияИзАРМ.Изделие КАК Изделие
		               |ИЗ
		               |	ВТ_ИзделияИзАРМ КАК ВТ_ИзделияИзАРМ";
		
		ТаблицаИзАРМ = Новый ТаблицаЗначений;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Scan_Изделия"));
		ТаблицаИзАРМ.Колонки.Добавить("Изделие", Новый ОписаниеТипов(МассивТипов));
		
		Для каждого СтрокаИзделия Из ИзделияИзАРМ Цикл
		
			НоваяСтрока = ТаблицаИзАРМ.Добавить();
			НоваяСтрока.Изделие = СтрокаИзделия.Изделие; 
			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ИзделияИзАРМ", ТаблицаИзАРМ);
	
	КонецЕсли;

	Результат = Запрос.Выполнить();	

	Возврат Результат;
	
КонецФункции // ()

