
&НаКлиенте
Процедура КнопкаОК(Команда)
	
	СписокИзделий = Новый СписокЗначений;
	Для каждого Строка Из Изделия Цикл
	
		Если Строка.Флаг Тогда
		
			СписокИзделий.Добавить(Строка.Изделие);
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Закрыть(СписокИзделий);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем по заявке
	
	Результат = Обработки.Scan_ВводДанныхПоЗаявкеНаСервис.РезультатИзделийПоЗаявке(Параметры.ДокументОснование, Параметры.ИзделияИзАРМ);
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			НоваяСтрока = Изделия.Добавить();
			НоваяСтрока.Флаг = ?(Параметры.СписокИзделий.Количество() = 0, Истина, Ложь);
			НоваяСтрока.Изделие = Выборка.Изделие;
		
		КонецЦикла;
		
		// Расставляем флаги по массиву
	    Для каждого СтрокаСпискаИзделия Из Параметры.СписокИзделий Цикл
			
			СтрокиИзделия = Изделия.НайтиСтроки(Новый Структура("Изделие", СтрокаСпискаИзделия.Значение));	
			
			Если СтрокиИзделия <> Неопределено Тогда
			
				Для каждого СтрокаИзделия Из СтрокиИзделия Цикл
				
					СтрокаИзделия.Флаг = Истина;	
				
				КонецЦикла;
			
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры
