
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если параметры.Свойство("МассивКП") и Параметры.МассивКП <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка", Параметры.МассивКП,ВидСравненияКомпоновкиДанных.ВСписке,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	КонецЕсли;
	
	//rarus agar 13.04.2021 17622 ++
	ОтображениеФиксированногоОтбора();
	//rarus agar 13.04.2021 17622 --
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьПродукты(Элементы.Список.ТекущиеДанные.Ссылка);
	Иначе
		ПродуктыКП.Очистить();
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; //rarus vikhle 09.03.2021 mt 17386
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(ПоместитьТаблицуРезультатаВХранилище(ВладелецФормы.УникальныйИдентификатор, Элементы.Список.ТекущиеДанные.Ссылка, Элементы.ПродуктыКП.ТекущиеДанные.IDПродуктаКП));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПродукты(Ссылка)	
	ПродуктыКП.Загрузить(ссылка.продуктыкп.выгрузить());	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуРезультатаВХранилище(ИдентификаторВладельца,Ссылка,IDПродуктаКП)
	
	СтруктураПараметров = Новый Структура;

	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	СтруктураПараметров.Вставить("IDПродуктаКП", IDПродуктаКП);
	Возврат ПоместитьВоВременноеХранилище(СтруктураПараметров, ИдентификаторВладельца);
	
КонецФункции

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_КоммерческиеПредложения.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --

#КонецОбласти