
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыОткрытия = Новый Структура("ОткрытьБезПродажиКлиенту", Истина);
	ОткрытьФорму("Обработка.Scan_МониторыПродаж.Форма",ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);

	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Обработка.Scan_МониторыПродаж.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
