// rarus tenkam 24.05.2019 mantis 14224 +++
Функция ПолучитьМассивПеречисленийПоОбъекту(ОбъектКлючевойДаты) Экспорт
	МассивПеречислений = Новый Массив;
	
	Если ОбъектКлючевойДаты = Перечисления.Scan_ОбъектыКлючевыхДат.Изделие Тогда
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.SoW);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.WED);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ПродуктВАрхиве);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПокупкиБУИзделия);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУДилеру);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУКлиенту);
		//rarus bonmak 18.05.2020 14375 ++
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПередачиБУИзделияДилеру);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПоступленияИзделияНаСклад);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПоступленияИзделияБУНаСклад);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПоступленияИнвойса1С); //rarus bonmak 17.08.2020 14375	
		//rarus bonmak 18.05.2020 14375 --
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаСписания); //rarus bonmak 22.12.2020 16653
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.БроньДилера); //rarus bonmak 29.03.2021 17400
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ВнутреннийРезервДилера); //Rarus bonmak 04.02.2022 18590
		
	ИначеЕсли ОбъектКлючевойДаты = Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод Тогда
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.DCD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.DDD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.SDDate);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.PDD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.EDD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.CRD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.FinishDate);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.CDD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.CDD2);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.CDDПоставщик);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.CDDX);
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.CDDY);        	//rarus BProg_Gladkov 26.11.2019 0014452 +- CDDY удален
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаБукингЛиста);
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ПолученГрузовойБилет); //rarus BProg_Gladkov 22.11.2019 0014452 ++ ПолученГрузовойБилет удален
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ПортСПБ);
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ТОВыполнено); //rarus BProg_Dekin 11.11.2019 0014452 +- ТОВыполнено удален
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ВывозИзПорта);//rarus BProg_Dekin 11.11.2019 0014452 +- ВывозИзПорта удален
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ADD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ETA);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ADDLBB);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.AN);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.PAD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.AAD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.PTSD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.RFT);
		//rarus bonmak 09.08.2021 16834 МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.RFD);
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.LDD);	// rarus tenkam 06.11.2020 mantis 16673 +
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПродажиИзделия);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПередачиИзделияДилеру);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПродажиКлиенту);
		//rarus bonmak 09.08.2021 16834 МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаСОП);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.DD);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.DD2);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.DDS);
		// rarus tenkam 04.06.2019 mantis 14434 +++
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаИнвойса);
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаОтгрузкиСЗаводаПриEXW);
		// rarus tenkam 04.06.2019 mantis 14434 ---
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.БроньДилера); // rarus pechek 27.12.2019 mantis 15409 //rarus bonmak 29.03.2021 17400 перенес к изделию
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.RDB);// rarus vikhle 18.02.2020 mt 14870
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПоступленияИнвойса1С);// rarus vikhle 30.03.2020 mt 15693 //rarus bonmak 17.08.2020 14375 перенес в изделие	
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.PODOD); // rarus agar 19.03.2021 17404 +-
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.ДатаПродажиПродуктаКлиенту);//rarus vikhle 08.06.2021 m 17636
		МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.Квота); //rarus vikhle 12.11.2021 m 18500
	ИначеЕсли ОбъектКлючевойДаты = Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗакупку Тогда 
		//МассивПеречислений.Добавить(Перечисления.Scan_КлючевыеДаты.PODOD);
			
	КонецЕсли;
	Возврат МассивПеречислений;	
		
КонецФункции

Функция ПолучитьОбъектКлючевойДатыПоПеречислению(ВидКлючевойДаты) Экспорт
		
	Если ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.SoW ИЛИ
		ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.WED ИЛИ
		ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ПродуктВАрхиве ИЛИ
		ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПокупкиБУИзделия ИЛИ
		ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУДилеру ИЛИ
		ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПродажиБУКлиенту 
		//rarus bonmak 18.05.2020 14375 ++
		ИЛИ ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПередачиБУИзделияДилеру
		ИЛИ ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПоступленияИзделияНаСклад
		ИЛИ ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаПоступленияИзделияБУНаСклад
		//rarus bonmak 18.05.2020 14375 --
		ИЛИ ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ДатаСписания //rarus bonmak 22.12.2020 16653
		ИЛИ ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.ВнутреннийРезервДилера //Rarus bonmak 04.02.2022 18590
		Тогда
		
		Возврат Перечисления.Scan_ОбъектыКлючевыхДат.Изделие;
	// rarus agar 19.03.2021 17404 ++
	//ИначеЕсли ВидКлючевойДаты = Перечисления.Scan_КлючевыеДаты.PODOD Тогда
	//	Возврат Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗакупку;
	// rarus agar 19.03.2021 17404 --
	Иначе
		Возврат Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод;	
	КонецЕсли;
	
КонецФункции

// rarus tenkam 24.05.2019 mantis 14224 ---