//rarus tenkam 07.09.2017 mantis 9425 +++

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураХарактеристик = РегистрыСведений.Scan_ДанныеПоАКБИзделий.ПолучитьХарактеристикиАКБ(Объект.Ссылка, ТекущаяДата());
		Если СтруктураХарактеристик <> Неопределено Тогда
			Плотность = СтруктураХарактеристик.Плотность;
			ПусковойТок = СтруктураХарактеристик.ПусковойТок;
			НапряжениеБезНагрузки = СтруктураХарактеристик.НапряжениеБезНагрузки;
			НапряжениеПодНагрузкой = СтруктураХарактеристик.НапряжениеПодНагрузкой;
			Емкость = СтруктураХарактеристик.Емкость;
			Состояние = СтруктураХарактеристик.Состояние;
			ДатаИзменения = СтруктураХарактеристик.ДатаИзменения;
			//Элементы.Состояние.ЦветФона = Состояние.Цвет.Получить();
		КонецЕсли;   
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СтруктураХарактеристик = Новый Структура;
	СтруктураХарактеристик.Вставить("ПусковойТок", ПусковойТок);
	СтруктураХарактеристик.Вставить("Плотность", Плотность);
	СтруктураХарактеристик.Вставить("НапряжениеБезНагрузки", НапряжениеБезНагрузки);
	СтруктураХарактеристик.Вставить("НапряжениеПодНагрузкой", НапряжениеПодНагрузкой);
	СтруктураХарактеристик.Вставить("Емкость", Емкость);
	СтруктураХарактеристик.Вставить("Состояние", Состояние);
	РегистрыСведений.Scan_ДанныеПоАКБИзделий.ЗаписатьХарактеристикиАКБ(Объект.Ссылка,Объект.Изделие,СтруктураХарактеристик, ДатаИзменения);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Объект.Изделие.НомерИзделия + ", АКБ " + Объект.ПорядокАКБ + ", " + Объект.НомерАКБ;		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	СоответствиеХарактеристик = Новый Соответствие;
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.ПусковойТок"), ПусковойТок);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.Плотность"), Плотность);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеБезНагрузки"), НапряжениеБезНагрузки);
	СоответствиеХарактеристик.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеПодНагрузкой"), НапряжениеПодНагрузкой);
	СоответствиеХарактеристик.Вставить("Емкость", Емкость);
	Состояние = ПолучитьСостояние(СоответствиеХарактеристик);
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСостояние(СоответствиеХарактеристик)
	Возврат Справочники.Scan_СостоянияАКБ.ПолучитьСостояниеПоХарактеристикам(СоответствиеХарактеристик);	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 --- 
//rarus tenkam 07.09.2017 mantis 9425 ---