//rarus sergei 06.12.2016 mantis 7164 ++
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//rarus tenkam 19.03.2017 mantis 9063 +++
	Если ПараметрКоманды.Количество() <> 0 Тогда
		Если Scan_ВспомогательныеФункцииСервер.ЭтоЗаявкаCПеревозкой(ПараметрКоманды[0]) Тогда
			Если НЕ Scan_ВспомогательныеФункцииСервер.ЕстьЗаявкаПеревозчику(ПараметрКоманды[0]) Тогда
				Сообщить("Не удалось сформировать печатную форму! На основании данной заявки на действие не создана заявка перевозчику.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//rarus tenkam 19.03.2017 mantis 9063 ---
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(    "Документ.Scan_ЗаявкаНаДействие",        //Менеджер печати
                            "МХ3",            //Идентификатор
                            ПараметрКоманды,        //Объекты печати
                            ЭтотОбъект);               //Владелец формы - форма из которой вызывается печать
 
КонецПроцедуры
//rarus sergei 06.12.2016 mantis 7164 --