//rarus abrant 18.04.2017 mantis 9133 +++
&НаКлиенте
Процедура КомандаОК(Команда)
	ВсеОК = Истина;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		//rarus FominskiyAS 19.04.2019  mantis 14191 +++
		//Сообщить("Файл не выбран!");
		Сообщить(Нстр("ru = 'Файл не выбран!'; en = 'The file is not selected!'"));
		//rarus FominskiyAS 19.04.2019  mantis 14191 ---
		Возврат;	
	КонецЕсли;
	// rarus pechek 30.03.2020 15466 +++
	#Если ВебКлиент Тогда
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			УстановитьРасширениеРаботыСФайлами();
			ПодключитьРасширениеРаботыСФайлами();
		КонецЕсли;
	#КонецЕсли
	// rarus pechek 30.03.2020 15466 ---
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ПутьКФайлу", ПутьКФайлу);
	ПараметрыНастройки.Вставить("НомерСтроки",НомерПервойСтрокиДляЗагрузки);
	ПараметрыНастройки.Вставить("НомерЛиста", НомерЛистаДляЗагрузки); //rarus agar 21.07.2020 16123 +-
	ПараметрыНастройки.Вставить("ИмяКоманды",ИмяКоманды);
	// rarus agar 17.01.2022 17996 ++
	//ПараметрыНастройки.Вставить("ФорматФайла",Прав(ПутьКФайлу,3));
	ПараметрыНастройки.Вставить("ФорматФайла", ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ПутьКФайлу));
	// rarus agar 17.01.2022 17996 --
	ЗаполнитьПараметрыНастройкиПоИмениКоманды(ПараметрыНастройки,ВсеОК);
	Если ВсеОК = Ложь Тогда
		Возврат;
	КонецЕсли;
	Закрыть(ПараметрыНастройки);
	
	
КонецПроцедуры

//rarus agar 14.05.2020 15467 Доп1 ++
&НаКлиенте
Процедура КомандаПрочитать(Команда)
	
	#Если Не ВебКлиент Тогда
		ТекДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ТекДанные);
		ПараметрыЧтения = Новый Структура;
		ПараметрыЧтения.Вставить("АдресВХранилище", АдресВХранилище);
		ПрочитатьФайлНаСервереЗавершение(ПараметрыЧтения);
	#Иначе
		ПомещаемыеФайлыМассив = Новый Массив;
		ПомещаемыеФайлыМассив.Добавить(Новый ОписаниеПередаваемогоФайла(ПутьКФайлу, ""));
		ПараметрыЧтения = Новый Структура;
		Описание = Новый ОписаниеОповещения("ПрочитатьФайлНаСервереФрагмент", ЭтотОбъект, Новый Структура("ПараметрыЧтения", ПараметрыЧтения));
		НачатьПомещениеФайлов(Описание, ПомещаемыеФайлыМассив, , Ложь, УникальныйИдентификатор);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлНаСервереФрагмент(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	ПараметрыЧтения = ДополнительныеПараметры.ПараметрыЧтения;
		
	Если ПомещенныеФайлы = Неопределено Тогда
		Сообщить(НСтр("ru = 'Ошибка при чтении файла'; en = 'Error'"));
		Возврат;
	Иначе
		ПараметрыЧтения.Вставить("АдресВХранилище", ПомещенныеФайлы[0].Хранение);
	КонецЕсли;
	
	ПрочитатьФайлНаСервереЗавершение(ПараметрыЧтения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПрочитатьФайлНаСервереЗавершение(ПараметрыЧтения)
	
	ПрочитатьФайлНаСервере(ПараметрыЧтения);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(ПараметрыЧтения)
	
	ИмяВременногоФайла = КаталогВременныхФайлов() + "FileEXCEL" + Формат(ТекущаяДата(), "ДФ=ddMMyyyyhhmmss") + ".xlsx";
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыЧтения.АдресВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Попытка
		ДанныеФайла.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщить(НСтр("ru = 'Ошибка при чтении файла'; en = 'Error'"));
		Возврат;
	КонецПопытки;
	
	//rarus agar 21.07.2020 16123 ++
	ПостроительЗапроса = Новый ПостроительЗапроса;
	Если НомерЛистаДляЗагрузки <> 0 Тогда
		Для СчетчикОбласти = 1 По ДанныеФайла.Области.Количество() Цикл
			Если СчетчикОбласти = НомерЛистаДляЗагрузки Тогда
				ДанныеФайла.Области[СчетчикОбласти-1].Видимость = Истина;
			Иначе
				ДанныеФайла.Области[СчетчикОбласти-1].Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ИмяОбластиДанных = ДанныеФайла.Области[НомерЛистаДляЗагрузки-1].Имя;
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеФайла.Область(ИмяОбластиДанных));
	Иначе
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеФайла.Область(НомерПервойСтрокиДляЗагрузки,, НомерПервойСтрокиДляЗагрузки,));
	КонецЕсли;
	ПостроительЗапроса.Выполнить();
	//rarus agar 21.07.2020 16123 --
	
	Попытка
		РезультатПостроителя = ПостроительЗапроса.Результат.Выгрузить(); 
	Исключение
		Сообщить(НСтр("ru = 'Ошибка при обработке файла'; en = 'Error'"));
		Возврат;
	КонецПопытки;
	
	МассивКолонок = Новый Массив;
	
	Для Каждого КолонкаРезультата Из РезультатПостроителя.Колонки Цикл
		МассивКолонок.Добавить(КолонкаРезультата.Имя);
	КонецЦикла;
	
	//rarus agar 21.07.2020 16123 ++
	Если ИмяКоманды = "ЗагрузитьПрайсЛистИзФайла" Тогда
		Элементы.ПрайсЛистСемействоИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистИсполнениеИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистОпцияИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистДействуетСИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистДействуетСPPИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистДействуетПоИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистДействуетПоPPИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистСкидкаИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистЦенаDistrNetИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистЦенаDealerNetИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ПрайсЛистЦенаRetailPriceИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
	ИначеЕсли ИмяКоманды = "ЗагрузитьЦеновыеПакетыИзФайла" 
		Или   ИмяКоманды = "ЗагрузитьЦеновыеПакетыДистрибьютораИзФайла" 
		Тогда
		Элементы.ЦеновойПакетКодИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ЦеновойПакетНаименованиеИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ЦеновойПакетЦенаИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ЦеновойПакетТипЗначенияЦеныИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ЦеновойПакетДействуетСИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		// rarus agar 30.04.2021 17322 ++
		Элементы.ЦеновойПакетДействуетСPPИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		// rarus agar 30.04.2021 17322 --
		// rarus agar 07.06.2021 17322 ++
		Элементы.ЦеновойПакетДействуетДоИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ЦеновойПакетДействуетДоPPИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		// rarus agar 07.06.2021 17322 --
		Элементы.ЦеновойПакетОпцияИсполнениеИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
		Элементы.ЦеновойПакетОпцияИмя.СписокВыбора.ЗагрузитьЗначения(МассивКолонок);
	КонецЕсли;
	//rarus agar 21.07.2020 16123 --
	
КонецПроцедуры
//rarus agar 14.05.2020 15467 Доп1 --

//rarus pechek 30.03.2020 15466 +++
&НаСервере 
Функция ПолучитьАдресСпецификацияВТ(Данные)
	Адрес = Данные[0].Хранение;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	Возврат ДвоичныеДанные;
КонецФункции
//rarus pechek 30.03.2020 15466 ---

&НаКлиенте
Процедура ЗаполнитьПараметрыНастройкиПоИмениКоманды(ПараметрыНастройки,ВсеОК)
	
	Если ИмяКоманды = "ЗагрузитьДанныеПоПолисамОСАГО" Тогда
		ПараметрыНастройки.Вставить("ДатаНачалаОСАГО",ОСАГОДатаНачалаОСАГО);
		ПараметрыНастройки.Вставить("ДатаОкончанияОСАГО",ОСАГОДатаОкончанияОСАГО);
		ПараметрыНастройки.Вставить("СерияОСАГО",ОСАГОСерияОСАГО);
		ПараметрыНастройки.Вставить("VINИзделия",ОСАГОVINИзделия);
		//rarus abrant 18.04.2017 mantis 7617 +++
	ИначеЕсли ИмяКоманды = "ЗагрузитьФайлОтПоставщика" Тогда
		Если НЕ ЗначениеЗаполнено(ПоставщикCDD) Тогда
			//rarus FominskiyAS 19.04.2019  mantis 14191 +++
			//Сообщить("CDD не заполнена!");
			Сообщить(НСтр("ru = 'CDD не заполнена!'; en = 'CDD is not filled!'"));
			//rarus FominskiyAS 19.04.2019  mantis 14191 ---
			ВсеОК = Ложь;
			Возврат;	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПоставщикНомерБукингЛиста) ИЛИ НЕ ЗначениеЗаполнено(ПоставщикДатаБукингЛиста) Тогда
			//rarus FominskiyAS 19.04.2019  mantis 14191 +++
			//Сообщить("Заполните номер и дату букинг листа!");
			Сообщить(НСтр("ru = 'Заполните номер и дату букинг листа!'; en = 'Fill in number and date of the booking list!'"));
			//rarus FominskiyAS 19.04.2019  mantis 14191 ---
			ВсеОК = Ложь;
			Возврат;	
		КонецЕсли;
		// rarus tenkam 02.08.2018 mantis 13338 +++ 
		//Если ЗначениеЗаполнено(ПоставщикМестоДоставки) Тогда
		//    ПараметрыНастройки.Вставить("МестоДоставки", ПоставщикМестоДоставки);
		//КонецЕсли;
		// rarus tenkam 02.08.2018 mantis 13338 ---
		Если НЕ ЗначениеЗаполнено(ПоставщикПортОтправки) Тогда
			//rarus FominskiyAS 19.04.2019  mantis 14191 +++
			//Сообщить("Заполните порт отправки!");
			Сообщить(НСтр("ru = 'Заполните порт отправки!'; en = 'Fill in the port of departure!'"));
			//rarus FominskiyAS 19.04.2019  mantis 14191 ---
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ПоставщикПортПрихода) Тогда		 	
			//rarus FominskiyAS 19.04.2019  mantis 14191 +++
			//Сообщить("Заполните порт прихода!");
			Сообщить(Нстр("ru = 'Заполните порт прихода!'; en = 'Fill in the port of arrival!'"));
			//rarus FominskiyAS 19.04.2019  mantis 14191 ---
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		ПараметрыНастройки.Вставить("ПортПрихода",ПоставщикПортПрихода);
		// rarus tenkam 02.08.2018 mantis 13338 +++ 		 
		ПараметрыНастройки.Вставить("МестоДоставки", ПоставщикПортПрихода);
		// rarus tenkam 02.08.2018 mantis 13338 ---
		ПараметрыНастройки.Вставить("ПортОтправки",ПоставщикПортОтправки);
		ПараметрыНастройки.Вставить("CDD", ПоставщикCDD);
		ПараметрыНастройки.Вставить("НомерШасси",ПоставщикНомерШасси);
		ПараметрыНастройки.Вставить("Модель",ПоставщикМодель);
		ПараметрыНастройки.Вставить("Вес",ПоставщикВес);
		ПараметрыНастройки.Вставить("Длина",ПоставщикДлина);
		// rarus tenkam 24.01.2021 mantis 18781 +++
		//ПараметрыНастройки.Вставить("Высота",ПоставщикВысота);
		//ПараметрыНастройки.Вставить("Ширина",ПоставщикШирина);
		// rarus tenkam 24.01.2021 mantis 18781 ---
		ПараметрыНастройки.Вставить("НомерБукингЛиста",ПоставщикНомерБукингЛиста);
		ПараметрыНастройки.Вставить("ДатаБукингЛиста",ПоставщикДатаБукингЛиста);
		//rarus abrant 18.04.2017 mantis 7617 ---
		//rarus pechek 04.03.2020 mantis 15779 +++
		ПараметрыНастройки.Вставить("ПаромнаяЛиния",ПаромнаяЛиния);
		//rarus pechek 04.03.2020 mantis 15779 +++
	ИначеЕсли ИмяКоманды = "ЗагрузитьДатуCRD" Тогда //rarus bonmak 02.10.2019 14224 ++
		Если НЕ ЗначениеЗаполнено(CRDDistributorOrderID) ИЛИ НЕ ЗначениеЗаполнено(CRDДата) Тогда		 	
			Сообщить(Нстр("ru = 'Заполните номера строк!'; en = 'Fill in the line numbers!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		ПараметрыНастройки.Вставить("CRDDistributorOrderID",CRDDistributorOrderID);
		ПараметрыНастройки.Вставить("CRDДата",CRDДата);
		//rarus bonmak 02.10.2019 14224 --
	ИначеЕсли ИмяКоманды = "ЗагрузитьДатуПоступленияИнвойса1С" Тогда //rarus vikhle 20.05.2020 mt 15693 +++
		Если НЕ ЗначениеЗаполнено(НомерШасси) ИЛИ НЕ ЗначениеЗаполнено(ДатаПоступленияИнвойса1С) Тогда //rarus vikhle 26.05.2020 mt 15693 +++		 	
			Сообщить(Нстр("ru = 'Заполните номера строк!'; en = 'Fill in the line numbers!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		ПараметрыНастройки.Вставить("НомерШасси",НомерШасси);
		ПараметрыНастройки.Вставить("ДатаПоступленияИнвойса1С",ДатаПоступленияИнвойса1С);
		//rarus vikhle 20.05.2020 mt 15693 ---
	ИначеЕсли ИмяКоманды = "ЗагрузитьПрайсЛистИзФайла" Тогда //agar 27.02.2020 15467 +++
		//rarus agar 14.05.2020 15467 Доп1 ++
		Если  Не ЗначениеЗаполнено(ПрайсЛистСемейство) 
			И Не ЗначениеЗаполнено(ПрайсЛистСемействоИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните семейство!'; en = 'Fill in the Family Name!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистИсполнение) 
			И Не ЗначениеЗаполнено(ПрайсЛистИсполнениеИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните исполнение!'; en = 'Fill in the Execution!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистОпция) 
			И Не ЗначениеЗаполнено(ПрайсЛистОпцияИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните опцию!'; en = 'Fill in the Description!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистДействуетС) 
			И Не ЗначениеЗаполнено(ПрайсЛистДействуетСИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните Действует с!'; en = 'Fill in the From Date!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистДействуетСPP) 
			И Не ЗначениеЗаполнено(ПрайсЛистДействуетСPPИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните Действует с PP!'; en = 'Fill in the From PP!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистДействуетПо) 
			И Не ЗначениеЗаполнено(ПрайсЛистДействуетПоИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните Действует по!'; en = 'Fill in the To Date!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистДействуетПоPP) 
			И Не ЗначениеЗаполнено(ПрайсЛистДействуетПоPPИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните Действует по PP!'; en = 'Fill in the To PP!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистСкидка) 
			И Не ЗначениеЗаполнено(ПрайсЛистСкидкаИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните скидку!'; en = 'Fill in the Discount!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ПрайсЛистЦенаDistrNet) 
			И Не ЗначениеЗаполнено(ПрайсЛистЦенаDistrNetИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните цену Distr Net!'; en = 'Fill in the Distributor!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		//rarus agar 14.05.2020 15467 Доп1 --
		
		ПараметрыНастройки.Вставить("ПрайсЛистСемейство",     ПрайсЛистСемейство);
		ПараметрыНастройки.Вставить("ПрайсЛистИсполнение",    ПрайсЛистИсполнение);
		ПараметрыНастройки.Вставить("ПрайсЛистОпция",         ПрайсЛистОпция);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетС",    ПрайсЛистДействуетС);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетСPP",  ПрайсЛистДействуетСPP);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетПо",   ПрайсЛистДействуетПо);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетПоPP", ПрайсЛистДействуетПоPP);
		ПараметрыНастройки.Вставить("ПрайсЛистСкидка",        ПрайсЛистСкидка);
		ПараметрыНастройки.Вставить("ПрайсЛистЦенаDistrNet",  ПрайсЛистЦенаDistrNet);
		//rarus agar 03.06.2020 16123 ++
		ПараметрыНастройки.Вставить("ПрайсЛистЦенаDealerNet",    ПрайсЛистЦенаDealerNet);
		ПараметрыНастройки.Вставить("ПрайсЛистЦенаRetailPrice",  ПрайсЛистЦенаRetailPrice);
		//rarus agar 03.06.2020 16123 --
		//rarus agar 14.05.2020 15467 Доп1 ++
		ПараметрыНастройки.Вставить("ПрайсЛистСемействоИмя",     ПрайсЛистСемействоИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистИсполнениеИмя",    ПрайсЛистИсполнениеИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистОпцияИмя",         ПрайсЛистОпцияИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетСИмя",    ПрайсЛистДействуетСИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетСPPИмя",  ПрайсЛистДействуетСPPИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетПоИмя",   ПрайсЛистДействуетПоИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистДействуетПоPPИмя", ПрайсЛистДействуетПоPPИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистСкидкаИмя",        ПрайсЛистСкидкаИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистЦенаDistrNetИмя",  ПрайсЛистЦенаDistrNetИмя);
		//rarus agar 03.06.2020 16123 ++
		ПараметрыНастройки.Вставить("ПрайсЛистЦенаDealerNetИмя",   ПрайсЛистЦенаDealerNetИмя);
		ПараметрыНастройки.Вставить("ПрайсЛистЦенаRetailPriceИмя", ПрайсЛистЦенаRetailPriceИмя);
		//rarus agar 03.06.2020 16123 --
		//rarus agar 14.05.2020 15467 Доп1 --
		//agar 27.02.2020 15467 ---
		//rarus agar 21.07.2020 16123 ++
	ИначеЕсли ИмяКоманды = "ЗагрузитьЦеновыеПакетыИзФайла" 
		Или ИмяКоманды = "ЗагрузитьЦеновыеПакетыДистрибьютораИзФайла" // rarus agar 30.04.2021 17322 +-
		Тогда
		Если  Не ЗначениеЗаполнено(ЦеновойПакетКод) 
			И Не ЗначениеЗаполнено(ЦеновойПакетКодИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните код пакета!'; en = 'Fill in the Package ID!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ЦеновойПакетНаименование) 
			И Не ЗначениеЗаполнено(ЦеновойПакетНаименованиеИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните наименование пакета!'; en = 'Fill in the Name!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ЦеновойПакетЦена) 
			И Не ЗначениеЗаполнено(ЦеновойПакетЦенаИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните цену!'; en = 'Fill in the Value!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ЦеновойПакетТипЗначенияЦены) 
			И Не ЗначениеЗаполнено(ЦеновойПакетТипЗначенияЦеныИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните тип значения цены!'; en = 'Fill in the Unit!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ЦеновойПакетДействуетС) 
			И Не ЗначениеЗаполнено(ЦеновойПакетДействуетСИмя)
			И Не ЗначениеЗаполнено(ЦеновойПакетДействуетСPP) // rarus agar 30.04.2021 17322 +-
			И Не ЗначениеЗаполнено(ЦеновойПакетДействуетСPPИмя) // rarus agar 30.04.2021 17322 +-
			Тогда
			Сообщить(НСтр("ru = 'Заполните Действует с или Действует с PP!'; en = 'Fill in the From Date or From PP!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		// rarus agar 07.06.2021 17322 ++
		Если  Не ЗначениеЗаполнено(ЦеновойПакетДействуетДо) 
			И Не ЗначениеЗаполнено(ЦеновойПакетДействуетДоИмя)
			И Не ЗначениеЗаполнено(ЦеновойПакетДействуетДоPP) 
			И Не ЗначениеЗаполнено(ЦеновойПакетДействуетДоPPИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните Действует до или Действует до PP!'; en = 'Fill in the To Date or To PP!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		// rarus agar 07.06.2021 17322 --
		Если  Не ЗначениеЗаполнено(ЦеновойПакетОпцияИсполнение) 
			И Не ЗначениеЗаполнено(ЦеновойПакетОпцияИсполнениеИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните исполнение опции!'; en = 'Fill in the Variant!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ЦеновойПакетОпция) 
			И Не ЗначениеЗаполнено(ЦеновойПакетОпцияИмя)
			Тогда
			Сообщить(НСтр("ru = 'Заполните опцию!'; en = 'Fill in the Description!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		
		ПараметрыНастройки.Вставить("ЦеновойПакетКод",             ЦеновойПакетКод);
		ПараметрыНастройки.Вставить("ЦеновойПакетНаименование",    ЦеновойПакетНаименование);
		ПараметрыНастройки.Вставить("ЦеновойПакетЦена",            ЦеновойПакетЦена);
		ПараметрыНастройки.Вставить("ЦеновойПакетТипЗначенияЦены", ЦеновойПакетТипЗначенияЦены);
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетС",      ЦеновойПакетДействуетС);
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетСPP",    ЦеновойПакетДействуетСPP); // rarus agar 30.04.2021 17322 +-
		// rarus agar 07.06.2021 17322 ++
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетДо",      ЦеновойПакетДействуетДо);
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетДоPP",    ЦеновойПакетДействуетДоPP);
		// rarus agar 07.06.2021 17322 --
		ПараметрыНастройки.Вставить("ЦеновойПакетОпцияИсполнение", ЦеновойПакетОпцияИсполнение);
		ПараметрыНастройки.Вставить("ЦеновойПакетОпция",           ЦеновойПакетОпция);
		
		ПараметрыНастройки.Вставить("ЦеновойПакетКодИмя",             ЦеновойПакетКодИмя);
		ПараметрыНастройки.Вставить("ЦеновойПакетНаименованиеИмя",    ЦеновойПакетНаименованиеИмя);
		ПараметрыНастройки.Вставить("ЦеновойПакетЦенаИмя",            ЦеновойПакетЦенаИмя);
		ПараметрыНастройки.Вставить("ЦеновойПакетТипЗначенияЦеныИмя", ЦеновойПакетТипЗначенияЦеныИмя);
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетСИмя",      ЦеновойПакетДействуетСИмя);
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетСPPИмя",    ЦеновойПакетДействуетСPPИмя); // rarus agar 30.04.2021 17322 +-
		// rarus agar 07.06.2021 17322 ++
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетДоИмя",      ЦеновойПакетДействуетДоИмя);
		ПараметрыНастройки.Вставить("ЦеновойПакетДействуетДоPPИмя",    ЦеновойПакетДействуетДоPPИмя);
		// rarus agar 07.06.2021 17322 --
		ПараметрыНастройки.Вставить("ЦеновойПакетОпцияИсполнениеИмя", ЦеновойПакетОпцияИсполнениеИмя);
		ПараметрыНастройки.Вставить("ЦеновойПакетОпцияИмя",           ЦеновойПакетОпцияИмя);
		//rarus agar 21.07.2020 16123 --
	ИначеЕсли ИмяКоманды = "ЗагрузитьСпецификацию" Тогда //rarus bonmak 27.03.2020 15466 ++
	//rarus agar 11.12.2020 16403 ++
	ИначеЕсли ИмяКоманды = "ЗагрузитьEDD" Тогда
		Если  Не ЗначениеЗаполнено(EDD) Тогда
			Сообщить(НСтр("ru = 'Заполните EDD!'; en = 'Fill in the EDD!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(ЗаказНаЗавод) Тогда
			Сообщить(НСтр("ru = 'Заполните заказ на завод!'; en = 'Fill in the Order!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		
		ПараметрыНастройки.Вставить("ЗаказНаЗавод", ЗаказНаЗавод);
		ПараметрыНастройки.Вставить("EDD",          EDD);
		//rarus agar 11.12.2020 16403 ++
	//rarus agar 10.12.2021 17996 ++
	ИначеЕсли ИмяКоманды = "ЗагрузитьПрайсЛистНаДвигателиИзФайла" Тогда
		Если  Не ЗначениеЗаполнено(ДвигателиВалюта) Тогда
			Сообщить(НСтр("ru = 'Заполните валюту прайс-листа!'; en = 'Fill in the Currency!'"));
			ВсеОК = Ложь;
			Возврат;
		КонецЕсли;
		
		ПараметрыНастройки.Вставить("ДвигателиВалюта", ДвигателиВалюта);
		//rarus agar 10.12.2021 17996 --
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	// rarus tenkam 09.04.2019 mantis 14195 +++
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение);
		
	//Режим = РежимДиалогаВыбораФайла.Открытие; 
	//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	//ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	//Фильтр = НСтр("ru = 'Таблица XLS (*.xls;*.xlsx)|*.xls;*.xlsx'"); 
	//ДиалогОткрытияФайла.Фильтр = Фильтр; 
	//ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	//ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииДиалогаВыбораФайла", ЭтотОбъект);
	//ДиалогОткрытияФайла.Показать(ОписаниеОповещения);	
	// rarus tenkam 09.04.2019 mantis 14195 ---
	
КонецПроцедуры
// rarus tenkam 09.04.2019 mantis 14195 ---

&НаКлиенте
Процедура ПриЗавершенииДиалогаВыбораФайла(ВыбранныйФайл, Параметры) Экспорт	
	Если ВыбранныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ПолноеИмяФайла = ВыбранныйФайл[0];
	ПутьКФайлу = ПолноеИмяФайла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИмяКоманды") Тогда
		ИмяКоманды = Параметры.ИмяКоманды;
		
		Если ИмяКоманды = "ЗагрузитьДанныеПоПолисамОСАГО" Тогда
			Элементы.ЗагрузкаОСАГО.Видимость = Истина;
			Элементы.ЗагрузкаПоставщик.Видимость = Ложь;
			Элементы.ЗагрузкаДатыCRD.Видимость = Ложь; //rarus bonmak 02.10.2019 14224
			Элементы.ЗагрузкаПрайсЛист.Видимость = Ложь; //rarus agar 27.02.2020 15467
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаПредварительныйПросмотр.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.КомандаПрочитать.Видимость = Ложь; //rarus agar 14.05.2020 15467 Доп1
			Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь; //rarus vikhle 26.05.2020 mt 15693
			Элементы.ЗагрузкаEDD.Видимость = Ложь; //rarus agar 11.12.2020 16403 +-
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость = Ложь; //rarus agar 10.12.2021 17996 +-
			// rarus tenkam 12.02.2019 mantis 14086 +++
			//НомерПервойСтрокиДляЗагрузки = 6;
			//ОСАГОДатаНачалаОСАГО = 6;
			//ОСАГОДатаОкончанияОСАГО =  7;
			//ОСАГОСерияОСАГО = 14;
			//ОСАГОVINИзделия = 3;
			текЗначение = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьДанныеПоПолисамОСАГО","НомераКолонок");
			Если ЗначениеЗаполнено(текЗначение) И текЗначение.Количество() = 5 Тогда
				НомерПервойСтрокиДляЗагрузки = текЗначение[0];
				ОСАГОДатаНачалаОСАГО = текЗначение[1];
				ОСАГОДатаОкончанияОСАГО =  текЗначение[2];
				ОСАГОСерияОСАГО = текЗначение[3];
				ОСАГОVINИзделия = текЗначение[4];
			Иначе
				НомерПервойСтрокиДляЗагрузки = 6;
				ОСАГОДатаНачалаОСАГО = 6;
				ОСАГОДатаОкончанияОСАГО =  7;
				ОСАГОСерияОСАГО = 14;
				ОСАГОVINИзделия = 3;
			КонецЕсли;
			// rarus tenkam 12.02.2019 mantis 14086 ---
		КонецЕсли;
		//rarus abrant 18.04.2017 mantis 7617 +++
		Если ИмяКоманды = "ЗагрузитьФайлОтПоставщика" Тогда
			Элементы.ЗагрузкаПоставщик.Видимость = Истина;
			Элементы.ЗагрузкаОСАГО.Видимость = Ложь;
			Элементы.ЗагрузкаДатыCRD.Видимость = Ложь; //rarus bonmak 02.10.2019 14224
			Элементы.ЗагрузкаПрайсЛист.Видимость = Ложь; //agar 27.02.2020 15467
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаПредварительныйПросмотр.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.КомандаПрочитать.Видимость = Ложь; //rarus agar 14.05.2020 15467 Доп1
			Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь; //rarus vikhle 26.05.2020 mt 15693
			Элементы.ЗагрузкаEDD.Видимость = Ложь; //rarus agar 11.12.2020 16403 +-
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость = Ложь; //rarus agar 10.12.2021 17996 +-
			// rarus tenkam 12.02.2019 mantis 14086 +++
			//НомерПервойСтрокиДляЗагрузки = 4;
			//ПоставщикНомерШасси = 4;
			//ПоставщикМодель = 5;
			//ПоставщикВес = 6;
			//ПоставщикДлина = 7;
			//ПоставщикВысота = 8;
			//ПоставщикШирина = 9;  			
			текЗначение = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьФайлОтПоставщика","НомераКолонок");
			Если ЗначениеЗаполнено(текЗначение) И текЗначение.Количество() = 7 Тогда
				НомерПервойСтрокиДляЗагрузки = текЗначение[0];
				ПоставщикНомерШасси = текЗначение[1];
				ПоставщикМодель = текЗначение[2];
				ПоставщикВес = текЗначение[3];
				ПоставщикДлина = текЗначение[4];
				// rarus tenkam 24.01.2021 mantis 18781 +++
				//ПоставщикВысота = текЗначение[5];
				//ПоставщикШирина = текЗначение[6];
				// rarus tenkam 24.01.2021 mantis 18781 ---
			Иначе
				// rarus tenkam 24.01.2021 mantis 18781 +++
				//НомерПервойСтрокиДляЗагрузки = 4;
				//ПоставщикНомерШасси = 4;
				//ПоставщикМодель = 5;
				//ПоставщикВес = 6;
				//ПоставщикДлина = 7;
				//ПоставщикВысота = 8;
				//ПоставщикШирина = 9;
				НомерПервойСтрокиДляЗагрузки = 2;
				ПоставщикНомерШасси = 1;
				ПоставщикМодель = 2;
				ПоставщикВес = 3;
				ПоставщикДлина = 4;
				// rarus tenkam 24.01.2021 mantis 18781 ---				
			КонецЕсли;			
			// rarus tenkam 12.02.2019 mantis 14086 ---
		КонецЕсли;
		//rarus abrant 18.04.2017 mantis 7617 ---
		
		//rarus bonmak 02.10.2019 14224 ++
		Если ИмяКоманды = "ЗагрузитьДатуCRD" Тогда
			Элементы.ЗагрузкаПоставщик.Видимость = Ложь;
			Элементы.ЗагрузкаОСАГО.Видимость = Ложь; 
			Элементы.ЗагрузкаДатыCRD.Видимость = Истина; 
			Элементы.ЗагрузкаПрайсЛист.Видимость = Ложь; //agar 27.02.2020 15467
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаПредварительныйПросмотр.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.КомандаПрочитать.Видимость = Ложь; //rarus agar 14.05.2020 15467 Доп1
			Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь; //rarus vikhle 26.05.2020 mt 15693
			Элементы.ЗагрузкаEDD.Видимость = Ложь; //rarus agar 11.12.2020 16403 +-
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость = Ложь; //rarus agar 10.12.2021 17996 +-
			текЗначение = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьДатуCRD","НомераКолонок");
			Если ЗначениеЗаполнено(текЗначение) И текЗначение.Количество() = 3 Тогда
				НомерПервойСтрокиДляЗагрузки = текЗначение[0];
				CRDDistributorOrderID = текЗначение[1];
				CRDДата = текЗначение[2];
			Иначе
				НомерПервойСтрокиДляЗагрузки = 2;
				CRDDistributorOrderID = 1;
				CRDДата = 2;
			КонецЕсли;			
			//rarus bonmak 02.10.2019 14224 --
		КонецЕсли;
		
		//rarus vikhle 20.05.2020 mt 15693 +++
		Если ИмяКоманды = "ЗагрузитьДатуПоступленияИнвойса1С" Тогда
			Элементы.ЗагрузкаПоставщик.Видимость = Ложь;
			Элементы.ЗагрузкаОСАГО.Видимость = Ложь; 
			Элементы.ЗагрузкаПрайсЛист.Видимость = Ложь;
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаПредварительныйПросмотр.Видимость = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.КомандаПрочитать.Видимость = Ложь; 
			Элементы.ЗагрузкаДатыCRD.Видимость = Ложь; 
			Элементы.ЗагрузкаEDD.Видимость = Ложь; //rarus agar 11.12.2020 16403 +-
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость = Ложь; //rarus agar 10.12.2021 17996 +-
			текЗначение = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьДатуПоступленияИнвойса1С","НомераКолонок");
			Если ЗначениеЗаполнено(текЗначение) И текЗначение.Количество() = 3 Тогда
				НомерПервойСтрокиДляЗагрузки = текЗначение[0];
				НомерШасси = текЗначение[1];
				ДатаПоступленияИнвойса1С = текЗначение[2];
			Иначе
				НомерПервойСтрокиДляЗагрузки = 2;
				НомерШасси = 1;
				ДатаПоступленияИнвойса1С = 2;
			КонецЕсли;			
		КонецЕсли;
		//rarus vikhle 20.05.2020 mt 15693 ---
		
		//agar 27.02.2020 15467 +++
		Если ИмяКоманды = "ЗагрузитьПрайсЛистИзФайла" Тогда
			Элементы.ЗагрузкаПоставщик.Видимость                = Ложь;
			Элементы.ЗагрузкаОСАГО.Видимость                    = Ложь; 
			Элементы.ЗагрузкаДатыCRD.Видимость                  = Ложь;
			Элементы.ЗагрузкаПрайсЛист.Видимость               = Истина;
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость            = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаНомерПервойСтрокиЗагрузки.Видимость  = Истина;
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость      = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаПредварительныйПросмотр.Видимость    = Истина; //rarus agar 21.07.2020 16123 +-
			Элементы.КомандаПрочитать.Видимость                 = Истина;
			Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь; //rarus vikhle 26.05.2020 mt 15693
			Элементы.ЗагрузкаEDD.Видимость                      = Ложь; //rarus agar 11.12.2020 16403 +-
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость    = Ложь; //rarus agar 10.12.2021 17996 +-
			НомерПервойСтрокиДляЗагрузки = 1;
			
			СохраненныеНомераКолонок = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьПрайсЛистИзФайла","НомераКолонок");
			Если  ЗначениеЗаполнено(СохраненныеНомераКолонок) 
				И СохраненныеНомераКолонок.Количество() = 11 //rarus agar 03.06.2020 16123 +-
				Тогда
				ПрайсЛистСемейство     = СохраненныеНомераКолонок[0];
				ПрайсЛистИсполнение    = СохраненныеНомераКолонок[1];
				ПрайсЛистОпция         = СохраненныеНомераКолонок[2];
				ПрайсЛистДействуетС    = СохраненныеНомераКолонок[3];
				ПрайсЛистДействуетСPP  = СохраненныеНомераКолонок[4];
				ПрайсЛистДействуетПо   = СохраненныеНомераКолонок[5];
				ПрайсЛистДействуетПоPP = СохраненныеНомераКолонок[6];
				ПрайсЛистСкидка        = СохраненныеНомераКолонок[7];
				ПрайсЛистЦенаDistrNet  = СохраненныеНомераКолонок[8];
				//rarus agar 03.06.2020 16123 ++
				ПрайсЛистЦенаDealerNet   = СохраненныеНомераКолонок[9];
				ПрайсЛистЦенаRetailPrice = СохраненныеНомераКолонок[10];
				//rarus agar 03.06.2020 16123 --
			КонецЕсли;
			
			//rarus agar 14.05.2020 15467 Доп1 ++
			СохраненныеИменаКолонок = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьПрайсЛистИзФайла","ИменаКолонок");
			Если  ЗначениеЗаполнено(СохраненныеИменаКолонок) 
				И СохраненныеИменаКолонок.Количество() = 11 //rarus agar 03.06.2020 16123 +-
				Тогда
				Элементы.ПрайсЛистСемействоИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[0]);
				ПрайсЛистСемействоИмя    = СохраненныеИменаКолонок[0];
				
				Элементы.ПрайсЛистИсполнениеИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[1]);
				ПрайсЛистИсполнениеИмя    = СохраненныеИменаКолонок[1];
				
				Элементы.ПрайсЛистОпцияИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[2]);
				ПрайсЛистОпцияИмя         = СохраненныеИменаКолонок[2];
				
				Элементы.ПрайсЛистДействуетСИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[3]);
				ПрайсЛистДействуетСИмя    = СохраненныеИменаКолонок[3];
				
				Элементы.ПрайсЛистДействуетСPPИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[4]);
				ПрайсЛистДействуетСPPИмя  = СохраненныеИменаКолонок[4];
				
				Элементы.ПрайсЛистДействуетПоИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[5]);
				ПрайсЛистДействуетПоИмя   = СохраненныеИменаКолонок[5];
				
				Элементы.ПрайсЛистДействуетПоPPИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[6]);
				ПрайсЛистДействуетПоPPИмя = СохраненныеИменаКолонок[6];
				
				Элементы.ПрайсЛистСкидкаИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[7]);
				ПрайсЛистСкидкаИмя        = СохраненныеИменаКолонок[7];
				
				Элементы.ПрайсЛистЦенаDistrNetИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[8]);
				ПрайсЛистЦенаDistrNetИмя  = СохраненныеИменаКолонок[8];
				//rarus agar 03.06.2020 16123 ++
				Элементы.ПрайсЛистЦенаDealerNetИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[9]);
				ПрайсЛистЦенаDealerNetИмя = СохраненныеИменаКолонок[9];
				
				Элементы.ПрайсЛистЦенаRetailPriceИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[10]);
				ПрайсЛистЦенаRetailPriceИмя  = СохраненныеИменаКолонок[10];
				//rarus agar 03.06.2020 16123 --
			КонецЕсли;
			//rarus agar 14.05.2020 15467 Доп1 --
		КонецЕсли;
		//agar 27.02.2020 15467 ---
		
		//rarus agar 21.07.2020 16123 ++
		Если    ИмяКоманды = "ЗагрузитьЦеновыеПакетыИзФайла" 
			Или ИмяКоманды = "ЗагрузитьЦеновыеПакетыДистрибьютораИзФайла" // rarus agar 30.04.2021 17322 +-
			Тогда
			Элементы.ЗагрузкаПоставщик.Видимость                = Ложь;
			Элементы.ЗагрузкаОСАГО.Видимость                    = Ложь; 
			Элементы.ЗагрузкаДатыCRD.Видимость                  = Ложь;
			Элементы.ЗагрузкаПрайсЛист.Видимость               = Ложь;
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость            = Истина;
			Элементы.ГруппаНомерПервойСтрокиЗагрузки.Видимость  = Истина;
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость      = Истина;
			Элементы.ГруппаПредварительныйПросмотр.Видимость    = Истина;
			Элементы.КомандаПрочитать.Видимость                 = Истина;
			Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь;
			Элементы.ЗагрузкаEDD.Видимость                      = Ложь; //rarus agar 11.12.2020 16403 +-
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость    = Ложь; //rarus agar 10.12.2021 17996 +-
			НомерПервойСтрокиДляЗагрузки = 1;
			// rarus agar 30.04.2021 17322 ++
			//НомерЛистаДляЗагрузки        = 2;
			НомерЛистаДляЗагрузки        = 1;
			// rarus agar 30.04.2021 17322 --
			
			СохраненныеНомераКолонок = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьЦеновыеПакетыИзФайла","НомераКолонок");
			Если  ЗначениеЗаполнено(СохраненныеНомераКолонок) 
				//И СохраненныеНомераКолонок.Количество() = 7
				И СохраненныеНомераКолонок.Количество() = 10 // rarus agar 07.06.2021 17322 ++
				Тогда
				ЦеновойПакетКод              = СохраненныеНомераКолонок[0];
				ЦеновойПакетНаименование     = СохраненныеНомераКолонок[1];
				ЦеновойПакетЦена             = СохраненныеНомераКолонок[2];
				ЦеновойПакетТипЗначенияЦены  = СохраненныеНомераКолонок[3];
				ЦеновойПакетДействуетС       = СохраненныеНомераКолонок[4];
				// rarus agar 07.06.2021 17322 ++
				//ЦеновойПакетОпцияИсполнение = СохраненныеНомераКолонок[5];
				//ЦеновойПакетОпция           = СохраненныеНомераКолонок[6];
				ЦеновойПакетДействуетДо      = СохраненныеНомераКолонок[5];
				ЦеновойПакетДействуетСPP     = СохраненныеНомераКолонок[6];
				ЦеновойПакетДействуетДоPP    = СохраненныеНомераКолонок[7];
				ЦеновойПакетОпцияИсполнение  = СохраненныеНомераКолонок[8];
				ЦеновойПакетОпция            = СохраненныеНомераКолонок[9];
				// rarus agar 07.06.2021 17322 --
			КонецЕсли;
			
			СохраненныеИменаКолонок = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьЦеновыеПакетыИзФайла","ИменаКолонок");
			Если  ЗначениеЗаполнено(СохраненныеИменаКолонок) 
				// И СохраненныеИменаКолонок.Количество() = 7
				 И СохраненныеИменаКолонок.Количество() = 10 // rarus agar 07.06.2021 17322 ++
				Тогда
				Элементы.ЦеновойПакетКодИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[0]);
				ЦеновойПакетКодИмя    = СохраненныеИменаКолонок[0];
				
				Элементы.ЦеновойПакетНаименованиеИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[1]);
				ЦеновойПакетНаименованиеИмя    = СохраненныеИменаКолонок[1];
				
				Элементы.ЦеновойПакетЦенаИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[2]);
				ЦеновойПакетЦенаИмя         = СохраненныеИменаКолонок[2];
				
				Элементы.ЦеновойПакетТипЗначенияЦеныИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[3]);
				ЦеновойПакетТипЗначенияЦеныИмя    = СохраненныеИменаКолонок[3];
				
				Элементы.ЦеновойПакетДействуетСИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[4]);
				ЦеновойПакетДействуетСИмя  = СохраненныеИменаКолонок[4];
				
				// rarus agar 07.06.2021 17322 ++
				//Элементы.ЦеновойПакетОпцияИсполнениеИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[5]);
				//ЦеновойПакетОпцияИсполнениеИмя   = СохраненныеИменаКолонок[5];
				//
				//Элементы.ЦеновойПакетОпцияИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[6]);
				//ЦеновойПакетОпцияИмя = СохраненныеИменаКолонок[6];
				Элементы.ЦеновойПакетДействуетДоИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[5]);
				ЦеновойПакетДействуетДоИмя  = СохраненныеИменаКолонок[5];
				
				Элементы.ЦеновойПакетДействуетСPPИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[6]);
				ЦеновойПакетДействуетСPPИмя  = СохраненныеИменаКолонок[6];
				
				Элементы.ЦеновойПакетДействуетДоPPИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[7]);
				ЦеновойПакетДействуетДоPPИмя  = СохраненныеИменаКолонок[7];
				
				Элементы.ЦеновойПакетОпцияИсполнениеИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[8]);
				ЦеновойПакетОпцияИсполнениеИмя   = СохраненныеИменаКолонок[8];
				
				Элементы.ЦеновойПакетОпцияИмя.СписокВыбора.Добавить(СохраненныеИменаКолонок[9]);
				ЦеновойПакетОпцияИмя = СохраненныеИменаКолонок[9];
				// rarus agar 07.06.2021 17322 --
			КонецЕсли;
		КонецЕсли;
		//rarus agar 21.07.2020 16123 --
		
		//rarus pechek mantis 15466 +++
		Если ИмяКоманды = "ЗагрузитьСпецификацию" Тогда
			Элементы.ЗагрузкаПоставщик.Видимость                = Ложь;
			Элементы.ЗагрузкаОСАГО.Видимость                    = Ложь; 
			Элементы.ЗагрузкаДатыCRD.Видимость                  = Ложь;
			Элементы.ЗагрузкаПрайсЛист.Видимость               = Ложь;
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость            = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаНомерПервойСтрокиЗагрузки.Видимость  = Ложь;
			Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь; //rarus vikhle 26.05.2020 mt 15693
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость      = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.ГруппаПредварительныйПросмотр.Видимость    = Ложь; //rarus agar 21.07.2020 16123 +-
			Элементы.КомандаПрочитать.Видимость                 = Ложь; //rarus agar 14.05.2020 15467 Доп1
			Элементы.ЗагрузкаEDD.Видимость                      = Ложь; //rarus agar 11.12.2020 16403 +-
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость    = Ложь; //rarus agar 10.12.2021 17996 +-
			
			НомерПервойСтрокиДляЗагрузки = 1;
			//СохраненныеНомераКолонок = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьСпецификацию","НомераКолонок");
			//
			// 			Если  ЗначениеЗаполнено(СохраненныеНомераКолонок) 
			//	И СохраненныеНомераКолонок.Количество() = 9 
			//	Тогда
			//	ПрайсЛистСемейство     = СохраненныеНомераКолонок[0];
			//	ПрайсЛистИсполнение    = СохраненныеНомераКолонок[1];
			//	ПрайсЛистОпция         = СохраненныеНомераКолонок[2];
			//	ПрайсЛистДействуетС    = СохраненныеНомераКолонок[3];
			//	ПрайсЛистДействуетСPP  = СохраненныеНомераКолонок[4];
			//	ПрайсЛистДействуетПо   = СохраненныеНомераКолонок[5];
			//	ПрайсЛистДействуетПоPP = СохраненныеНомераКолонок[6];
			//	ПрайсЛистСкидка        = СохраненныеНомераКолонок[7];
			//	ПрайсЛистЦенаDistrNet  = СохраненныеНомераКолонок[8];
			//КонецЕсли;

			
		КонецЕсли; 
		//rarus pechek mantis 15466 ---
		
		//rarus agar 11.12.2020 16403 ++
		Если ИмяКоманды = "ЗагрузитьEDD" Тогда
			Элементы.ЗагрузкаПоставщик.Видимость                = Ложь;
			Элементы.ЗагрузкаОСАГО.Видимость                    = Ложь; 
			Элементы.ЗагрузкаДатыCRD.Видимость                  = Ложь;
			Элементы.ЗагрузкаПрайсЛист.Видимость                = Ложь;
			Элементы.ЗагрузкаЦеновыеПакеты.Видимость            = Ложь;
			Элементы.ГруппаНомерПервойСтрокиЗагрузки.Видимость  = Ложь;
			Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь;
			Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость      = Ложь;
			Элементы.ГруппаПредварительныйПросмотр.Видимость    = Ложь;
			Элементы.КомандаПрочитать.Видимость                 = Ложь;
			Элементы.ЗагрузкаПрайсЛистаНаДвигатели.Видимость    = Ложь; //rarus agar 10.12.2021 17996 +-
			
			НомерПервойСтрокиДляЗагрузки = 1;
			
			СохраненныеНомераКолонок = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьEDD","НомераКолонок");
			Если  ЗначениеЗаполнено(СохраненныеНомераКолонок) 
				И СохраненныеНомераКолонок.Количество() = 2
				Тогда
				ЗаказНаЗавод = СохраненныеНомераКолонок[0];
				EDD          = СохраненныеНомераКолонок[1];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//rarus agar 10.12.2021 17996 ++
	Если ИмяКоманды = "ЗагрузитьПрайсЛистНаДвигателиИзФайла" Тогда
		Элементы.ЗагрузкаПоставщик.Видимость                = Ложь;
		Элементы.ЗагрузкаОСАГО.Видимость                    = Ложь; 
		Элементы.ЗагрузкаДатыCRD.Видимость                  = Ложь;
		Элементы.ЗагрузкаПрайсЛист.Видимость                = Ложь;
		Элементы.ЗагрузкаЦеновыеПакеты.Видимость            = Ложь;
		Элементы.ГруппаНомерПервойСтрокиЗагрузки.Видимость  = Ложь;
		Элементы.ЗагрузкаДатыПоступленияИнвойса1С.Видимость = Ложь;
		Элементы.ГруппаНомерЛистаДляЗагрузки.Видимость      = Ложь;
		Элементы.ГруппаПредварительныйПросмотр.Видимость    = Ложь;
		Элементы.КомандаПрочитать.Видимость                 = Ложь;
		Элементы.ЗагрузкаEDD.Видимость                      = Ложь;
		
		СохраненнаяВалюта = ХранилищеНастроекДанныхФорм.Загрузить("ЗагрузитьПрайсЛистНаДвигателиИзФайла", "ДвигателиВалюта");
		Если  ЗначениеЗаполнено(СохраненнаяВалюта) Тогда
			ДвигателиВалюта = СохраненнаяВалюта;
		КонецЕсли;
	КонецЕсли;
	//rarus agar 10.12.2021 17996 --
	
	Scan_СборСтатистики.Scan_ПриОткрытииФормы(ЭтотОбъект.ИмяФормы); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры

//rarus abrant 18.04.2017 mantis 7617 +++
&НаКлиенте
Процедура ПоставщикПортОтправкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("Маршрут,ЭтоГруппа", Ложь, Ложь);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ДополнительныеПараметры = Новый Структура ("Элемент", Элемент.Имя);
	Описание = Новый ОписаниеОповещения("ЗаполнениеПолейПортов",ЭтотОбъект,ДополнительныеПараметры);
	ОткрытьФорму("Справочник.Scan_МестаХранения.ФормаВыбора", ПараметрыВыбора,ЭтаФорма,,,,Описание,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПолейПортов(Результат,Параметры) Экспорт
	ЭтотОбъект[Параметры.Элемент] = Результат;
КонецПроцедуры

// rarus tenkam 12.02.2019 mantis 14086 +++
&НаСервере
Процедура ПриЗакрытииНаСервере()
	ТекМассив = Новый Массив;	
	Если ИмяКоманды = "ЗагрузитьДанныеПоПолисамОСАГО" Тогда
		ТекМассив.Добавить(НомерПервойСтрокиДляЗагрузки);
		ТекМассив.Добавить(ОСАГОДатаНачалаОСАГО);
		ТекМассив.Добавить(ОСАГОДатаОкончанияОСАГО);
		ТекМассив.Добавить(ОСАГОСерияОСАГО);
		ТекМассив.Добавить(ОСАГОVINИзделия);
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьДанныеПоПолисамОСАГО","НомераКолонок",ТекМассив);
	ИначеЕсли ИмяКоманды = "ЗагрузитьФайлОтПоставщика" Тогда
		ТекМассив.Добавить(НомерПервойСтрокиДляЗагрузки);
		ТекМассив.Добавить(ПоставщикНомерШасси);
		ТекМассив.Добавить(ПоставщикМодель);
		ТекМассив.Добавить(ПоставщикВес);
		ТекМассив.Добавить(ПоставщикДлина);
		// rarus tenkam 24.01.2021 mantis 18781 +++
		//ТекМассив.Добавить(ПоставщикВысота);
		//ТекМассив.Добавить(ПоставщикШирина);
		// rarus tenkam 24.01.2021 mantis 18781 ---
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьФайлОтПоставщика","НомераКолонок",ТекМассив);
	ИначеЕсли ИмяКоманды = "ЗагрузитьДатуCRD" Тогда //rarus bonmak 02.10.2019 14224 ++
		ТекМассив.Добавить(НомерПервойСтрокиДляЗагрузки);
		ТекМассив.Добавить(CRDDistributorOrderID);
		ТекМассив.Добавить(CRDДата);
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьДатуCRD","НомераКолонок",ТекМассив);
		//rarus bonmak 02.10.2019 14224 --
	//rarus vikhle 20.05.2020 mt 15693 +++	
	ИначеЕсли ИмяКоманды = "ЗагрузитьДатуПоступленияИнвойса1С" Тогда 
		ТекМассив.Добавить(НомерПервойСтрокиДляЗагрузки);
		ТекМассив.Добавить(НомерШасси);
		ТекМассив.Добавить(ДатаПоступленияИнвойса1С);
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьДатуПоступленияИнвойса1С","НомераКолонок",ТекМассив);	
	//rarus vikhle 20.05.2020 mt 15693 ---	
	ИначеЕсли ИмяКоманды = "ЗагрузитьПрайсЛистИзФайла" Тогда //agar 29.02.2020 15467 +++
		МассивНомеровКолонок = Новый Массив;
		МассивНомеровКолонок.Добавить(ПрайсЛистСемейство);
		МассивНомеровКолонок.Добавить(ПрайсЛистИсполнение);
		МассивНомеровКолонок.Добавить(ПрайсЛистОпция);
		МассивНомеровКолонок.Добавить(ПрайсЛистДействуетС);
		МассивНомеровКолонок.Добавить(ПрайсЛистДействуетС);
		МассивНомеровКолонок.Добавить(ПрайсЛистДействуетСPP);
		МассивНомеровКолонок.Добавить(ПрайсЛистДействуетПо);
		МассивНомеровКолонок.Добавить(ПрайсЛистДействуетПоPP);
		МассивНомеровКолонок.Добавить(ПрайсЛистСкидка);
		МассивНомеровКолонок.Добавить(ПрайсЛистЦенаDistrNet);
		//rarus agar 03.06.2020 16123 ++
		МассивНомеровКолонок.Добавить(ПрайсЛистЦенаDealerNet);
		МассивНомеровКолонок.Добавить(ПрайсЛистЦенаRetailPrice);
		//rarus agar 03.06.2020 16123 --
		
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьПрайсЛистИзФайла", "НомераКолонок", МассивНомеровКолонок);
		//rarus agar 14.05.2020 15467 Доп1 ++
		МассивИменКолонок = Новый Массив;
		МассивИменКолонок.Добавить(ПрайсЛистСемействоИмя);
		МассивИменКолонок.Добавить(ПрайсЛистИсполнениеИмя);
		МассивИменКолонок.Добавить(ПрайсЛистОпцияИмя);
		МассивИменКолонок.Добавить(ПрайсЛистДействуетСИмя);
		МассивИменКолонок.Добавить(ПрайсЛистДействуетСPPИмя);
		МассивИменКолонок.Добавить(ПрайсЛистДействуетПоИмя);
		МассивИменКолонок.Добавить(ПрайсЛистДействуетПоPPИмя);
		МассивИменКолонок.Добавить(ПрайсЛистСкидкаИмя);
		МассивИменКолонок.Добавить(ПрайсЛистЦенаDistrNetИмя);
		//rarus agar 03.06.2020 16123 ++
		МассивИменКолонок.Добавить(ПрайсЛистЦенаDealerNetИмя);
		МассивИменКолонок.Добавить(ПрайсЛистЦенаRetailPriceИмя);
		//rarus agar 03.06.2020 16123 --
		
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьПрайсЛистИзФайла", "ИменаКолонок", МассивИменКолонок);
		//rarus agar 14.05.2020 15467 Доп1 --
		//agar 29.02.2020 15467 ---
		//rarus agar 21.07.2020 16123 ++
	ИначеЕсли ИмяКоманды = "ЗагрузитьЦеновыеПакетыИзФайла" 
		Или   ИмяКоманды = "ЗагрузитьЦеновыеПакетыДистрибьютораИзФайла" // rarus agar 30.04.2021 17322 +-
		Тогда
		МассивНомеровКолонок = Новый Массив;
		МассивНомеровКолонок.Добавить(ЦеновойПакетКод);
		МассивНомеровКолонок.Добавить(ЦеновойПакетНаименование);
		МассивНомеровКолонок.Добавить(ЦеновойПакетЦена);
		МассивНомеровКолонок.Добавить(ЦеновойПакетТипЗначенияЦены);
		МассивНомеровКолонок.Добавить(ЦеновойПакетДействуетС);
		// rarus agar 07.06.2021 17322 ++
		МассивНомеровКолонок.Добавить(ЦеновойПакетДействуетДо);
		МассивНомеровКолонок.Добавить(ЦеновойПакетДействуетСPP); // rarus agar 30.04.2021 17322 +-
		МассивНомеровКолонок.Добавить(ЦеновойПакетДействуетДоPP);
		// rarus agar 07.06.2021 17322 --
		МассивНомеровКолонок.Добавить(ЦеновойПакетОпцияИсполнение);
		МассивНомеровКолонок.Добавить(ЦеновойПакетОпция);
		
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьЦеновыеПакетыИзФайла", "НомераКолонок", МассивНомеровКолонок);
		
		МассивИменКолонок = Новый Массив;
		МассивИменКолонок.Добавить(ЦеновойПакетКодИмя);
		МассивИменКолонок.Добавить(ЦеновойПакетНаименованиеИмя);
		МассивИменКолонок.Добавить(ЦеновойПакетЦенаИмя);
		МассивИменКолонок.Добавить(ЦеновойПакетТипЗначенияЦеныИмя);
		МассивИменКолонок.Добавить(ЦеновойПакетДействуетСИмя);
		// rarus agar 07.06.2021 17322 ++
		МассивИменКолонок.Добавить(ЦеновойПакетДействуетДоИмя);
		МассивИменКолонок.Добавить(ЦеновойПакетДействуетСPPИмя); // rarus agar 30.04.2021 17322 +-
		МассивИменКолонок.Добавить(ЦеновойПакетДействуетДоPPИмя);
		// rarus agar 07.06.2021 17322 --
		МассивИменКолонок.Добавить(ЦеновойПакетОпцияИсполнениеИмя);
		МассивИменКолонок.Добавить(ЦеновойПакетОпцияИмя);
		
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьЦеновыеПакетыИзФайла", "ИменаКолонок", МассивИменКолонок);
		//rarus agar 21.07.2020 16123 --
		//rarus agar 11.12.2020 16403 ++
	ИначеЕсли ИмяКоманды = "ЗагрузитьEDD" Тогда
		МассивНомеровКолонок = Новый Массив;
		МассивНомеровКолонок.Добавить(ЗаказНаЗавод);
		МассивНомеровКолонок.Добавить(EDD);
			
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьEDD", "НомераКолонок", МассивНомеровКолонок);
		//rarus agar 11.12.2020 16403 --
	//rarus agar 10.12.2021 17996 ++
	ИначеЕсли ИмяКоманды = "ЗагрузитьПрайсЛистНаДвигателиИзФайла" Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("ЗагрузитьПрайсЛистНаДвигателиИзФайла", "ДвигателиВалюта", ДвигателиВалюта);
		//rarus agar 10.12.2021 17996 --
	КонецЕсли;
КонецПроцедуры
// rarus tenkam 12.02.2019 mantis 14086 ---

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

// rarus tenkam 09.04.2019 mantis 14195 +++

&НаКлиенте
Процедура ПослеПодключенияРасширения(Результат, ДополнительныеПараметры) Экспорт
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//rarus pechek mantis 15466 +++
	Если НЕ ИмяКоманды = "ЗагрузитьСпецификацию" Тогда
		Фильтр = НСтр("ru = 'Таблица XLS (*.xls;*.xlsx)|*.xls;*.xlsx'"); 
		ДиалогОткрытияФайла.Фильтр = Фильтр;
	КонецЕсли;
	//rarus pechek mantis 15466 ---
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииДиалогаВыбораФайла", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);	   		
	
КонецПроцедуры  


//rarus abrant 18.04.2017 mantis 7617 ---

//rarus abrant 18.04.2017 mantis 9133 ---
