
//rarus vikhle 28.09.2020 mt 16181 +++
Процедура ОбновитьТабличныеЧастиКП (СсылкаНаИзделие) Экспорт
	
	Если НЕ ТипЗнч(СсылкаНаИзделие) = Тип("СправочникСсылка.Scan_Изделия") Тогда  //rarus vikhle 03.11.2020 mt 16181 убрал проверку на idпродуктакп
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	//rarus vikhle 02.11.2020 mt 16181 +++
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Scan_КоммерческиеПредложенияПродуктыКП.Ссылка КАК КП,
	//               |	Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП КАК IDПродуктаКППродуктыКП,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Изделие КАК Изделие,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.НомерСтроки КАК НомерСтрокиИзделияПоПродуктам,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.IDПродукта КАК IDПродукта,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.IDПродуктаКП КАК IDПродуктаКПИзделияПоПродуктам
	//               |ИЗ
	//               |	Справочник.Scan_КоммерческиеПредложения.ПродуктыКП КАК Scan_КоммерческиеПредложенияПродуктыКП
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_КоммерческиеПредложения.ИзделияПоПродуктам КАК Scan_КоммерческиеПредложенияИзделияПоПродуктам
	//               |		ПО Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП = Scan_КоммерческиеПредложенияИзделияПоПродуктам.IDПродуктаКП
	//               |ГДЕ
	//               |	Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП = &IDПродуктаКП
	//               |ИТОГИ ПО
	//               |	КП";
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА Scan_КоммерческиеПредложенияИзделияПоПродуктам.Изделие = &СсылкаНаИзделие
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ИзделиеВходитВКП
	               |ПОМЕСТИТЬ КП
	               |ИЗ
	               |	Справочник.Scan_КоммерческиеПредложения.ИзделияПоПродуктам КАК Scan_КоммерческиеПредложенияИзделияПоПродуктам
	               |ГДЕ
	               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Ссылка.НомерКП = &НомерКП
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КП.Ссылка КАК Ссылка
	               |ИЗ
	               |	КП КАК КП
	               |ГДЕ
	               |	КП.ИзделиеВходитВКП = 0";
	Запрос.УстановитьПараметр("СсылкаНаИзделие",СсылкаНаИзделие);
	Запрос.УстановитьПараметр("НомерКП",СсылкаНаИзделие.НомерКП);
	//Запрос.УстановитьПараметр("IDПродуктаКП",СсылкаНаИзделие.IDПродуктаКП);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектКП = Выборка.Ссылка.ПолучитьОбъект();
			нСтрокаТЧ = ОбъектКП.ИзделияПоПродуктам.Добавить();
			нСтрокаТЧ.IDПродуктаКП = СсылкаНаИзделие.IDПродуктаКП;
			нСтрокаТЧ.IDПродукта = СсылкаНаИзделие.IDExternalSystemProduct;
			нСтрокаТЧ.Изделие = СсылкаНаИзделие;
			Попытка
				ОбъектКП.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Обновление табличных частей КП",УровеньЖурналаРегистрации.Ошибка,,Выборка.КП,
										"Не удалось записать Коммерческое предложение " + Выборка.Ссылка +  " " + ОписаниеОшибки());
			КонецПопытки;	
		КонецЦикла;
	КонецЕсли;	
	
	//Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока Выборка.Следующий() Цикл
	//	ОбъектКП = Выборка.КП.ПолучитьОбъект();
	//	НужноЗаписатьКП = Ложь;
	//	ВыборкаДетальныеЗаписи = Выборка.Выбрать();
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Если ВыборкаДетальныеЗаписи.IDПродуктаКПИзделияПоПродуктам = NULL Тогда
	//			нСтрокаТЧ = ОбъектКП.ИзделияПоПродуктам.Добавить();
	//			нСтрокаТЧ.IDПродуктаКП = ВыборкаДетальныеЗаписи.IDПродуктаКППродуктыКП;
	//			нСтрокаТЧ.IDПродукта = СсылкаНаИзделие.IDExternalSystemProduct;
	//			нСтрокаТЧ.Изделие = СсылкаНаИзделие;
	//			НужноЗаписатьКП = Истина;
	//			Прервать;
	//		ИначеЕсли ВыборкаДетальныеЗаписи.Изделие.Пустая() И ВыборкаДетальныеЗаписи.IDПродукта = СсылкаНаИзделие.IDExternalSystemProduct Тогда
	//			ОбъектКП.ИзделияПоПродуктам[ВыборкаДетальныеЗаписи.НомерСтрокиИзделияПоПродуктам - 1].Изделие = СсылкаНаИзделие;	
	//			НужноЗаписатьКП = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;	
	//	Если НужноЗаписатьКП Тогда
	//		Попытка
	//			ОбъектКП.Записать();
	//		Исключение
	//			ЗаписьЖурналаРегистрации("Обновление табличных частей КП",УровеньЖурналаРегистрации.Ошибка,,Выборка.КП,
	//									"Не удалось записать Коммерческое предложение " + Выборка.КП +  " " + ОписаниеОшибки());
	//		КонецПопытки;
	//	КонецЕсли;	
	//КонецЦикла;	
	//rarus vikhle 02.11.2020 mt 16181 ---
	
КонецПроцедуры
//rarus vikhle 28.09.2020 mt 16181 ---
