#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("АдминистраторСистемы") ИЛИ НЕ РольДоступна("ПолныеПрава")Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	СтруктураОтбора = Новый Структура("ШаблонПисьма", Запись.ШаблонПисьма);
	СтруктураОтбора.Вставить("ДокументОтправки", Запись.ДокументОтправки);
	СтруктураДанных = РегистрыСведений.Scan_ОчередьПоОтправкеПисем.Получить(СтруктураОтбора);
	
	Если СтруктураДанных.ПараметрыОтправки <> Неопределено Тогда
		ТекТабЗнч = СтруктураДанных.ПараметрыОтправки.Получить();
		Если ТекТабЗнч <> Неопределено Тогда
			Для Каждого ТекСтрока Из ТекТабЗнч Цикл
				СтрокаПараметры = СтрокаПараметры + ТекСтрока.Свойство + ": " + ТекСтрока.Значение + Символы.ПС;
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти