&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus bonmak 04.12.2019 14456 ++
	//rarus bonmak 15.04.2020 14456 ++
	ДопПараметры = Новый Структура;
	Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetListOfStatuses(ДопПараметры);
	//rarus bonmak 15.04.2020 14456 --
	Элементы.Список.Обновить();
КонецПроцедуры //rarus bonmak 04.12.2019 14456 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 04.12.2019 14456 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus bonmak 04.12.2019 14456 --
