//rarus tenkam 18.10.2016 mantis 6897 ++
&НаСервере
Процедура ОбновитьСпецификацииНаСервере()
	
	// rarus tenkam 09.09.2019 mantis 14841 +++	
		
	////Для Каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
	//	ИмяМетода = "GetListOfSpecifications";
	//	СообщениеОбОшибке = "";
	//	Отказ = Ложь;
	//	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	//	//СтруктураПараметров.Вставить("GUID", ТекСтрока.IDExternalSystem);
	//	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//	ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//	Если НЕ Отказ Тогда
	//		СсылкаЭлемента = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникСпецификацииПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	КонецЕсли;
	////КонецЦикла;
	//Элементы.Список.Обновить();
	
	// rarus tenkam 09.09.2019 mantis 14841 ---	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпецификации(Команда)
	ОбновитьСпецификацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДиалогомНаСервере();
КонецПроцедуры

//rarus vikhle 07.05.2020 mt 15695 +++
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();
КонецПроцедуры
//rarus vikhle 07.05.2020 mt 15695 ---

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	Элементы.ФормаГруппаИнтеграция.Видимость = Scan_ПраваИНастройки.Scan_Право("ОбменСПредставительством");
КонецПроцедуры

//rarus tenkam 18.10.2016 mantis 6897 --