
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//rarus vikhle 14.10.2020 mt 16181 +++
	Если Параметры.Свойство("Модель") И Параметры.Свойство("ОтборПоЧастичномуСовпадениюМодели") Тогда
		ОсноваИмениМодели = Лев(СокрЛП(Параметры.Модель.Наименование),10); 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Модель.Наименование", 
																				ОсноваИмениМодели,ВидСравненияКомпоновкиДанных.НачинаетсяС, "Наименование модели" //rarus agar 13.04.2021 17622 +-
																				,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
	КонецЕсли;
	//rarus vikhle 14.10.2020 mt 16181 ---
	
	//rarus vikhle 14.02.2023 m 19839 +++
	Если Параметры.Свойство("Марки") Тогда
		ОбщегоНазначенияКлиентСервер.
			УстановитьЭлементОтбораДинамическогоСписка(Список,"Модель.МаркаПродукта", 
														Параметры.Марки, 
														ВидСравненияКомпоновкиДанных.ВСписке,,,
														РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	КонецЕсли;	
	//rarus vikhle 14.02.2023 m 19839 ---
	
	//rarus agar 13.04.2021 17622 ++
	ОтображениеФиксированногоОтбора();
	//rarus agar 13.04.2021 17622 --
	
КонецПроцедуры

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_ДрафтыПродуктов.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --