//rarus agar 14.08.2020 16138 ++
Процедура ПередЗаписью(Отказ)
	
	Если  ЭтоНовый() 
		И Scan_ПраваИНастройки.Scan_Право("ИспользоватьМеханизмШаблоновДляОтправкиПисем")
		Тогда
		//Если Scan_ПраваИНастройки.Scan_Право("ИспользоватьМеханизмШаблоновДляОтправкиПисем") Тогда
			РезультатОтправкиПисьма = Scan_ОтправкаПисемПоЭлектроннойПочте.ОтправитьПисьмоПоШаблонуИзПрава("ШаблонПисьмаОПоявленииНовогоЦветаКабиныПТС");
		//Иначе
		//	Scan_ОтправкаПисемПоЭлектроннойПочте.ОтправитьПисьмоПоНастройкам("ТемаПисьмаУведомленияОПоявленииНовогоЦветаКабиныПТС","ТекстПисьмаУведомленияОПоявленииНовогоЦветаКабиныПТС","УведомлятьОПоявленииНовогоЦветаКабиныПТС");
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 14.08.2020 16138 --