
//rarus BProg_Gladkov 13.01.2020 0014560 +++
Функция ПроверитьПартПериод(ПартПериод) Экспорт 
	//первые два символа - год
	// 3ий и 4ый символ - месяц
	// 5ый символ - неделя месяца
	Отказ = Ложь;
	ПартПериодБезПробелов = СтрЗаменить(ПартПериод," " ,"");

	Попытка ПартПериодЧислом  = Число(ПартПериодБезПробелов);
	Исключение
		ТекстСообщения = НСтр("ru = 'Для Part Period должны быть только цифры.'; 
							  |en = 'Only digits should be.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецПопытки;
	
	Если СтрДлина(ПартПериодБезПробелов) < 5 тогда
			ТекстСообщения = НСтр("ru = 'Для Part Period количество символов должно быть 7'; 
								|en = 'For Part Period, the number of characters must be 7.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат Отказ;
	КонецЕсли;

	ПервыйСимвол = Лев(ПартПериод, 1); 
	Если Число(ПервыйСимвол) > 2 тогда
		ТекстСообщения = НСтр("ru = 'Первый символ Part Period не должен быть больше 2'; 
								|en = 'The first character Part Period must not be more than 2.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	Если Число(ПервыйСимвол) = 0 тогда
		ТекстСообщения = НСтр("ru = 'Первый символ Part Period не может быть равен 0'; 
								|en = 'The first character of Part Period cannot be 0.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	
	ЧетвертыйСимвол = Сред(ПартПериод, 4, 1); 
	Если Число(ЧетвертыйСимвол) > 1 тогда
		ТекстСообщения = НСтр("ru = 'Четвертый символ Part Period не должен быть больше 1'; 
							|en = 'The Fourth character Part Period must not be more than 1.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	Если Число(ЧетвертыйСимвол) = 1 тогда
		ПятыйСимвол = Сред(ПартПериод, 5, 1); 
		Если Число(ПятыйСимвол) > 2 тогда
			ТекстСообщения = НСтр("ru = 'Пятый символ Part Period не должен быть больше 2'; 
								|en = 'The fifth character Part Period must not be more than 2.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	СедьмойСимвол = Сред(ПартПериод, 7, 1);
	Если Число(СедьмойСимвол) > 4 тогда
		ТекстСообщения = НСтр("ru = 'Седьмой символ Part Period не должен быть больше 4'; 
							|en = 'The seventh character Part Period must not be more than 4.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	Если Число(СедьмойСимвол) = 0 тогда
		ТекстСообщения = НСтр("ru = 'Седьмой символ Part Period не должен быть равен 0'; 
							|en = 'The seventh character Part Period cannot be 0.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	Возврат Отказ;
КонецФункции
//rarus BProg_Gladkov 13.01.2020 0014560 ---