//rarus tenkam 14.03.2017 mantis 7623 +++
&НаСервереБезКонтекста
Функция ПолучитьМассивИзделий(СписокШассиСтрока, МассивНенайденных = Неопределено)
	МассивНомерШасси = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокШассиСтрока, Символы.ПС, Истина, Истина);
	МассивИзделий = Новый Массив;
	Для Каждого ТекНомерШасси Из МассивНомерШасси Цикл
		ТекИзделие = Справочники.Scan_Изделия.НайтиПоРеквизиту("НомерИзделия",ТекНомерШасси);
		Если ЗначениеЗаполнено(ТекИзделие) Тогда
			МассивИзделий.Добавить(ТекИзделие);
		Иначе
			МассивНенайденных.Добавить(ТекНомерШасси);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивИзделий;
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	Если СокрЛП(ПолеВвода) = "" Тогда
		//rarus FominskiyAS 19.04.2019  mantis 14191 +++
		//Сообщить("Вставьте номера шасси, которые нужно загрузить!");
		Сообщить(НСтр("ru = 'Вставьте номера шасси, которые нужно загрузить!'; en = 'Insert the chassis number, you need to download!'"));
		//rarus FominskiyAS 19.04.2019  mantis 14191 ---  
		Возврат;
	КонецЕсли;
	МассивНенайденных = Новый Массив;
	МассивИзделий = ПолучитьМассивИзделий(ПолеВвода, МассивНенайденных);
	СтруктураВозврата = Новый Структура("МассивИзделий", МассивИзделий);
	СтруктураВозврата.Вставить("МассивНенайденных", МассивНенайденных);
	СтруктураВозврата.Вставить("ОчиститьИзделия", ОчиститьИзделияПередЗагрузкой);
	Закрыть(СтруктураВозврата);
КонецПроцедуры
//rarus tenkam 14.03.2017 mantis 7623 ---

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scan_СборСтатистики.Scan_ПриОткрытииФормы(ЭтотОбъект.ИмяФормы); // Rarus tenkam 11.04.2022 mantis 18433 +
КонецПроцедуры
