//rarus kolg 20.11.2017 TLMS 9428 ++

// Модуль формы списка справочника "Scan_СтатусыЗаявокНаДействие"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//Отображает цвет строки соответствующего статуса
//
&НаСервере
Процедура ОбновлениеУсловногоОформленияСтрок()
	
	//Обновление условного оформления строк в ТЧ
	СправочникМенеджер = Справочники.Scan_СтатусыЗаявокНаРаботы;
	Scan_УправлениеДиалогомСервер.СформироватьУсловноеОформление(ЭтаФорма, СправочникМенеджер);
	
КонецПроцедуры 

// Обработчик события возникающего на клиенте при изменении строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ОбновлениеУсловногоОформленияСтрок();

КонецПроцедуры  // СписокПриИзменении()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновлениеУсловногоОформленияСтрок();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПервоначальноеЗаполнениеЭлементовНаСервере()
	
	Справочники.Scan_СтатусыЗаявокНаРаботы.ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервоначальноеЗаполнениеЭлементов(Команда)
	ПервоначальноеЗаполнениеЭлементовНаСервере();
КонецПроцедуры


//rarus kolg 20.11.2017 TLMS 9428 --

&НаКлиенте
Процедура ПереместитьЭлементВверх()
	
	// rarus agar 25.05.2021 16927 ++
	//Если Не ВозможноПеремещениеЭлемента(Элементы.Список.ТекущиеДанные.Ссылка, "Вверх") Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Перемещение данного вида контактной информации не предусмотрено'"));
	//	Возврат;
	//КонецЕсли;
	//
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(Список, Элементы.Список);
	// rarus agar 25.05.2021 16927 --
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз()
	
	// rarus agar 25.05.2021 16927 ++
	//Если Не ВозможноПеремещениеЭлемента(Элементы.Список.ТекущиеДанные.Ссылка, "Вниз") Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Перемещение данного вида контактной информации не предусмотрено'"));
	//	Возврат;
	//КонецЕсли;
	//
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВнизВыполнить(Список, Элементы.Список);
	// rarus agar 25.05.2021 16927 --
	
КонецПроцедуры

//rarus vikhle 05.07.2021 апк ++ 
//&НаСервере
//Функция ВозможноПеремещениеЭлемента(ТекущийЭлемент, Направление)
//	
//	// rarus agar 25.05.2021 16927 ++
//	//СоседнийЭлемент = НастройкаПорядкаЭлементовСлужебный.СоседнийЭлемент(ТекущийЭлемент, Список, Направление);
//	//
//	//Возврат СоседнийЭлемент = Неопределено Или Не (ТекущийЭлемент.ЗапретитьРедактированиеПользователем Или СоседнийЭлемент.ЗапретитьРедактированиеПользователем);
//	// rarus agar 25.05.2021 16927 --
//	
//КонецФункции
//rarus vikhle 05.07.2021 апк --

//rarus FominskiyAS 27.02.2019  mantis 13863 +++

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//rarus FominskiyAS 27.02.2019  mantis 13863 ---

