//rarus tenkam 11.12.2017 mantis 11952 +++

Функция ПолучитьРаботыПоКоду(КодНеисправнойДетали) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот.Работа КАК Работа
	               |ИЗ
	               |	РегистрСведений.Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот КАК Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот
	               |ГДЕ
	               |	Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот.КодНеисправнойДетали = &КодНеисправнойДетали";
	Запрос.УстановитьПараметр("КодНеисправнойДетали", КодНеисправнойДетали);
	Результат = Запрос.Выполнить();
	МассивРабот = Новый Массив;
	Если НЕ Результат.Пустой() Тогда
		МассивРабот = Результат.Выгрузить().ВыгрузитьКолонку("Работа");
	КонецЕсли;
	Возврат МассивРабот;
КонецФункции

//rarus tenkam 11.12.2017 mantis 11952 ---
