//rarus tenkam 10.08.2017 mantis 10589 +++
Функция ПолучитьПоследниеДанныеРегистра(УслугаПакета, ЛогистическийТип, СпособДоставки, КолеснаяФормула, АдресПолучения, АдресДоставки,НаДату = Неопределено) Экспорт
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.ТарифУказанВручную,
		|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость
		|ИЗ
		|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(
		|			&НаДату,
		|			УслугаПакета = &УслугаПакета
		|				И ЛогистическийТип = &ЛогистическийТип
		|				И КолеснаяФормула = &КолеснаяФормула
		|				И СпособДоставки = &СпособДоставки
		|				И АдресПолучения = &АдресПолучения
		|				И АдресДоставки = &АдресДоставки) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних";
	
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.УстановитьПараметр("АдресПолучения", АдресПолучения);
	Запрос.УстановитьПараметр("КолеснаяФормула", КолеснаяФормула);
	Запрос.УстановитьПараметр("ЛогистическийТип", ЛогистическийТип);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	Запрос.УстановитьПараметр("УслугаПакета", УслугаПакета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Стоимость",Неопределено);
	СтруктураВозврата.Вставить("ТарифУказанВручную",Ложь);
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураВозврата.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
		СтруктураВозврата.ТарифУказанВручную = ВыборкаДетальныеЗаписи.ТарифУказанВручную;
	КонецЕсли;
	Возврат СтруктураВозврата;		
КонецФункции
//rarus tenkam 10.08.2017 mantis 10589 ---