//rarus ozhnik 15888 27.08.2020 + 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	получитьРодителяВладельца(ВладелецФормы);	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРодителяВладельца(ВладелецФормы)
	
	Если ВладелецФормы <> Неопределено и не типЗНЧ(ВладелецФормы) = тип("УправляемаяФорма")  Тогда
		Если типЗНЧ(ВладелецФормы) = тип("ГруппаФормы") и типЗНЧ(ВладелецФормы.Вид) = тип("ВидГруппыФормы") и ВладелецФормы.Вид = ВидГруппыФормы.Страница Тогда
			Если стрнайти(ВладелецФормы.Имя,"Страница_СоглашенияОПоставке")  Тогда
				УстановитьОтборСпискаСоглашениеОПоставке();
			КонецЕсли; 
			Если стрнайти(ВладелецФормы.Имя,"Страница_СпециальныеУсловия")  Тогда
				УстановитьОтборСпискаСпециальныеУсловия();
			КонецЕсли; 
		Иначе
			получитьРодителяВладельца(ВладелецФормы.Родитель);	
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаСоглашениеОПоставке()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ИспользуетсяВСоглашенииОПоставке",истина,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаСпециальныеУсловия()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ИспользуетсяВСпециальныхУсловиях",истина,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	
КонецПроцедуры

//rarus ozhnik 15888 27.08.2020 + 

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеФиксированногоОтбора();
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --