//rarus vikhle 04.08.2020 mt 16181 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если НЕ Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ПроектЗаявкиНаСОП Тогда
	//	 Элементы.Цены.Видимость = Ложь;
	//КонецЕсли;
	//Элементы.Цены.Видимость = Параметры.РольИсполнителя = Справочники.РолиИсполнителей.  
	
	//rarus vikhle 28.02.2021 mt 17186 +++
	Если Параметры.Свойство("РольИсполнителя") Тогда 
		Если Параметры.РольИсполнителя = Справочники.РолиИсполнителей.НайтиПоНаименованию("Дилер") Тогда
			Элементы.УсловияОплаты.Видимость	= Ложь;
			Элементы.РазделениеЗаявки.Видимость = Ложь; //rarus vikhle 29.09.2021 mt 18076
		Иначе
			Элементы.ОбщиеДанныеЗаявки.Видимость = Ложь; //rarus vikhle 24.05.2021 m 17653
		КонецЕсли;
		
		// rarus kabany 13.07.2021 17992 ++
		//rarus vikhle 25.05.2021 m 17653 +++
		//Если Параметры.Свойство("Статус")
		//	И НЕ Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НачатоОформлениеСОП
		//	И НЕ Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Оформлен Тогда
		//	Элементы.ОбщиеДанныеЗаявки.ТолькоПросмотр = Истина;
		//КонецЕсли;
		//rarus vikhle 25.05.2021 m 17653 ---
		
		СтатусПодходитОКП = Ложь;
		Если Параметры.Свойство("Статус") Тогда
			
			// rarus vikhle 11.10.2021 m 18364 +++
			Если Параметры.Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ЗапросНаИзменениеСОП Тогда
				СтатусЗаявкиНаСОП = Справочники.Scan_СоглашенияОПоставке.ПолучитьСтатусДоЗапросаИзменений(Параметры.Ссылка);	
			Иначе	
				СтатусЗаявкиНаСОП = Параметры.Статус; 
			КонецЕсли;
			// rarus vikhle 11.10.2021 m 18364 ---
			
			Если //СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НачатоОформлениеСОП // rarus vikhle 11.10.2021 m 18364
				СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Оформлен
				ИЛИ СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_ИсполненЧастично Тогда //rarus vikhle 12.08.2021 m 18147
				СтатусПодходитОКП = Истина;
			// rarus vikhle 11.10.2021 m 18364 +++
			//Иначе
			//	Элементы.ОбщиеДанныеЗаявки.ТолькоПросмотр = Истина;	
			// rarus vikhle 11.10.2021 m 18364 ---
			КонецЕсли;
		
		    // rarus vikhle 11.10.2021 m 18364 +++
			Если НЕ (СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.НачатоОформлениеСОП
				ИЛИ СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_Оформлен
				ИЛИ СтатусЗаявкиНаСОП = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.СОП_ИсполненЧастично) Тогда
				Элементы.ОбщиеДанныеЗаявки.ТолькоПросмотр = Истина;
			КонецЕсли;	
			// rarus vikhle 11.10.2021 m 18364 ---
		
		КонецЕсли;		
		// rarus kabany 13.07.2021 17992 --
		
		//Элементы.Сроки.Видимость = Параметры.РольИсполнителя = Справочники.РолиИсполнителей.НайтиПоНаименованию("Сотрудник отдела клиентской поддержки") //rarus vikhle 01.04.2021 mt 17472	
		//rarus vikhle 26.05.2021 m 17780 +++
		НаименованиеРоли = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.РольИсполнителя,"Наименование"));
		Если НаименованиеРоли = "Сотрудник отдела клиентской поддержки" ИЛИ НаименованиеРоли = "Руководитель отдела клиентской поддержки" Тогда
			Элементы.Сроки.Видимость = Истина;
			// rarus kabany 13.07.2021 17992 ++
			Элементы.ИзменитьУсловияДоговора.Видимость = ?(СтатусПодходитОКП, Истина, Ложь);
			// rarus kabany 13.07.2021 17992 --
		Иначе
			Элементы.ИзменитьУсловияДоговора.Видимость = Ложь;			
			Элементы.Сроки.Видимость = Ложь; // rarus kabany 13.07.2021 17992 +
		КонецЕсли;
		//rarus vikhle 26.05.2021 m 17780 ---
	КонецЕсли;	
	//rarus vikhle 28.02.2021 mt 17186 ---
			
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если НЕ Состав 
		И НЕ Цены 
		И НЕ Условия 
		И НЕ Сроки //rarus vikhle 01.04.2021 mt 17472 добавил сроки 
		И НЕ ОбщиеДанныеЗаявки //24.05.2021 vikhle 17653 + общиеданные.. 
		И НЕ ИзменитьУсловияДоговора // rarus kabany 13.07.2021 17992 ++ добавил ИзменитьУсловияДоговора 
		И НЕ РазделениеЗаявки //rarus vikhle 29.09.2021 mt 18076
		Тогда
		ОчиститьСообщения();
		Сообщить(Нстр("ru = 'Не выбран тип корректировки.'; en = 'Choose adjustment type'"));
	Иначе	
		//rarus vikhle 29.09.2021 mt 18076 +++
		//ПараметрыЗакрытия = Новый Структура("Условия,Состав,Цены,Сроки,ОбщиеДанныеЗаявки,ИзменитьУсловияДоговора",Условия,Состав,Цены,Сроки,ОбщиеДанныеЗаявки,ИзменитьУсловияДоговора); //rarus vikhle 01.04.2021 mt 17472 добавил сроки 24.05.2021 vikhle 17653 + общиеданные.. // rarus kabany 13.07.2021 17992 ++ добавил ИзменитьУсловияДоговора 
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Условия", Условия);
		ПараметрыЗакрытия.Вставить("Состав", Состав);
		ПараметрыЗакрытия.Вставить("Цены", Цены);
		ПараметрыЗакрытия.Вставить("Сроки", Сроки);
		ПараметрыЗакрытия.Вставить("ОбщиеДанныеЗаявки", ОбщиеДанныеЗаявки);
		ПараметрыЗакрытия.Вставить("ИзменитьУсловияДоговора", ИзменитьУсловияДоговора);
		ПараметрыЗакрытия.Вставить("РазделениеЗаявки", РазделениеЗаявки);
		//rarus vikhle 29.09.2021 mt 18076 ---
		Закрыть(ПараметрыЗакрытия);	
	КонецЕсли;	
КонецПроцедуры
//rarus vikhle 04.08.2020 mt 16181 +++
