//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Scan_ПраваИНастройки.Scan_ПолучитьПраваИНастройкиПользователя(Пользователи.ТекущийПользователь(),
		ПланыВидовХарактеристик.Scan_ПраваИНастройки.РазрешитьИзменятьПараметрыСогласования) Тогда //Rarus bonmak 28.07.2022 18726 АПК первый параметр ПользователиКлиентСервер.ТекущийПользователь()
		
		Элементы.ФормаКоманднаяПанель.ТолькоПросмотр = Истина;
		Элементы.СписокКоманднаяПанель.ТолькоПросмотр = Истина;
		Элементы.Список.КонтекстноеМеню.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти