//rarus tenkam 20.06.2016 mantis 6926 ++
&НаКлиенте
Процедура КомандаОК(Команда)
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		//rarus FominskiyAS 19.04.2019  mantis 14191 +++
		//Сообщить("Файл не выбран!");
		Сообщить(Нстр("ru = 'Файл не выбран!'; en = 'The file is not selected!'"));
		//rarus FominskiyAS 19.04.2019  mantis 14191 ---
		Возврат;	
	КонецЕсли;
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ПутьКФайлу", ПутьКФайлу);
	Закрыть(ПараметрыНастройки);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// rarus agar 05.11.2020 16010 ++
	
	// rarus tenkam 09.04.2019 mantis 14195 +++
	//#Если ВебКлиент Тогда
	//	Результат = ПодключитьРасширениеРаботыСФайлами();
	//	
	//	//если подключить не удалось - требуется установить его (в первый раз)
	//	Если НЕ Результат Тогда
	//		//устанавливаем
	//		Оповещение = Новый ОписаниеОповещения("УстановкаРасширенияЗавершение", ЭтотОбъект, );
	//		НачатьУстановкуРасширенияРаботыСФайлами(Оповещение);
	//		Возврат;
	//	КонецЕсли;
	//#КонецЕсли
	// rarus tenkam 09.04.2019 mantis 14195 ---
	
	Оповещение = Новый ОписаниеОповещения("УстановкаРасширенияЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение);
	
	//Режим = РежимДиалогаВыбораФайла.Открытие; 
	//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	//ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	//Фильтр = НСтр("ru = 'Таблица XLSX(*.xlsx)'"); 
	//ДиалогОткрытияФайла.Фильтр = Фильтр; 
	//ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	//ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	//
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииДиалогаВыбораФайла", ЭтотОбъект);
	//ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
	// rarus agar 05.11.2020 16010 --
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииДиалогаВыбораФайла(ВыбранныйФайл, Параметры) Экспорт
	
	Если ВыбранныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныйФайл[0];
	ПутьКФайлу = ПолноеИмяФайла;

КонецПроцедуры

// rarus tenkam 09.04.2019 mantis 14195 +++
&НаКлиенте
// rarus agar 05.11.2020 16010 ++
//Процедура УстановкаРасширенияЗавершение(ДополнительныеПараметры) Экспорт
Процедура УстановкаРасширенияЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	//если не удалось установить - то повторный вызов подключения будет неудачный
	//Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
	//	//сообщаем об ошибке и прерываем работу программы
	//	ВызватьИсключение "Ошибка. Ваш браузер не поддерживает работу с файлами.";
	//КонецЕсли;
	// rarus agar 05.11.2020 16010 --
	
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	Фильтр = НСтр("ru = 'Таблица XLSX(*.xlsx)'"); 
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииДиалогаВыбораФайла", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scan_СборСтатистики.Scan_ПриОткрытииФормы(ЭтотОбъект.ИмяФормы); // Rarus tenkam 11.04.2022 mantis 18433 +
КонецПроцедуры
// rarus tenkam 09.04.2019 mantis 14195 ---

