&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus BProg_Dekin 14.03.2020 mantis 0014177 +-
	
	ИмяМетода 			= "GetListOfSpecificationViewType";
	СообщениеОбОшибке 	= "";
	Отказ 				= Ложь;
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	
	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	ТекстОтвета = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	Если НЕ Отказ Тогда
		Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникВидыПредставленийСпецификаций(ТекстОтвета, Отказ, СообщениеОбОшибке, ИмяСобытияЖурналаРегистрации, ИмяМетода);
	КонецЕсли;
	Элементы.Список.Обновить(); 
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьЭлемент(Команда)
	ОбновитьЭлементНаСервере();
КонецПроцедуры 