
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//rarus vikhle 19.03.2021 mt 17479 +++
	Запись.Пользователь			= Пользователи.ТекущийПользователь(); 
	Запись.ИспользоватьВОтчетах = Истина;
	//rarus vikhle 19.03.2021 mt 17479 ---
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//rarus vikhle 21.03.2021 mt 17479 +++
	Если НЕ ТекущийОбъект.ИспользоватьВОтчетах Тогда 
		ТекущийОбъект.ДатаКорректировки = ТекущаяДатаСеанса();
	КонецЕсли;	
	//rarus vikhle 21.03.2021 mt 17479 ---
	
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//rarus vikhle 08.09.2021 mt 18212 +++
	Если НЕ РегистрыСведений.Scan_ХарактеристикиЗаказовНаЗавод.ЭтоЗаказFirm(ТекущийОбъект.ЗаказНаЗавод) Тогда
		Отказ = Истина;
		ВывестиСообщениеПол(Нстр("ru = 'У заказа %1 тип заказа отличается от Firm. Запись не добавлена в регистр Order Intake.'"),,,,,
							ТекущийОбъект.ЗаказНаЗавод);
		Возврат;
	КонецЕсли;	
	//rarus vikhle 08.09.2021 mt 18212 ---
	
	РегистрыСведений.Scan_OrderIntake.СоздатьЗаписьПоOI(ТекущийОбъект);//rarus vikhle 26.03.2021 mt 17479
		
КонецПроцедуры

