//rarus ozhnik 15888 18.06.2020 + 
&НаСервере
Процедура ОбновитьСтатусыНаСервере() 	
	ИмяМетода = "GetListOfStatuses";
	СообщениеОбОшибке = "";
	Отказ = Ложь;
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	СтруктураПараметров.ВидСтатуса = "СтатусыQuotation";
	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	Если НЕ Отказ Тогда
		СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникСтатусыКП(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры 
&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	ОбновитьСтатусыНаСервере();
КонецПроцедуры 
//rarus ozhnik 15888 18.06.2020 + 