//rarus tenkam 04.10.2017 mantis 9426 +++
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Проверим уникальность кода дефекта
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_КодыДефектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_КодыДефектов КАК Scan_КодыДефектов
		|ГДЕ
		|	Scan_КодыДефектов.КодДефекта = &КодДефекта
		|	И Scan_КодыДефектов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("КодДефекта", КодДефекта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю();
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщение.Текст = "Код дефекта не уникальный! Код дефекта " + ВыборкаДетальныеЗаписи.Ссылка + " имеет такой же код.";
		Сообщение.Текст = НСтр("ru = 'Код дефекта не уникальный! Код дефекта '; en = 'Defect code is not unique! Defect code ""'") + ВыборкаДетальныеЗаписи.Ссылка + НСтр("ru = ' имеет такой же код.'; en = ' has the same code.'");
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Сообщение.Поле = "КодДефекта";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
//rarus tenkam 04.10.2017 mantis 9426 ---
