//rarus tenkam 04.11.2017 mantis 11952 +++
Функция ПолучитьКоличествоПоступления(Склад, Изделие, Комплектующие, ЗаявкаНаКомплектующие, Регистратор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Scan_ДвиженияКомплектующих.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.Scan_ДвиженияКомплектующих КАК Scan_ДвиженияКомплектующих
		|ГДЕ
		|	Scan_ДвиженияКомплектующих.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И Scan_ДвиженияКомплектующих.Склад = &Склад
		|	И Scan_ДвиженияКомплектующих.Изделие = &Изделие
		|	И Scan_ДвиженияКомплектующих.Комплектующие = &Комплектующие
		|	И Scan_ДвиженияКомплектующих.ЗаявкаНаКомплектующие = &ЗаявкаНаКомплектующие
		|	//ИсключитьРегистратор";
	
	Запрос.УстановитьПараметр("ЗаявкаНаКомплектующие", ЗаявкаНаКомплектующие);
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("Комплектующие", Комплектующие);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если ЗначениеЗаполнено(Регистратор) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ИсключитьРегистратор", "И Scan_ДвиженияКомплектующих.Регистратор <> &Регистратор");
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Количество) Тогда
			Возврат ВыборкаДетальныеЗаписи.Количество;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьКоличествоСписания(Склад, Изделие, Комплектующие, ЗаявкаНаКомплектующие ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Scan_ДвиженияКомплектующих.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.Scan_ДвиженияКомплектующих КАК Scan_ДвиженияКомплектующих
		|ГДЕ
		|	Scan_ДвиженияКомплектующих.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И Scan_ДвиженияКомплектующих.Склад = &Склад
		|	И Scan_ДвиженияКомплектующих.Изделие = &Изделие
		|	И Scan_ДвиженияКомплектующих.Комплектующие = &Комплектующие
		|	И Scan_ДвиженияКомплектующих.ЗаявкаНаКомплектующие = &ЗаявкаНаКомплектующие
		|	//ИсключитьРегистратор";
	
	Запрос.УстановитьПараметр("ЗаявкаНаКомплектующие", ЗаявкаНаКомплектующие);
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("Комплектующие", Комплектующие);
	Запрос.УстановитьПараметр("Склад", Склад);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Количество) Тогда
			Возврат ВыборкаДетальныеЗаписи.Количество;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

//13.02.2018 +++
Функция ПолучитьКоличествоОстаток(Склад, Изделие, Комплектующие, ЗаявкаНаКомплектующие) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ДвиженияКомплектующихОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Scan_ДвиженияКомплектующих.Остатки КАК Scan_ДвиженияКомплектующихОстатки
		|ГДЕ
		|	Scan_ДвиженияКомплектующихОстатки.Склад = &Склад
		|	И Scan_ДвиженияКомплектующихОстатки.Изделие = &Изделие
		|	И Scan_ДвиженияКомплектующихОстатки.Комплектующие = &Комплектующие
		|	И Scan_ДвиженияКомплектующихОстатки.ЗаявкаНаКомплектующие = &ЗаявкаНаКомплектующие";
	
	Запрос.УстановитьПараметр("ЗаявкаНаКомплектующие", ЗаявкаНаКомплектующие);
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("Комплектующие", Комплектующие);
	Запрос.УстановитьПараметр("Склад", Склад);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КоличествоОстаток) Тогда
			Возврат ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
//13.02.2018 ---

//rarus tenkam 04.11.2017 mantis 11952 ---