// rarus kabany 03.09.2021 OFMS (АПК) +++
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Формирование заголовка отчета в зависимости от заданого периода
	ПараметрЗаголовокОтчета = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок"); 
	Если НЕ ПараметрЗаголовокОтчета = Неопределено Тогда
		ПараметрЗаголовокОтчета.Использование = Истина;
		ПараметрЗаголовокОтчета.Значение = НСтр("ru='Покупка продуктов у Скания-Питер (scania)'");
		
		ИсполняемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		ПараметрПериод = ИсполняемыеНастройки.ПараметрыДанных.Элементы.Найти("СтандартныйПериод"); 
		Если НЕ ПараметрПериод = Неопределено Тогда
			ДатаНачала = ПараметрПериод.Значение.ДатаНачала;
			ДатаОкончания = ПараметрПериод.Значение.ДатаОкончания;
			Если ДатаНачала <> Дата(1,1,1) И ДатаОкончания <> Дата(1,1,1) И ДатаНачала <> НачалоДня(ДатаОкончания) Тогда
				ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " с " + Формат(ДатаНачала,"ДЛФ=ДД") + " по " 
													+ Формат(ДатаОкончания,"ДЛФ=ДД");  	
			ИначеЕсли ДатаНачала = Дата(1,1,1) И ДатаОкончания <> Дата(1,1,1) Тогда   	
				ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " по " + Формат(ДатаОкончания,"ДЛФ=ДД");	
			ИначеЕсли ДатаНачала <> Дата(1,1,1) И ДатаОкончания = Дата(1,1,1) Тогда   	
				ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " с " + Формат(ДатаНачала,"ДЛФ=ДД") 
													+ " по " + Формат(ТекущаяДатаСеанса(),"ДЛФ=ДД"); // rarus kabany 03.09.2021 OFMS (АПК)	// было ТекущаяДата() 
			ИначеЕсли ДатаНачала = НачалоДня(ДатаОкончания) И ДатаНачала <> Дата(1,1,1) И ДатаОкончания <> Дата(1,1,1) Тогда 	
				ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " на " +  Формат(ДатаНачала,"ДЛФ=ДД"); 	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
	     	
#КонецЕсли
// rarus kabany 03.09.2021 OFMS (АПК) ---