//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//rarus vikhle 12.01.2021 mt 17056 +++
	Если НЕ Окно = Неопределено Тогда
		Для Каждого ТекущееОкно Из Окно.Содержимое Цикл
			Если ТекущееОкно.ИмяФормы = "Справочник.Scan_СоглашенияОПоставке.Форма.ФормаЭлемента" Тогда
				СписокСвязанныхОбъектов = Scan_ВспомогательныеФункцииСервер.ПолучитьСтруктуруПодчиненности(ТекущееОкно.Объект.Ссылка, "Основание", Истина); //rarus vikhle 06.10.2021 mt 18076 + 2й параметр
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
				                                                                        "Объект",
				                                                                        СписокСвязанныхОбъектов,
				                                                                        ВидСравненияКомпоновкиДанных.ВСписке);
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	
	Иначе
		//rarus vikhle 10.11.2021 m 18471 +++
		ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();	
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
			
			ПользовательСотрудник = Scan_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ПользовательСотрудник");
						
			Если НЕ ПользовательСотрудник И НЕ ЭтоПользовательСПолнымиПравами() Тогда
				ВызватьИсключение НСтр("ru = 'Открытие формы доступно только для сотрудников Скания Русь и пользователей с полными правами.'");					
			КонецЕсли;	
			
		КонецЕсли;	
		//rarus vikhle 10.11.2021 m 18471 ---
	КонецЕсли;
	//rarus vikhle 12.01.2021 mt 17056 ---
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЭтоПользовательСПолнымиПравами() //rarus vikhle 10.11.2021 m 18471 +++
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции //rarus vikhle 10.11.2021 m 18471 ---	 

#КонецОбласти