
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//rarus vikhle 18.11.2021 m 18340 +++
	ТекущийПользователь = Пользователи.ТекущийПользователь();	
	БыстрыйДоступ		= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПрайсЛисты, 
																			"НеАктуален", 
																			Ложь, 
																			ВидСравненияКомпоновкиДанных.Равно,,
																			Истина, 
																			БыстрыйДоступ, 
																			Строка(Новый УникальныйИдентификатор));	
		
	//rarus vikhle 18.11.2021 m 18340 --
	Scan_СборСтатистики.Scan_ПриОткрытииОбработки(РеквизитФормыВЗначение("Объект").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +
	
КонецПроцедуры

#КонецОбласти


