//rarus tenkam 17.11.2017 mantis 9427 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаПечать;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество() <> 0 Тогда
		
		// rarus tenkam 10.04.2019 mantis 14195 +++
		
		//ВыбранныеФайлы = Новый Массив;
		//
		//ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		//ВыборФайла.МножественныйВыбор = Истина;
		//ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'");
		//ВыборФайла.Фильтр = НСтр("ru = 'Все файлы'") + " (*.*)|*.*";
		//Если ВыборФайла.Выбрать() Тогда
		//	ВыбранныеФайлы = ВыборФайла.ВыбранныеФайлы;
		//КонецЕсли;
		//
		//Если ВыбранныеФайлы.Количество() <> 0 Тогда
		//	ДопПараметры = Новый Структура;
		//	ДопПараметры.Вставить("ИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
		//	ДопПараметры.Вставить("НеОткрыватьКарточкуПослеСозданияИзФайла", Истина);
		//	ДопПараметры.Вставить("ВыбранныеФайлы", ВыбранныеФайлы);
		//	
		//	Для Каждого ТекДокумент Из Элементы.Список.ВыделенныеСтроки Цикл
		//		ДопПараметры.Вставить("ВладелецФайла", ТекДокумент);
		//		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьФайлыРасширениеПредложено", ПрисоединенныеФайлыСлужебныйКлиент, ДопПараметры);
		//		ФайловыеФункцииСлужебныйКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
		//	КонецЦикла;		
		//КонецЕсли;
		
		РаботаСФайламиКлиент.ДобавитьФайлы(Элементы.Список.ВыделенныеСтроки, ЭтаФорма.УникальныйИдентификатор, , );
	
		// rarus tenkam 10.04.2019 mantis 14195 ---

		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПодтверждение(Команда)
	МассивВыбранныхСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
		Сообщить("Не выбран ни один документ");                                                                       
		Возврат;
	ИначеЕсли МассивВыбранныхСтрок.Количество() > 1 Тогда
		Сообщить("Выберите один документ");                            
	Иначе
		СнятьПодтверждениеНаСервере(МассивВыбранныхСтрок[0]);
	КонецЕсли;
	Элементы.Список.Обновить(); КонецПроцедуры

&НаСервере
Процедура СнятьПодтверждениеНаСервере(ДокументСсылка)
	СообщениеОбОшибке = "";
	ВсеОк = Документы.Scan_ЧекЛистТехническогоСостоянияИзделия.СнятьПодтверждениеКТС(ДокументСсылка, СообщениеОбОшибке);
	Если НЕ ВсеОк Тогда
		Сообщить(СообщениеОбОшибке);
	Иначе
		Сообщить("У документа " + ДокументСсылка.Номер + " от " + ТекущаяДата() + " снят признак ""КТС выполнен"".");
	КонецЕсли;
КонецПроцедуры

//rarus tenkam 17.11.2017 mantis 9427 ---

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти
