
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//rarus vikhle 18.11.2021 m 18340 +++
	ОтображениеФиксированногоОтбора();
	//rarus vikhle 18.11.2021 m 18340 ---
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтображениеФиксированногоОтбора() //rarus vikhle 18.11.2021 m 18340 +++
	
	ПредставлениеОбъекта = Метаданные.Документы.Scan_ПрайсЛистАренда.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры //rarus vikhle 18.11.2021 m 18340 ---

#КонецОбласти


