
&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus bonmak 04.09.2019 14442 ++
	Если ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
		// rarus tenkam 19.09.2019 mantis 14442 +++
		ИмяМетода = "GetProductSubType";
		СообщениеОбОшибке = "";
		Отказ = Ложь;
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода ,Ложь);
		СтруктураПараметров.Вставить("GUID", Объект.IDExternalSystem);
		ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
		ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
		Если НЕ Отказ Тогда
			ТекСсылка = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода,"Scan_МаркетинговыеТипыПродуктов");
		КонецЕсли;
		// rarus tenkam 19.09.2019 mantis 14442 ---
	
		ЭтаФорма.Прочитать();
		УправлениеДиалогомНаСервере();
	КонецЕсли
КонецПроцедуры //rarus bonmak 04.09.2019 14442 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 04.09.2019 14442 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus bonmak 04.09.2019 14442 --

&НаСервере
Процедура УправлениеДиалогомНаСервере() //rarus bonmak 04.09.2019 14442 ++	
	Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));

	Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
		Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	КонецЕсли;
	
	Элементы.ТипПродуктЛогистический.Доступность = РольДоступна("ПолныеПрава");
КонецПроцедуры //rarus bonmak 04.09.2019 14442 --

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 04.09.2019 14442 ++
	Если Объект.Ссылка = Справочники.Scan_МаркетинговыеТипыПродуктов.ПустаяСсылка() Тогда
		ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
		Сообщить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	УправлениеДиалогомНаСервере();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры //rarus bonmak 04.09.2019 14442 --

