
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолеВладелец = Новый ПолеКомпоновкиДанных("Владелец");
	ВладелецУстановлен = Ложь;
	Для Каждого СтрокаОтбора Из Список.Отбор.Элементы Цикл
		Если СтрокаОтбора.ЛевоеЗначение = ПолеВладелец Тогда
			ВладелецУстановлен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ВладелецУстановлен Тогда
		ПоказатьПредупреждение( ,НСтр("ru = 'Справочник является подчиненным. Можно открыть из представления спецификации'; en = 'Catalog is subordinate. Can open from specification view'"));	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

#КонецОбласти

#Область СобытияКомандФормы

#КонецОбласти

#Область СобытияФормы

#КонецОбласти
