
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)//rarus bonmak 14576 30.08.2019 ++
	//rarus BProg_Dekin 19.05.2020 mantis 0015999 ++ Обращение к локальному статусу по новому имени
	//Если Объект.Ссылка = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.ПустаяСсылка() Тогда
	Если Объект.Ссылка = Справочники.Scan_ЛокальныеСтатусыПродуктов.ПустаяСсылка() Тогда
	//rarus BProg_Dekin 19.05.2020 mantis 0015999 --
		ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
		Сообщить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры //rarus bonmak 14576 30.08.2019 --

&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus bonmak 14576 30.08.2019 ++
	Если ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
	Иначе
		//нет метода для обновления	
		ЭтаФорма.Прочитать();
		УправлениеДиалогомНаСервере();
	КонецЕсли
КонецПроцедуры //rarus bonmak 14576 30.08.2019 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 14576 30.08.2019 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus bonmak 14576 30.08.2019 --

&НаСервере
Процедура УправлениеДиалогомНаСервере() //rarus bonmak 14576 30.08.2019 ++	
	Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));
	
	Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
		Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	КонецЕсли;
КонецПроцедуры //rarus bonmak 14576 30.08.2019 --
