//rarus sergei 28.09.2016 mantis 7160 ++
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ДанныеДляПечати", ПараметрКоманды);
	ПараметрыФормы.Вставить("ПечатнаяФорма","ПФ_MXL_ПокупкаУПоставщикаИПродажаТретьемуЛицу");
    ОткрытьФорму("Документ.Scan_ЗаявкаНаДействие.Форма.ФормаНастроекПечати", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//rarus sergei 28.09.2016 mantis 7160 --