
&НаСервере
Функция ПолучитьЗакрепленногоМенеджера(Дилер) Экспорт
	
	ЗакрепленныйМенеджер = Справочники.Scan_Сотрудники.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Дилер);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ЗакреплениеМенеджеровОКПЗаДилерамиСрезПоследних.Менеджер КАК Менеджер
	|ИЗ
	|	РегистрСведений.Scan_ЗакреплениеМенеджеровОКПЗаДилерами.СрезПоследних(, Дилер = &Ссылка) КАК Scan_ЗакреплениеМенеджеровОКПЗаДилерамиСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗакрепленныйМенеджер = ВыборкаДетальныеЗаписи.Менеджер;
	КонецЕсли;
	
	Возврат ЗакрепленныйМенеджер;
	
КонецФункции
