
// Модуль формы элемента справочника "Статусы калькуляций (scania)"

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЦветФона   = РеквизитФормыВЗначение("Объект").ЦветФона.Получить();
		ЦветТекста = РеквизитФормыВЗначение("Объект").ЦветТекста.Получить();
		Шрифт      = РеквизитФормыВЗначение("Объект").Шрифт.Получить();
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона   = Новый ХранилищеЗначения(ЦветФона);
	ТекущийОбъект.ЦветТекста = Новый ХранилищеЗначения(ЦветТекста);
	ТекущийОбъект.Шрифт      = Новый ХранилищеЗначения(Шрифт);
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
  
КонецПроцедуры


#КонецОбласти
