
//rarus agar 16.02.2021 17130 ++
&НаСервере
// rarus agar 24.05.2021 17130 ++
//Процедура ОбновитьЭлементНаСервере() //rarus bonmak 08.10.2019 14177 ++
Функция  ОбновитьЭлементНаСервере() 
// rarus agar 24.05.2021 17130 --
	
	ДопПараметры = Новый Структура;
	//rarus agar 16.02.2021 17130 ++
	//Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetListOfOptions(ДопПараметры);
	РезультатВызова = Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetListOfOptions(ДопПараметры);
	
	Получено     = 0;
	Обработано   = 0;
	Создано      = 0;
	Обновлено    = 0;
	НеОбработано = 0;
	
	НеобработанныеОпции = Новый Массив;
	
	Если РезультатВызова <> Неопределено Тогда
		Если ЗначениеЗаполнено(РезультатВызова.Получено) Тогда
			Получено     = РезультатВызова.Получено;
		КонецЕсли;
		Если ЗначениеЗаполнено(РезультатВызова.Обработано) Тогда
			Обработано   = РезультатВызова.Обработано;
		КонецЕсли;
		Если ЗначениеЗаполнено(РезультатВызова.Создано) Тогда
			Создано      = РезультатВызова.Создано;
		КонецЕсли;
		Если ЗначениеЗаполнено(РезультатВызова.Обновлено) Тогда
			Обновлено    = РезультатВызова.Обновлено;
		КонецЕсли;
		Если ЗначениеЗаполнено(РезультатВызова.НеОбработано) Тогда
			НеОбработано = РезультатВызова.НеОбработано;
		КонецЕсли;
		Если ЗначениеЗаполнено(РезультатВызова.НеобработанныеОпции) Тогда
			НеобработанныеОпции = РезультатВызова.НеобработанныеОпции;
		КонецЕсли;
	КонецЕсли;
	
	ВывестиСообщениеПол(НСтр("ru = 'Результаты обновления
		                           |Получено опций из 1БД: %1
								   |Обработано опций: %2
								   |Создано опций: %3
								   |Обновлено опций: %4
								   |Не обработано опций: %5'"),,,,,
								Получено, Обработано, Создано, Обновлено, НеОбработано);
	// rarus agar 24.05.2021 17130 ++
	//ВывестиСообщениеПол(НСтр("ru = 'Необработанные опции: %1'"),,,,, СтрСоединить(НеобработанныеОпции, ","));
	// rarus agar 24.05.2021 17130 --
	
	Элементы.Дерево.Обновить();
	
	ВывестиСообщениеПол(НСтр("ru = 'Окончание загрузки: %1'"),,,,, ТекущаяДата());
	//rarus agar 16.02.2021 17130 --
	
	// rarus agar 24.05.2021 17130 ++
	Возврат НеобработанныеОпцииВТабличныйДокумент(НеобработанныеОпции);
	// rarus agar 24.05.2021 17130 --
	
// rarus agar 24.05.2021 17130 ++
//КонецПроцедуры //rarus bonmak 08.10.2019 14177 --
КонецФункции
// rarus agar 24.05.2021 17130 --

// rarus agar 24.05.2021 17130 ++
&НаСервереБезКонтекста
Функция НеобработанныеОпцииВТабличныйДокумент(НеобработанныеОпции);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТекущаяОбласть = ТабличныйДокумент.Область(1, 1, 1, 1);
	ТекущаяОбласть.Текст = "Необработанные опции";
	ТекущаяОбласть.Шрифт = Новый Шрифт(,,Истина);
	
	Счетчик = 2;
	
	Для Каждого НеобработаннаяОпция Из НеобработанныеОпции Цикл
		ТекущаяОбласть = ТабличныйДокумент.Область(Счетчик, 1, Счетчик, 1);
		ТекущаяОбласть.Текст = СокрЛП(НеобработаннаяОпция);
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 08.10.2019 14177 ++
	
	//ОбновитьЭлементНаСервере();
	ВывестиСообщениеПол(НСтр("ru = 'Начало загрузки: %1'"),,,,, ТекущаяДата());
	ПодключитьОбработчикОжидания("ОбновитьЭлементНаКлиенте", 0.1, Истина);
	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ОбновитьЭлементНаКлиенте()
	
	// rarus agar 24.05.2021 17130 ++
	//ОбновитьЭлементНаСервере();
	ТабличныйДокумент = ОбновитьЭлементНаСервере();
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("НеобработанныеОпции");
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент;
	КоллекцияПечатныхФорм[0].Экземпляров       = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета     = "Необработанные опции";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
	// rarus agar 24.05.2021 17130 --
	
КонецПроцедуры
//rarus agar 16.02.2021 17130 --