
//rarus agar 28.08.2020 15696 ++
Функция ПолучитьТипыПродуктовНадстроекИОборудования() Экспорт
	
	ТипыПродуктовНадстроекИОборудования  = Новый Массив;
	ГруппаПродуктовНадстроекИОборудования = Scan_ПраваИНастройки.Scan_Право("ГруппаПродуктовНадстроекИОборудования");
	
	Если ЗначениеЗаполнено(ГруппаПродуктовНадстроекИОборудования) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ГруппаПродуктовНадстроекИОборудования", ГруппаПродуктовНадстроекИОборудования);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Scan_ТипыПродуктов.Ссылка КАК ТипПродукта
		|ИЗ
		|	Справочник.Scan_ТипыПродуктов КАК Scan_ТипыПродуктов
		|ГДЕ
		|	Scan_ТипыПродуктов.ВидПродукта.ГруппаПродукта = &ГруппаПродуктовНадстроекИОборудования";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ТипыПродуктовНадстроекИОборудования = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипПродукта");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипыПродуктовНадстроекИОборудования;
	
КонецФункции

Функция ПолучитьТипыПродуктовУслуг() Экспорт
	
	ТипыПродуктовУслуг   = Новый Массив;
	ГруппаПродуктовУслуг = Scan_ПраваИНастройки.Scan_Право("ГруппаПродуктовУслуг");
	
	Если ЗначениеЗаполнено(ГруппаПродуктовУслуг) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ГруппаПродуктовУслуг", ГруппаПродуктовУслуг);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Scan_ТипыПродуктов.Ссылка КАК ТипПродукта
		|ИЗ
		|	Справочник.Scan_ТипыПродуктов КАК Scan_ТипыПродуктов
		|ГДЕ
		|	Scan_ТипыПродуктов.ВидПродукта.ГруппаПродукта = &ГруппаПродуктовУслуг";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ТипыПродуктовУслуг = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипПродукта");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипыПродуктовУслуг;
	
КонецФункции

Функция ПолучитьТипыПродуктовНадстроекИУслуг() Экспорт
	
	МассивТиповПродуктов = Новый Массив;
	
	МассивТиповПродуктовНадстроек = ПолучитьТипыПродуктовНадстроекИОборудования();
	Для Каждого ЭлементМассива Из МассивТиповПродуктовНадстроек Цикл
		МассивТиповПродуктов.Добавить(ЭлементМассива);
	КонецЦикла;
	
	МассивТиповПродуктовУслуг = ПолучитьТипыПродуктовУслуг();
	Для Каждого ЭлементМассива Из МассивТиповПродуктовУслуг Цикл
		МассивТиповПродуктов.Добавить(ЭлементМассива);
	КонецЦикла;
	
	Возврат МассивТиповПродуктов;
	
КонецФункции
//rarus agar 28.08.2020 15696 --

//rarus vikhle 16.09.2020 mt 16526 +++
Функция ПолучитьТипыПродуктовПоНастройке(ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ТипыПродуктов.Ссылка КАК ТипПродукта
	               |ИЗ
	               |	Справочник.Scan_ТипыПродуктов КАК Scan_ТипыПродуктов
	               |ГДЕ
	               |	Scan_ТипыПродуктов.Наименование В(&ТипыПродуктовИзНастройки)";
	ЗначениеНастройки = Scan_ПраваИНастройки.Scan_Право(ИмяНастройки);
	ТипыПродуктовИзНастройки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЗначениеНастройки,",",Истина);	
	Запрос.УстановитьПараметр("ТипыПродуктовИзНастройки",ТипыПродуктовИзНастройки);
	МассивСсылокТиповПродуктов =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипПродукта");
	Возврат МассивСсылокТиповПродуктов;
	
КонецФункции	

Функция ПолучитьПризнакНаличияНастройки(ТипПродукта) Экспорт 
	МассивТиповПродуктов = Новый Массив;
	СНадстройкой = Неопределено;
	
	МассивТиповПродуктов = ПолучитьТипыПродуктовПоНастройке("ТипыПродуктовСНадстройкой");
	Если НЕ МассивТиповПродуктов.Найти(ТипПродукта) = Неопределено Тогда
		СНадстройкой = Истина;
	КонецЕсли;	
	
	Если СНадстройкой = Неопределено Тогда
		МассивТиповПродуктов = ПолучитьТипыПродуктовПоНастройке("ТипыПродуктовБезНадстройки");	
		Если НЕ МассивТиповПродуктов.Найти(ТипПродукта) = Неопределено Тогда
			СНадстройкой = Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат СНадстройкой;
КонецФункции	
//rarus vikhle 16.09.2020 mt 16526 ---



