//rarus tenkam 21.02.2017 mantis 7164 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументСсылка = Параметры.ДанныеДляПечати[0];	
	//rarus tenkam 01.11.2017 mantis 9974 +++
	ИмяПФ = Параметры.ПечатнаяФорма;	
	ЭтаФорма.Заголовок = СтрЗаменить(ЭтаФорма.Заголовок, "МХ-1", ИмяПФ);
	Элементы.ВыбритеДату.Заголовок = СтрЗаменить(Элементы.ВыбритеДату.Заголовок, "МХ-1", ИмяПФ); 
	//rarus tenkam 01.11.2017 mantis 9974 ---
	СписокДатСоставления.ЗагрузитьЗначения(ПолучитьДатыСоставления(ДокументСсылка));
	Если СписокДатСоставления.Количество() = 0 Тогда
		Сообщить("Продукты заявки не были доставлены. Проверьте документ перемещения продуктов!");
		Отказ = Истина;
	КонецЕсли;
	
	// rarus tenkam 22.09.2021 mantis 18115 +++
	Элементы.СписокДоговоров.Видимость = (ИмяПф = "М15"); 
	Попытка // Rarus tenkam 16.12.2021 mantis 18538 +
		ЗаполнитьСписокДоговоров(СписокДатСоставления[0].Значение);
	// Rarus tenkam 16.12.2021 mantis 18538 +++
	Исключение
		Сообщить("Продукты заявки не были доставлены. Проверьте документ перемещения продуктов!");
		Отказ = Истина;     		
	КонецПопытки;
	// Rarus tenkam 16.12.2021 mantis 18538 ---
	// rarus tenkam 22.09.2021 mantis 18115 ---

	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ДокументСсылка);
	
	ДатаСоставления = НачалоДня(Элементы.СписокДатСоставления.ТекущиеДанные.Значение);
	ПараметрыПечати = Новый Структура("ДатаСоставления", ДатаСоставления);
	
	// rarus tenkam 22.09.2021 mantis 18115 +++
	Если ИмяПФ = "М15" Тогда
		Если Элементы.СписокДоговоров.ТекущиеДанные <> Неопределено Тогда
			ДоговорПодряда = Элементы.СписокДоговоров.ТекущиеДанные.Значение;
			Если ЗначениеЗаполнено(ДоговорПодряда) Тогда
				ПараметрыПечати.Вставить("Договор", ДоговорПодряда);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	// rarus tenkam 22.09.2021 mantis 18115 ---
	
	//rarus tenkam 01.11.2017 mantis 9974 +++
	//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Scan_ЗаявкаНаДействие",	//Менеджер печати
	//												"МХ1",            					//Идентификатор
	//												ПараметрКоманды,        			//Объекты печати
	//												ЭтотОбъект,                			//Владелец формы - форма из которой вызывается печать
	//												ПараметрыПечати);        			//Параметры печати - произвольные параметры для передачи в менеджер печати
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Scan_ЗаявкаНаДействие",	//Менеджер печати
													ИмяПФ,            					//Идентификатор
													ПараметрКоманды,        			//Объекты печати
													ЭтотОбъект,                			//Владелец формы - форма из которой вызывается печать
													ПараметрыПечати);
	//rarus tenkam 01.11.2017 mantis 9974 ---
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатыСоставления(ЗаявкаСсылка)
	
	Запрос = Новый Запрос;
	Если ЗаявкаСсылка.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ
		ЗаявкаСсылка.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство Тогда 	//rarus tenkam 01.11.2017 mantis 9974 +
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт, ДЕНЬ) КАК ДатаДоставки
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка В
		|			(ВЫБРАТЬ
		|				Scan_ЗаявкаПеревозчикуДокументыОснования.Ссылка КАК ЗаявкаПеревозчику
		|			ИЗ
		|				Документ.Scan_ЗаявкаПеревозчику.ДокументыОснования КАК Scan_ЗаявкаПеревозчикуДокументыОснования
		|			ГДЕ
		|				Scan_ЗаявкаПеревозчикуДокументыОснования.Документ = &ЗаявкаСсылка)
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт <> &ПустаяДата
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Сторнирован = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДоставки";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Scan_ПеремещениеИзделийИзделияДляПеремещения.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки
		|ИЗ
		|	Документ.Scan_ПеремещениеИзделий.ИзделияДляПеремещения КАК Scan_ПеремещениеИзделийИзделияДляПеремещения
		|ГДЕ
		|	Scan_ПеремещениеИзделийИзделияДляПеремещения.Ссылка.ДокументОснование = &ЗаявкаСсылка
		|	И Scan_ПеремещениеИзделийИзделияДляПеремещения.ДатаДоставки <> &ПустаяДата
		|	И Scan_ПеремещениеИзделийИзделияДляПеремещения.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Scan_ПеремещениеИзделийИзделияДляПеремещения.ДатаДоставки, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДоставки";
	КонецЕсли;
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат.ВыгрузитьКолонку("ДатаДоставки");
	
КонецФункции
//rarus tenkam 21.02.2017 mantis 7164 ---

&НаСервере
Процедура ЗаполнитьСписокДоговоров(ДатаСоставления) // rarus tenkam 22.09.2021 mantis 18115 +++ 
	ВыбраннаяДата = ДатаСоставления;
	
		
	// Rarus tenkam 15.12.2021 mantis 18538 +++
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
	КонецЕсли;
	// Rarus tenkam 15.12.2021 mantis 18538 ---
	
	СписокДоговоров.Очистить();
	Запрос = Новый Запрос;
	Если ДокументСсылка.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт КАК ДатаДоставки,
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие КАК Изделие
		|ПОМЕСТИТЬ ДанныеСПродуктами
		|ИЗ
		|	Документ.Scan_ЗаявкаПеревозчику.СоставЗаявки КАК Scan_ЗаявкаПеревозчикуСоставЗаявки
		|ГДЕ
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка В
		|			(ВЫБРАТЬ
		|				Scan_ЗаявкаПеревозчикуДокументыОснования.Ссылка КАК ЗаявкаПеревозчику
		|			ИЗ
		|				Документ.Scan_ЗаявкаПеревозчику.ДокументыОснования КАК Scan_ЗаявкаПеревозчикуДокументыОснования
		|			ГДЕ
		|				Scan_ЗаявкаПеревозчикуДокументыОснования.Документ = &ЗаявкаСсылка)
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НАЧАЛОПЕРИОДА(Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт, ДЕНЬ) = &ДатаСоставления
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Scan_ЗаявкаПеревозчикуСоставЗаявки.Ссылка.Сторнирован = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.ДатаДоставкиФакт,
		|	Scan_ЗаявкаПеревозчикуСоставЗаявки.Изделие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСПродуктами.Изделие КАК Изделие,
		|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку КАК ЗаказНаЗакупку,
		|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Основной КАК Основной,
		|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку.Договор КАК ЗаказНаЗакупкуДоговор
		|ИЗ
		|	ДанныеСПродуктами КАК ДанныеСПродуктами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_ЗаказыНаЗавод.ЗаказыНаЗакупку КАК Scan_ЗаказыНаЗаводЗаказыНаЗакупку
		|		ПО ДанныеСПродуктами.Изделие.ЗаказНаЗавод = Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку) = ТИП(Документ.Scan_ЗаказНаЗакупку)
		|	И Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Кузовщик = &Кузовщик // Rarus tenkam 16.12.2021 mantis 18538 +
		|
		|УПОРЯДОЧИТЬ ПО
		|	Изделие
		|ИТОГИ ПО
		|	Изделие";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ПеремещениеИзделийИзделияДляПеремещения.ДатаДоставки КАК ДатаДоставки,
		|	Scan_ПеремещениеИзделийИзделияДляПеремещения.Изделие КАК Изделие
		|ПОМЕСТИТЬ ДанныеСПродуктами
		|ИЗ
		|	Документ.Scan_ПеремещениеИзделий.ИзделияДляПеремещения КАК Scan_ПеремещениеИзделийИзделияДляПеремещения
		|ГДЕ
		|	Scan_ПеремещениеИзделийИзделияДляПеремещения.Ссылка.ДокументОснование = &ЗаявкаСсылка
		|	И Scan_ПеремещениеИзделийИзделияДляПеремещения.ДатаДоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НАЧАЛОПЕРИОДА(Scan_ПеремещениеИзделийИзделияДляПеремещения.ДатаДоставки, ДЕНЬ) = &ДатаСоставления
		|	И Scan_ПеремещениеИзделийИзделияДляПеремещения.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Scan_ПеремещениеИзделийИзделияДляПеремещения.ДатаДоставки,
		|	Scan_ПеремещениеИзделийИзделияДляПеремещения.Изделие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСПродуктами.Изделие КАК Изделие,
		|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку КАК ЗаказНаЗакупку,
		|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку.Договор КАК ЗаказНаЗакупкуДоговор,
		|	Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Основной КАК Основной
		|ИЗ
		|	ДанныеСПродуктами КАК ДанныеСПродуктами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_ЗаказыНаЗавод.ЗаказыНаЗакупку КАК Scan_ЗаказыНаЗаводЗаказыНаЗакупку
		|		ПО ДанныеСПродуктами.Изделие.ЗаказНаЗавод = Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Scan_ЗаказыНаЗаводЗаказыНаЗакупку.ЗаказНаЗакупку) = ТИП(Документ.Scan_ЗаказНаЗакупку)
		|	И Scan_ЗаказыНаЗаводЗаказыНаЗакупку.Кузовщик = &Кузовщик // Rarus tenkam 16.12.2021 mantis 18538 +
		|
		|УПОРЯДОЧИТЬ ПО
		|	Изделие
		|ИТОГИ ПО
		|	Изделие";
	КонецЕсли;
	Запрос.УстановитьПараметр("ЗаявкаСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаСоставления", ДатаСоставления);
	// Rarus tenkam 16.12.2021 mantis 18538 +++
	Если ДокументСсылка.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство Тогда
		Запрос.УстановитьПараметр("Кузовщик", ДокументСсылка.Грузополучатель);
	Иначе
		Запрос.УстановитьПараметр("Кузовщик", ДокументСсылка.Подрядчик);
	КонецЕсли;
	// Rarus tenkam 16.12.2021 mantis 18538 ---
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзделие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИзделие.Следующий() Цикл
		// Вставить обработку выборки ВыборкаИзделие
	
		ВыборкаДетальныеЗаписи = ВыборкаИзделие.Выбрать();
		
		// Rarus tenkam 16.12.2021 mantis 18538 +++
		//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Rarus tenkam 16.12.2021 mantis 18538 ---
			Если СписокДоговоров.НайтиПоЗначению(ВыборкаДетальныеЗаписи.ЗаказНаЗакупкуДоговор) = Неопределено Тогда
				СписокДоговоров.Добавить(ВыборкаДетальныеЗаписи.ЗаказНаЗакупкуДоговор);
			КонецЕсли;
		// Rarus tenkam 16.12.2021 mantis 18538 +++
		//КонецЕсли;
		КонецЦикла;
		// Rarus tenkam 16.12.2021 mantis 18538 ---
	КонецЦикла;
	
КонецПроцедуры // rarus tenkam 22.09.2021 mantis 18115 ---

&НаКлиенте
Процедура СписокДатСоставленияПриАктивизацииСтроки(Элемент) // rarus tenkam 22.09.2021 mantis 18115 +++
	Если ИмяПФ = "М15" Тогда
		ДатаСоставления = НачалоДня(Элементы.СписокДатСоставления.ТекущиеДанные.Значение);
		Если ВыбраннаяДата <> ДатаСоставления Тогда
			ЗаполнитьСписокДоговоров(ДатаСоставления);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // rarus tenkam 22.09.2021 mantis 18115 ---
	
