//rarus tenkam 19.11.2017 mantis 9427 +++
Функция ПолучитьМассивСоставляющих(СервиснаяОперация) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_СоставляющиеСервисныхОпераций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Scan_СоставляющиеСервисныхОпераций КАК Scan_СоставляющиеСервисныхОпераций
	|ГДЕ
	|	Scan_СоставляющиеСервисныхОпераций.Владелец = &СервиснаяОперация
	|	И Scan_СоставляющиеСервисныхОпераций.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("СервиснаяОперация", СервиснаяОперация);
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивЭлементов = Новый Массив;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТабРезультат = РезультатЗапроса.Выгрузить();
		МассивЭлементов = ТабРезультат.ВыгрузитьКолонку("Ссылка");		
	КонецЕсли;
	Возврат МассивЭлементов;
КонецФункции                    
//rarus tenkam 19.11.2017 mantis 9427 ---