// rarus tenkam 06.08.2020 mantis 16181 +++
Процедура ОбработкаПроведения(Отказ, Режим) 	
		
	// регистр Scan_ПлановыеЗначенияСоставляющихЦеныПродукта
	Движения.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.Записывать = Истина;
	
	Если НЕ ДокументОтменен Тогда
		Для Каждого ТекСтрокаСкидкиНаценки Из СкидкиНаценки Цикл
			Движение = Движения.Scan_ПлановыеЗначенияСоставляющихЦеныПродукта.Добавить();
			Движение.Период = Дата;
			Движение.Продукт = Продукт;
			Движение.СоставляющаяЦены = ТекСтрокаСкидкиНаценки.СоставляющаяЦены;
			Движение.ЦенаСНДС = ТекСтрокаСкидкиНаценки.ЦенаСНДС;
			Движение.ЦенаБезНДС = ТекСтрокаСкидкиНаценки.ЦенаБезНДС;
			Движение.СоглашениеОПоставке = СоглашениеОПоставке;
			Движение.СтавкаНДС = ТекСтрокаСкидкиНаценки.СтавкаНДС;
			Движение.ХозОперация = ХозОперация;
			Движение.Пользователь = ТекСтрокаСкидкиНаценки.Пользователь;
			Движение.Комментарий = ТекСтрокаСкидкиНаценки.Комментарий;	// rarus tenkam 16.04.2021 mantis 17648 +
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_УстановкаПлановыхЦенПродукта") Тогда
		Автор = ПользователиКлиентСервер.АвторизованныйПользователь();
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//ДатаПроведения = ДанныеЗаполнения.ДатаПроведения;
		ДатаСоздания = ТекущаяДата();
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ДокументОтменен = Ложь;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Компания = ДанныеЗаполнения.Компания;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Менеджер = ДанныеЗаполнения.Менеджер;
		Организация = ДанныеЗаполнения.Организация;
		ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
		Продукт = ДанныеЗаполнения.Продукт;
		СоглашениеОПоставке = ДанныеЗаполнения.СоглашениеОПоставке;
		СпециальныеУсловия = ДанныеЗаполнения.СпециальныеУсловия;
		ХозОперация = Справочники.Scan_ХозяйственныеОперации.КорректировкаПлановыхЦенПродуктов;
		ЦенаDealerNetСоСкидкой = ДанныеЗаполнения.ЦенаDealerNetСоСкидкой;
		ЦенаRetailPriceСоСкидкой = ДанныеЗаполнения.ЦенаRetailPriceСоСкидкой;
		ШтрихКод = ДанныеЗаполнения.ШтрихКод;
		Для Каждого ТекСтрокаПрайсЛист Из ДанныеЗаполнения.ПрайсЛист Цикл
			НоваяСтрока = ПрайсЛист.Добавить();
			НоваяСтрока.СоставляющаяЦены = ТекСтрокаПрайсЛист.СоставляющаяЦены;
			НоваяСтрока.Цена = ТекСтрокаПрайсЛист.Цена;
		КонецЦикла;
		Для Каждого ТекСтрокаСкидкиНаценки Из ДанныеЗаполнения.СкидкиНаценки Цикл
			НоваяСтрока = СкидкиНаценки.Добавить();
			НоваяСтрока.Источник = ТекСтрокаСкидкиНаценки.Источник;
			НоваяСтрока.Пользователь = ТекСтрокаСкидкиНаценки.Пользователь;
			НоваяСтрока.СоставляющаяЦены = ТекСтрокаСкидкиНаценки.СоставляющаяЦены;
			НоваяСтрока.СтавкаНДС = ТекСтрокаСкидкиНаценки.СтавкаНДС;
			НоваяСтрока.ЦенаБезНДС = ТекСтрокаСкидкиНаценки.ЦенаБезНДС;
			НоваяСтрока.ЦенаСНДС = ТекСтрокаСкидкиНаценки.ЦенаСНДС;
			НоваяСтрока.Комментарий = ТекСтрокаСкидкиНаценки.Комментарий;	// rarus tenkam 16.04.2021 mantis 17648 +
		КонецЦикла;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ДокументОтменен Тогда
		Документы.Scan_УстановкаПлановыхЦенПродукта.ОткрепитьДокументОтПродукта(Ссылка);
	Иначе
		Документы.Scan_УстановкаПлановыхЦенПродукта.ЗакрепитьДокументУстановкиЦенПродукта(Ссылка);
	КонецЕсли;
КонецПроцедуры
// rarus tenkam 06.08.2020 mantis 16181 ---
    
