#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//rarus vikhle 18.11.2021 m 18340 +++
	ХозОперация = Scan_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ХозОперация");
	Если ХозОперация = ПредопределенноеЗначение("Справочник.Scan_ХозяйственныеОперации.StdПрайсЛистНаАренду") Тогда
		
		ПараметрыФормы = Новый Структура("ДанныеДляПечати", ПараметрКоманды);
		ОткрытьФорму("Документ.Scan_ПрайсЛистАренда.Форма.ФормаНастроекПечати",
					ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка,,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ВызватьИсключение Нстр("ru = 'Печатная форма доступна только для документов с хоз. операцией ""STD Прайс-лист на аренду"".'");												
	КонецЕсли;												
	//rarus vikhle 18.11.2021 m 18340 ---
КонецПроцедуры

#КонецОбласти