//rarus tenkam 10.08.2017 mantis 10589 +++
Процедура ПриЗаписи(Отказ, Замещение)
	ТабЗначенийПрав = ЭтотОбъект.Выгрузить();
	// Rarus tenkam 10.03.2022 mantis 17628 +++
	//НайденнаяСтрока = ТабЗначенийПрав.Найти(ПланыВидовХарактеристик.Scan_ПраваИНастройки.ЛьготноеРасстояниеПриДоставке,"ПравоНастройка");
	//Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
	//	ПараметрыФоновогоЗадания = Новый Массив;
	//	ПараметрыФоновогоЗадания.Добавить("Изменение льготного расстояния");
	//	ФоновыеЗадания.Выполнить("Scan_Тарифы.ПересчитатьДоставкуЛьготную", ПараметрыФоновогоЗадания, Новый УникальныйИдентификатор,	"Пересчет Доставки льготной");
	//КонецЕсли;
	// Rarus tenkam 10.03.2022 mantis 17628 ---
	
	// rarus tenkam 13.05.2019 mantis 14226 +++
	ТекСтруктура = Новый Структура("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	НайденныеСтрокиПустойПользователь = ТабЗначенийПрав.НайтиСтроки(ТекСТруктура);
	Для Каждого ТекСтрока Из НайденныеСтрокиПустойПользователь Цикл
		ТекСтрока.Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();	
	КонецЦикла;
	// rarus tenkam 13.05.2019 mantis 14226 ---
КонецПроцедуры
//rarus tenkam 10.08.2017 mantis 10589 ---
