
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("НомерСпецификации");
	Поля.Добавить("Статус");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'STD %1 (%2 от %3) %4'; en = 'STD %1 (%2 dated %3) %4'"),
	Данные.НомерСпецификации, Данные.Номер, Данные.Дата, Данные.Статус);
	
КонецПроцедуры


