
&НаСервере
Процедура ОбновитьЭлементыНаСервере()
	
	Отказ = Ложь;
	ПараметрыВызова = Новый Структура;
	
	ОтветСервиса = Scan_ВебСервисы.ВызовВебСервиса1СДО("GetListOfCostCenters", ПараметрыВызова, Отказ);
	
	Если Не Отказ Тогда
		Сообщить(НСтр("ru = 'Справочник успешно обновлён.'; en = 'Data has been successfully updated.'"));
	Иначе
		Сообщить(НСтр("ru = 'Справочник не обновлён.'; en = 'Data has not been updated.'"));
		Сообщить(ОтветСервиса);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементы(Команда)
	
	ОбновитьЭлементыНаСервере();
	
КонецПроцедуры


