///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// Для начальной страницы указать ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы.
//
// Параметры:
//   Разделы - Массив - разделы, в которых размещены команды вызова дополнительных обработок.
//       * ОбъектМетаданных: Подсистема - метаданные раздела (подсистемы).
//       * Строка - для начальной страницы.
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	//rarus tenkam 26.07.2015 mantis 7162 ++
	Разделы.Добавить(ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	Разделы.Добавить(Метаданные.Подсистемы.Scan_НСИ);
	Разделы.Добавить(Метаданные.Подсистемы.Scan_ОтделКлиентскойПоддержки);//rarus vikhle 18.06.2020 mt 15695 изменил имя подсистемы на актуальное
	Разделы.Добавить(Метаданные.Подсистемы.Scan_ОтделЛогистики);
	Разделы.Добавить(Метаданные.Подсистемы.Scan_ОтделПланирования);
	Разделы.Добавить(Метаданные.Подсистемы.Администрирование);
	//rarus tenkam 26.07.2016 mantis 7162 --	
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
// В Разделы необходимо добавить метаданные тех разделов, 
// в которых размещены команды вызова.
// Для начальной страницы указать ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы.
//
// Параметры:
//   Разделы - Массив - разделы, в которых размещены команды вызова дополнительных отчетов.
//       * ОбъектМетаданных: Подсистема - метаданные раздела (подсистемы).
//       * Строка - для начальной страницы.
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	//rarus tenkam 26.07.2016 mantis 7162 ++
	Разделы.Добавить(ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	Разделы.Добавить(Метаданные.Подсистемы.Scan_НСИ);
	Разделы.Добавить(Метаданные.Подсистемы.Scan_ОтделКлиентскойПоддержки);//rarus vikhle 18.06.2020 mt 15695 изменил имя подсистемы на актуальное
	Разделы.Добавить(Метаданные.Подсистемы.Scan_ОтделЛогистики);
	Разделы.Добавить(Метаданные.Подсистемы.Scan_ОтделПланирования);
	//Разделы.Добавить(Метаданные.Подсистемы.Администрирование);//rarus FominskiyAS 26.02.2019  mantis 13863
	//rarus tenkam 26.07.2016 mantis 7162 --	
	
КонецПроцедуры

#КонецОбласти
