// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()


// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	
КонецПроцедуры // ХозОперацияПриИзменении()

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ХозОперация");
	// Rarus tenkam 02.02.2022 mantis 18837 +++
	Поля.Добавить("ДОНомерЗаказаНаЗакупку");
	Поля.Добавить("ДОДатаЗаказаНаЗакупку");	
	// Rarus tenkam 02.02.2022 mantis 18837 ---
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Rarus tenkam 02.02.2022 mantis 18837 +++
	//Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 от %3'; en = 'STD %1 %2 dated %3'"),
	//Данные.ХозОперация, Данные.Номер, Данные.Дата);
	НомерДокумента = Scan_ОбщегоНазначения.УбратьЛидирующиеНули(Данные.Номер);
	ДатаДокумента = Формат(Данные.Дата, "ДЛФ=Д");
	ДатаДО = Формат(Данные.ДОДатаЗаказаНаЗакупку, "ДЛФ=Д");
	
	Если ЗначениеЗаполнено(Данные.ДОНомерЗаказаНаЗакупку) Тогда
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 от %3 № (1С:ДО) %4 от %5'; en = 'STD %1 %2 dated %3 № (1C:DM) %4 dated %5'"),
		Данные.ХозОперация, НомерДокумента, ДатаДокумента, Данные.ДОНомерЗаказаНаЗакупку , ДатаДО);
	Иначе
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 от %3'; en = 'STD %1 %2 dated %3'"),
		Данные.ХозОперация, НомерДокумента, ДатаДокумента);
	КонецЕсли;
	// Rarus tenkam 02.02.2022 mantis 18837 ---
КонецПроцедуры

