
Функция ПолучитьСписокЭлементовДляНастройки() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив,, КС);
	
	ТаблицаЭлементов.Колонки.Добавить("ИмяЭлемента",ОписаниеТиповС);
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ДатаМонитора");
	МассивЭлементов.Добавить("ОтборСкладОтгрузки");
	МассивЭлементов.Добавить("ОтборВидПродукта");
	МассивЭлементов.Добавить("ОбновитьМонитор");
	МассивЭлементов.Добавить("Монитор");
	МассивЭлементов.Добавить("ДекорацияРазвернуть");
	МассивЭлементов.Добавить("ГруппаМониторНастройки");
	МассивЭлементов.Добавить("РежимТабличныйДокумент");
	МассивЭлементов.Добавить("ОтображатьВыходныеДни");
	МассивЭлементов.Добавить("КратностьШкалыВремени");
	МассивЭлементов.Добавить("ИнтервалАвтообновления");
	МассивЭлементов.Добавить("ПредставлениеИнтервала");
	МассивЭлементов.Добавить("ИспользуемыеСкладыОтгрузки");
	МассивЭлементов.Добавить("ИспользуемыеСтатусыЗаявок");
	МассивЭлементов.Добавить("ЗаявкиНаОтгрузку");
	
	Для Каждого ИмяЭлемента Из МассивЭлементов Цикл
		СтрокаЭлемента = ТаблицаЭлементов.Добавить();
		СтрокаЭлемента.ИмяЭлемента = ИмяЭлемента;
	КонецЦикла;
	
	Возврат ТаблицаЭлементов;
	
КонецФункции
