//rarus sergei 09.11.2016 mantis 7163 ++
Процедура ПередЗаписью(Отказ)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ)); 
КонецПроцедуры
//rarus sergei 09.11.2016 mantis 7163 --

//rarus tenkam 18.01.2017 mantis 8172 ++
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЭтоГруппа Тогда	// Rarus tenkam 16.11.2021 mantis 17140 +
		Если Маршрут Тогда
			// Сообщим платформе, что не будем проверять заполнение реквизита "ТипСклада"
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТипСклада"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//rarus tenkam 18.01.2017 mantis 8172 --


