//rarus sergei 06.12.2016 mantis 7164 ++
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
    ПараметрыФормы = Новый Структура("ДанныеДляПечати", ПараметрКоманды);
    ОткрытьФорму("Документ.Scan_ЗаявкаПеревозчику.Форма.ФормаНастроекПечатиТранспортнойНакладной", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//rarus sergei 06.12.2016 mantis 7164 --
