//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//rarus vikhle 13.01.2021 15695 +++
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь,"ПользовательСотрудник") И НЕ РольДоступна("ПолныеПрава") Тогда 
		ВызватьИсключение НСтр("ru = 'Открытие формы доступно только для сотрудников Скания Русь и пользователей с полными правам.'");
	КонецЕсли;	
	//rarus vikhle 13.01.2021 15695 ---
	
КонецПроцедуры

#КонецОбласти