//Процедура ЗаполнитьПредопределенныеГруппыПродуктов() Экспорт
//	
//	Если НЕ ЗначениеЗаполнено(Справочники.Scan_ГруппыПродуктов.Двигатели.МаркаПродукта) Тогда
//		ДвигателиОбъект = Справочники.Scan_ГруппыПродуктов.Двигатели.ПолучитьОбъект();
//		ДвигателиОбъект.МаркаПродукта = ПредопределенноеЗначение("Справочник.Scan_МаркиПродуктов.Scania");
//		ДвигателиОбъект.Записать();
//	КонецЕсли;
//	
//	Если НЕ ЗначениеЗаполнено(Справочники.Scan_ГруппыПродуктов.ТранспортныеСредства.МаркаПродукта) Тогда
//		ТСОбъект = Справочники.Scan_ГруппыПродуктов.ТранспортныеСредства.ПолучитьОбъект();
//		ТСОбъект.МаркаПродукта = ПредопределенноеЗначение("Справочник.Scan_МаркиПродуктов.Scania");
//		ТСОбъект.Записать();
//	КонецЕсли;
//		
//КонецПроцедуры

//rarus sergei 29.09.2016 mantis 7162 ++

Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	ГруппаОбъект = Справочники.Scan_ГруппыПродуктов.Двигатели.ПолучитьОбъект();
	ГруппаОбъект.КраткоеНаименование = "ДВС";
	ГруппаОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		ГруппаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, ГруппаОбъект, ОписаниеОшибки());
	КонецПопытки;
	ГруппаОбъект = Справочники.Scan_ГруппыПродуктов.ТранспортныеСредства.ПолучитьОбъект();
	ГруппаОбъект.КраткоеНаименование = "ТС";
	ГруппаОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		ГруппаОбъект.Записать();
	Исключение
		ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, ГруппаОбъект, ОписаниеОшибки());
	КонецПопытки;
	// rarus tenkam 14.10.2019 mantis 14442 +++ 
	//ГруппаОбъект = Справочники.Scan_ГруппыПродуктов.ДизельныеЭлектростанции.ПолучитьОбъект();
	//ГруппаОбъект.КраткоеНаименование = "ДЭС";
	//ГруппаОбъект.ОбменДанными.Загрузка = Истина;
	//Попытка
	//	ГруппаОбъект.Записать();
	//Исключение
	//	ВывестиСообщениеПол(НСтр("ru = 'Ошибка обновления элемента <%1>: %2'"),,,,, ГруппаОбъект, ОписаниеОшибки());
	//КонецПопытки;
	// rarus tenkam 14.10.2019 mantis 14442 ---
КонецПроцедуры
//rarus sergei 29.09.2016 mantis 7162 -- 