
//rarus abrant 15.11.2017 mantis 12037 +++
&НаКлиенте
Процедура ПоказатьНедействительныхПриИзменении(Элемент)
	ЭлементОтбора = Список.Отбор.Элементы.Получить(0);
	Если ПоказатьНедействительных Тогда
		ЭлементОтбора.Использование = Ложь;
	Иначе
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
КонецПроцедуры
//rarus abrant 15.11.2017 mantis 12037 ---
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();//rarus vikhle 07.05.2020 mt 15695
	
	//rarus abrant 15.11.2017 mantis 12037 +++
	ПоказатьНедействительных = Ложь;
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Недействителен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	//rarus abrant 15.11.2017 mantis 12037 ---
КонецПроцедуры


&НаКлиенте
Процедура ПереместитьЭлементВверх()
	
	// rarus agar 25.05.2021 16927 ++
	//Если Не ВозможноПеремещениеЭлемента(Элементы.Список.ТекущиеДанные.Ссылка, "Вверх") Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Перемещение данного вида контактной информации не предусмотрено'"));
	//	Возврат;
	//КонецЕсли;
	//
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(Список, Элементы.Список);
	// rarus agar 25.05.2021 16927 --
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз()
	
	// rarus agar 25.05.2021 16927 ++
	//Если Не ВозможноПеремещениеЭлемента(Элементы.Список.ТекущиеДанные.Ссылка, "Вниз") Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Перемещение данного вида контактной информации не предусмотрено'"));
	//	Возврат;
	//КонецЕсли;
	//
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВнизВыполнить(Список, Элементы.Список);
	// rarus agar 25.05.2021 16927 --
	
КонецПроцедуры

//rarus vikhle 05.07.2021 апк +++
//&НаСервере
//Функция ВозможноПеремещениеЭлемента(ТекущийЭлемент, Направление)
	
	// rarus agar 25.05.2021 16927 ++
	//СоседнийЭлемент = НастройкаПорядкаЭлементовСлужебный.СоседнийЭлемент(ТекущийЭлемент, Список, Направление);
	//
	//Возврат СоседнийЭлемент = Неопределено Или Не (ТекущийЭлемент.ЗапретитьРедактированиеПользователем Или СоседнийЭлемент.ЗапретитьРедактированиеПользователем);
	// rarus agar 25.05.2021 16927 --
	
//КонецФункции
//rarus vikhle 05.07.2021 апк ---