//rarus vikhle 27.04.2020 mt 15693 +++ 

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Вложение = Новый Структура;
	//rarus vikhle 03.08.2020 mt 15693 +++ для корректного формирования pdf
	Результат.АвтоМасштаб = Истина;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	//rarus vikhle 03.08.2020 mt 15693 ---
	Вложение.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор));
	Вложение.Вставить("Представление",  "Отчет Cow");
		
	СписокВложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = Новый Структура;
		Шаблон = Scan_ПраваИНастройки.Scan_Право("ШаблонПисьмаСОтчетомCow");
		ПараметрыОтправки.Вставить("Кому", ПолучитьАдресатов(Шаблон));
		ПараметрыОтправки.Вставить("Тема", "Отчет Cow от "  + Строка(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")));
		ПараметрыОтправки.Вставить("Вложения", СписокВложений);
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресатов (Шаблон)
	Возврат Справочники.Scan_ШаблоныПисем.ПолучитьПолучателейПисьма(Шаблон,Неопределено);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scan_СборСтатистики.Scan_ПриОткрытииОтчета(РеквизитФормыВЗначение("Отчет").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +
КонецПроцедуры

//rarus vikhle 27.04.2020 mt 15693 ---
