//Формирует список, состоящий из всех документов конфигурации
//
Функция СформироватьСписокСправочников() Экспорт 
	СписокСправочников = Новый Массив();
	Для Каждого Справочник ИЗ Метаданные.Справочники Цикл
		СписокСправочников.Добавить(Справочник.Имя);
	КонецЦикла;
	СписокСправочников.Добавить(Метаданные.Перечисления.Scan_КлючевыеДаты.Имя + "РегистрСведений");	//rarus bonmak 01.07.2019 14433 имя перечисления, т.к. в нем хранятся значения 	
	Возврат СписокСправочников; 
КонецФункции //СформироватьСписокДокументов()

//формирует список, состоящий из всех реквизитов указанного справочника
//
Функция СформироватьСписокРеквизитов(ВыбранныйОбъект)Экспорт 
	СписокРеквизитов = Новый Массив();
	
	ПреобразованноеНаименование = Метаданные.Перечисления.Scan_КлючевыеДаты.Имя + "РегистрСведений";
	Если ВыбранныйОбъект = ПреобразованноеНаименование Тогда //rarus bonmak 01.07.2019 14433 добавил условие и отработку ИСТИНА
		ОбъектМетаданных = Метаданные.Перечисления.Scan_КлючевыеДаты;
		Если ОбъектМетаданных <> Неопределено Тогда
			Для Каждого ЗначениеПеречисления ИЗ ОбъектМетаданных.ЗначенияПеречисления Цикл
				СписокРеквизитов.Добавить(ЗначениеПеречисления.Имя);
			КонецЦикла;	 
		КонецЕсли;
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник."+ВыбранныйОбъект);
		
		Если ОбъектМетаданных <> Неопределено Тогда
			Для Каждого СтандартныйРеквизит ИЗ ОбъектМетаданных.СтандартныеРеквизиты Цикл
				//СписокРеквизитов.Добавить(СтандартныйРеквизит.Имя,СтандартныйРеквизит.Имя);
				СписокРеквизитов.Добавить(СтандартныйРеквизит.Имя);
			КонецЦикла;	
			Для Каждого Реквизит ИЗ ОбъектМетаданных.Реквизиты Цикл
				//СписокРеквизитов.Добавить(Реквизит.Имя,Реквизит.Синоним);
				//rarus tenkam 24.06.2016 mantis 6925 ++ (доп. требование)
				Если Реквизит.Имя = "ДатаБукингЛиста" ИЛИ Реквизит.Имя = "НомерБукингЛиста" Тогда	
					Продолжить;
				Иначе	//rarus tenkam 24.06.2016 mantis 6925 --
					СписокРеквизитов.Добавить(Реквизит.Имя);
				КонецЕсли;
			КонецЦикла;
			// rarus kabany 10.06.2021 17886 +++
			Если ОбъектМетаданных = Метаданные.Справочники.Scan_ЗаказыНаЗавод Тогда
				тчЗаказыНаЗакупкуРеквизиты = ОбъектМетаданных.ТабличныеЧасти.ЗаказыНаЗакупку.Реквизиты;
				Для Каждого РеквизитТЧ ИЗ тчЗаказыНаЗакупкуРеквизиты Цикл
					СписокРеквизитов.Добавить(РеквизитТЧ.Имя);
				КонецЦикла;
			КонецЕсли;
			// rarus kabany 10.06.2021 17886 ---
		КонецЕсли;
	КонецЕсли;
	Возврат СписокРеквизитов;
КонецФункции //СформироватьСписокРеквизитов()

Процедура ПервоначальноеЗаполнение(Объект) Экспорт
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда
		Объект.ОбъектМетаданных = "Scan_ЗаказыНаЗавод";
		Объект.НомерКТПоБизнесПроцессу = 1;
	КонецЕсли;	
КонецПроцедуры

