#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ) //rarus bonmak 18.06.2021 17904 ++
	Если ПометкаУдаления Тогда	
		НаборЗаписей = РегистрыСведений.Scan_КонтрольныеТочкиАРМ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КонтрольнаяТочка.Установить(Ссылка);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.КонтрольнаяТочка = Ссылка;
		НоваяЗапись.Пользователь = Пользователи.ТекущийПользователь(); // rarus tenkam 02.07.2021  OFMS устранение ошибок Sonar Qube (АПК) было ПользователиКлиентСервер.ТекущийПользователь();		
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 18.06.2021 17904 --

//Процедура ПередЗаписью(Отказ)
//	
//	ОтборНомера = Новый Структура("РеквизитОбъекта", РеквизитОбъекта);		
//	
//	Выборка = Справочники.Scan_КонтрольныеТочкиБизнесПроцессов.Выбрать(,,ОтборНомера);
//	
//	Пока Выборка.Следующий() Цикл
//		Если Выборка.Ссылка = Ссылка Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Для выбранного реквизита уже существует контрольная точка!!";
//		Сообщение.Сообщить();
//		
//		Отказ = Истина;
//	КонецЦикла;
//	
//КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
