//rarus sergei 06.12.2016 mantis 7164 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Документ = Параметры.ДанныеДляПечати;
	Для каждого строка Из Документ.СоставЗаявки Цикл
		НоваяСтрока = ТаблицаИзделий.Добавить();
		НоваяСтрока.Изделие = строка.Изделие;
	КонецЦикла; 
	СтороныПечати = 0;	//rarus tenkam 23.06.2017 mantis 10064	+
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого строка Из ТаблицаИзделий Цикл
		строка.ПечататьВТН = Истина;	
	КонецЦикла; 	
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого строка Из ТаблицаИзделий Цикл
		строка.ПечататьВТН = ЛОЖЬ;	
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	МассивВыбранныхИзделий = ТаблицаИзделий.НайтиСтроки(Новый Структура("ПечататьВТН", Истина));
	Если МассивВыбранныхИзделий.Количество() > 0 Тогда
		
		//rarus tenkam 12.01.2017 mantis 11182 +++
		Для Каждого ТекСтрока Из МассивВыбранныхИзделий Цикл
			IDExternalSystem = ПолучитьIDExternalSystem(ТекСтрока.Изделие);
			Если ЗначениеЗаполнено(IDExternalSystem) Тогда 
				//rarus bonmak 16452 23.09.2020 ++
				//ИмяМетода = "GetChassis";
				СообщениеОбОшибке = "";
				Отказ = Ложь;
				СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(,Ложь);
				СтруктураПараметров.Вставить("GUID", IDExternalSystem);
				//ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
				//ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
				//Если НЕ Отказ Тогда
					//СсылкаИзделия = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникИзделия(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
				//КонецЕсли;
				СсылкаИзделия = Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetChassis(СтруктураПараметров, Отказ, СообщениеОбОшибке);	
				//rarus bonmak 16452 23.09.2020 --
			КонецЕсли;
		КонецЦикла;        
		//rarus tenkam 12.01.2017 mantis 11182 ---
		
		// rarus vikhle 02.02.2022 m 18740 +++
		//rarus agar 17.03.2021 17274 ++
		//ДатаДоставкиДокумента = ПолучитьДатуДоставкиДокумента(Документ);
		//Если  ЗначениеЗаполнено(ДатаДоставкиДокумента)
		//	И ДатаДоставкиДокумента > Дата(2020,12,31,23,59,59)
		//	Тогда
		//	ИмяМакета = "ПФ_MXL_ТранспортнаяНакладная2200";
		//Иначе
		//	ИмяМакета = "ПФ_MXL_ТранспортнаяНакладная";
		//КонецЕсли;
		//rarus agar 17.03.2021 17274 --
		
		ДатаНачалаИспользованияПФ = Scan_ПраваИНастройки.Scan_Право("ДатаНачалаДействияПФТранспортнойНакладной2116");
		ДатаПолученияДокумента = Scan_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДатаПолучения");
		
		Если  ЗначениеЗаполнено(ДатаПолученияДокумента)
			И ДатаПолученияДокумента > ДатаНачалаИспользованияПФ
			Тогда
			ИмяМакета = "ПФ_MXL_ТранспортнаяНакладная2116";
		Иначе
			ИмяМакета = "ПФ_MXL_ТранспортнаяНакладная2200";
		КонецЕсли;
		// rarus vikhle 02.02.2022 m 18740 ---
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Scan_ЗаявкаПеревозчику",        //Менеджер печати
		//rarus agar 17.03.2021 17274 ++
		//"ПФ_MXL_ТранспортнаяНакладная",            //Идентификатор
		ИмяМакета,            //Идентификатор
		//rarus agar 17.03.2021 17274 --
		Документ,        //Объекты печати
		ЭтотОбъект,                //Владелец формы - форма из которой вызывается печать
		ПолучитьПараметрыПечати()
		);        //Параметры печати - произвольные параметры для передачи в менеджер печати
		Закрыть();	
	Иначе
		Сообщить("Не удалось сформировать Транспортную накладную, так как не выбран ни один продукт");	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПечати()
	МассивИзделий = Новый Массив;
	Для каждого строка Из ТаблицаИзделий Цикл
		Если строка.ПечататьВТН = Истина Тогда
			МассивИзделий.Добавить(строка.Изделие);		
		КонецЕсли;
	КонецЦикла;
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("МассивВыбранныхИзделий",МассивИзделий);
	//rarus tenkam 23.06.2017 mantis 10064 +++
	Если СтороныПечати = 1 Тогда
		ПараметрыПечати.Вставить("Лицевая",Истина);
	ИначеЕсли СтороныПечати = 2 Тогда
		ПараметрыПечати.Вставить("Оборотная",Истина);
	Иначе
		ПараметрыПечати.Вставить("Лицевая",Истина);
		ПараметрыПечати.Вставить("Оборотная",Истина);
	КонецЕсли;
	//rarus tenkam 23.06.2017 mantis 10064 ---
	Возврат ПараметрыПечати;
КонецФункции

//rarus sergei 06.12.2016 mantis 7164 --

&НаСервереБезКонтекста
Функция ПолучитьIDExternalSystem(ИзделиеСсылка)
	Возврат ИзделиеСсылка.IDExternalSystem;
КонецФункции

// Rarus tenkam 04.02.2022 mantis 18726 АПК +++
////rarus agar 17.03.2021 17274 ++
//&НаСервереБезКонтекста
//Функция ПолучитьДатуДоставкиДокумента(Документ)
//	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДатаДоставки");
//КонецФункции
////rarus agar 17.03.2021 17274 --
// Rarus tenkam 04.02.2022 mantis 18726 АПК ---
