
&НаКлиенте
Процедура КнопкаОк(Команда)
	
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("ДатаЗаказНаряда", ДатаЗаказНаряда);
	СтруктураЗакрытия.Вставить("НомерЗаказНаряда", НомерЗаказНаряда);
	СтруктураЗакрытия.Вставить("РежимИзменения", РежимИзменения);
	
	Закрыть(СтруктураЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗвкрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимИзменения") Тогда
	
		РежимИзменения = Параметры.РежимИзменения;
	
	КонецЕсли;
	
КонецПроцедуры
