
// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.СтандартныеСпецификации.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()


// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

Функция ПолучитьСписокЭлементовДляНастройки() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	ТаблицаЭлементов.Колонки.Добавить("ИмяЭлемента",ОписаниеТиповС,,);
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ФормаКоманднаяПанель"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("ВыборХозОперации");
	МассивЭлементов.Добавить("ФормаСоздатьНаОсновании");
	МассивЭлементов.Добавить("ДействияФормы");
	МассивЭлементов.Добавить("ГруппаСлужебныеПоля");
	МассивЭлементов.Добавить("Статус");
	МассивЭлементов.Добавить("СтатусУтвердить");
	МассивЭлементов.Добавить("СтатусИзменить"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("СтатусСогласовать");
	МассивЭлементов.Добавить("СтатусПрерватьСогласование"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("СтатусЗавершить");
	МассивЭлементов.Добавить("СтатусАннулировать");
	МассивЭлементов.Добавить("ИдентификаторПрайсЛиста");
	МассивЭлементов.Добавить("НаименованиеПрайсЛиста");
	МассивЭлементов.Добавить("ДействуетСДаты");
	МассивЭлементов.Добавить("ДействуетСPartPeriod");
	МассивЭлементов.Добавить("СтраницаКалькуляция");
	МассивЭлементов.Добавить("РежимКалькуляции");
	МассивЭлементов.Добавить("ГруппаКомандыКалькуляции");
	МассивЭлементов.Добавить("КалькуляцияНачальноеЗаполнение");
	МассивЭлементов.Добавить("КалькуляцияПерезаполнить");
	МассивЭлементов.Добавить("КалькуляцияСохранить");
	МассивЭлементов.Добавить("ГруппаКалькуляцияПересчитать");
	МассивЭлементов.Добавить("КалькуляцияПересчитать");
	МассивЭлементов.Добавить("КалькуляцияПересчитатьРаздел");
	МассивЭлементов.Добавить("ГруппаКалькуляцияОчистить");
	МассивЭлементов.Добавить("КалькуляцияОчистить");
	МассивЭлементов.Добавить("КалькуляцияОчиститьРаздел");
	МассивЭлементов.Добавить("ГруппаБыстрыеДействия");
	МассивЭлементов.Добавить("КалькуляцияЗаполнитьЗначенияСправа");
	МассивЭлементов.Добавить("КалькуляцияТабличныйДокумент");
	МассивЭлементов.Добавить("НерасчетныеСоставляющие");
	МассивЭлементов.Добавить("РасчетныеСоставляющие");
	МассивЭлементов.Добавить("СтандартныеСпецификации");
	МассивЭлементов.Добавить("ТекущийРазделКалькуляции");
	МассивЭлементов.Добавить("СтраницаСогласование");
	МассивЭлементов.Добавить("РезультатСогласования");
	МассивЭлементов.Добавить("Согласование"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("ХодСогласования");
	МассивЭлементов.Добавить("СтраницаСистемныеПоля");
	МассивЭлементов.Добавить("ДокументОснование");
	МассивЭлементов.Добавить("СтраницаКомментарий");
	МассивЭлементов.Добавить("Комментарий");
	
	Для Каждого ИмяЭлемента Из МассивЭлементов Цикл
		СтрокаЭлемента = ТаблицаЭлементов.Добавить();
		СтрокаЭлемента.ИмяЭлемента = ИмяЭлемента;
	КонецЦикла;
	
	Возврат ТаблицаЭлементов;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ХозОперация");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 от %3'; en = 'STD %1 %2 dated %3'"),
	Данные.ХозОперация, Данные.Номер, Данные.Дата);
	
КонецПроцедуры
