// rarus tenkam 14.08.2019 mantis 14427 +++
Функция ПроверитьКорректностьТиповВидовИГрупп(ГруппаПродукта, ВидПродукта, ТипПродукта) Экспорт
	
	// Проверим, есть ли такая запись в регистре	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоответствияТиповВидовИГрупп.ТипПродукта КАК ТипПродукта,
		|	Scan_СоответствияТиповВидовИГрупп.ВидПродукта КАК ВидПродукта,
		|	Scan_СоответствияТиповВидовИГрупп.ГруппаПродукта КАК ГруппаПродукта
		|ИЗ
		|	РегистрСведений.Scan_СоответствияТиповВидовИГрупп КАК Scan_СоответствияТиповВидовИГрупп
		|ГДЕ
		|	Scan_СоответствияТиповВидовИГрупп.ТипПродукта = &ТипПродукта
		|	И Scan_СоответствияТиповВидовИГрупп.ВидПродукта = &ВидПродукта
		|	И Scan_СоответствияТиповВидовИГрупп.ГруппаПродукта = &ГруппаПродукта";
	
	Запрос.УстановитьПараметр("ВидПродукта", ВидПродукта);
	Запрос.УстановитьПараметр("ГруппаПродукта", ГруппаПродукта);
	Запрос.УстановитьПараметр("ТипПродукта", ТипПродукта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции // ПроверитьКорректностьТиповВидовИГрупп()

Функция ПолучитьГруппуИзделийOFMS(ГруппаПродукта, ВидПродукта, ТипПродукта) Экспорт
	
	// Проверим, есть ли такая запись в регистре	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоответствияТиповВидовИГрупп.ГруппаИзделийOFMS КАК ГруппаИзделийOFMS
		|ИЗ
		|	РегистрСведений.Scan_СоответствияТиповВидовИГрупп КАК Scan_СоответствияТиповВидовИГрупп
		|ГДЕ
		|	Scan_СоответствияТиповВидовИГрупп.ТипПродукта = &ТипПродукта
		|	И Scan_СоответствияТиповВидовИГрупп.ВидПродукта = &ВидПродукта
		|	И Scan_СоответствияТиповВидовИГрупп.ГруппаПродукта = &ГруппаПродукта";
	
	Запрос.УстановитьПараметр("ВидПродукта", ВидПродукта);
	Запрос.УстановитьПараметр("ГруппаПродукта", ГруппаПродукта);
	Запрос.УстановитьПараметр("ТипПродукта", ТипПродукта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ГруппаИзделийOFMS;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции // ПолучитьГруппуИзделийOFMS()

// rarus tenkam 14.08.2019 mantis 14427 ---

Функция ПолучитьГруппуИзделийOFMSПоТипу(ТипПродукта) Экспорт // Rarus tenkam 25.10.2021 mantis 17822 +++
	
	Если НЕ ЗначениеЗаполнено(ТипПродукта) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Scan_ГруппыИзделийOFMS.ПустаяСсылка");
	КонецЕсли;
		
	ВидПродукта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипПродукта, "ВидПродукта");
	Если ЗначениеЗаполнено(ВидПродукта) Тогда
		ГруппаПродукта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПродукта, "ГруппаПродукта");
	Иначе
		ГруппаПродукта = ПредопределенноеЗначение("Справочник.Scan_ГруппыПродуктов.ПустаяСсылка");
	КонецЕсли;
	
	// Проверим, есть ли такая запись в регистре	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоответствияТиповВидовИГрупп.ГруппаИзделийOFMS КАК ГруппаИзделийOFMS
		|ИЗ
		|	РегистрСведений.Scan_СоответствияТиповВидовИГрупп КАК Scan_СоответствияТиповВидовИГрупп
		|ГДЕ
		|	Scan_СоответствияТиповВидовИГрупп.ТипПродукта = &ТипПродукта
		|	И Scan_СоответствияТиповВидовИГрупп.ВидПродукта = &ВидПродукта
		|	И Scan_СоответствияТиповВидовИГрупп.ГруппаПродукта = &ГруппаПродукта";
	
	Запрос.УстановитьПараметр("ВидПродукта", ВидПродукта);
	Запрос.УстановитьПараметр("ГруппаПродукта", ГруппаПродукта);
	Запрос.УстановитьПараметр("ТипПродукта", ТипПродукта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ГруппаИзделийOFMS;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции // Rarus tenkam 25.10.2021 mantis 17822 ---
