#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//rarus ozhnik 05.01.2020 14927 ++
Процедура ПереопределитьПредопределенныйЭлементСканияРусь(ПараметрыВыполнения = Неопределено) Экспорт //rarus bonmak 25.03.2020 15885 добавил параметр
	
	ПредопределенныеЭлементы = Метаданные.Справочники.Scan_Компании.ПолучитьИменаПредопределенных();
	//rarus bonmak 25.08.2020 вне задачи (перед релизом) ++
	//Если ПредопределенныеЭлементы.Найти("СканияРусь") = неопределено Тогда
	Если ПредопределенныеЭлементы.Найти("СканияРусь") <> неопределено Тогда
	//rarus bonmak 25.08.2020 вне задачи (перед релизом) --
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Scan_Компании.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Scan_Компании КАК Scan_Компании
			|ГДЕ
			|	Scan_Компании.Наименование = ""Скания Русь""";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если  ВыборкаДетальныеЗаписи.Следующий() ТОгда
			СканияРусьОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СканияРусьОбъект.ИмяПредопределенныхДанных = "СканияРусь"; 		
			СканияРусьОбъект.Записать();
		Иначе
			СканияРусьОбъект = Справочники.Scan_Компании.СоздатьЭлемент();
			СканияРусьОбъект.Наименование = "Скания Русь";
			СканияРусьОбъект.ИмяПредопределенныхДанных = "СканияРусь";
			СканияРусьОбъект.КодДилера = 68412;
			СканияРусьОбъект.ОбменДанными.Загрузка = Истина;
			СканияРусьОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
//rarus ozhnik 05.01.2020 14927 --

#КонецЕсли

