Перем ИзмРекв; //rarus vikhle 15.06.2020 mt 15888

//rarus tenkam 23.06.2016 mantis 6897 ++
Процедура ПередЗаписью(Отказ)
	//rarus vikhle 15.06.2020 mt 15888 +++
	ИзмРекв = Новый Массив;
	//для нового запишем в регистр заполненные реквизиты
	Если ЭтотОбъект.ЭтоНовый() тогда
		Для каждого Реквизит из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Реквизит.Имя]) = Тип("Булево") и ЭтотОбъект[Реквизит.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Реквизит.Имя);
		КонецЦикла;
		ИзмРекв.Добавить("Наименование");
	Иначе  //если не новый - то измененные
		Для каждого Реквизит из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если (ЭтотОбъект[Реквизит.Имя] <> Ссылка[Реквизит.Имя]) Тогда
				ИзмРекв.Добавить(Реквизит.Имя);
			КонецЕсли;
		КонецЦикла;
		Если ЭтотОбъект.Наименование <> Ссылка.Наименование Тогда
			ИзмРекв.Добавить("Наименование");
		КонецЕсли;
	КонецЕсли;
	//для старых объектов, у которых нет данных в регистре - запишем заполненные
	Если ИзмРекв.Количество() = 0 И НетИсторииВРегистре(Ссылка) Тогда
		Для каждого Реквизит из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Реквизит.Имя]) = Тип("Булево") и ЭтотОбъект[Реквизит.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Реквизит.Имя);
		КонецЦикла;
		ИзмРекв.Добавить("Наименование");
	КонецЕсли;
	//rarus vikhle 15.06.2020 mt 15888 ---
		
	
	//rarus sergei 09.11.2016 mantis 7163 ++
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus sergei 09.11.2016 mantis 7163 --
	Если Дилер И НЕ ПометкаУдаления //rarus bonmak 08.06.2020 16178 добавил условие
		И ЗначениеЗаполнено(КодДилера)//rarus agar 08.02.2021 17203 +-
		Тогда
		ОтборСтруктура = Новый Структура("КодДилера", КодДилера); 		
		
		Выборка = Справочники.Scan_Компании.Выбрать(,,ОтборСтруктура); //rarus bonmak 04.12.2019 14456
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка = Ссылка Тогда
				Продолжить;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю;
			//rarus FominskiyAS 24.04.2019  mantis 14191 +++
			//Сообщение.Текст = "Дилер с таким кодом уже существует!";
			Сообщение.Текст = НСтр("ru = 'Дилер с таким кодом уже существует!'; en = 'Dealer with this code already exists!'");
			//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
			Сообщение.Сообщить();
			ЗаписьЖурналаРегистрации("Ошибка справочника", УровеньЖурналаРегистрации.Ошибка,, Ссылка, Сообщение.Текст); //rarus bonmak 20.12.2019 15531
			Отказ = Истина;
			Возврат;
		КонецЦикла;
	КонецЕсли;
	
	//rarus vikhle 14.02.2023 m 19839 +++
	Если Дилер Тогда
		Для Каждого СтрокаТЧ ИЗ ДоступныеМаркиДилера Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Марка) Тогда
				ТекстОшибки = СтрШаблон(Нстр("ru = 'Не заполнена колонка ""Марка"" в строке № %1 табличной части ""ДоступныеМаркиДилера""'"), СтрокаТЧ.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Период) Тогда
				СтрокаТЧ.Период = ТекущаяДатаСеанса();	
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Автор) Тогда
				СтрокаТЧ.Автор = Пользователи.ТекущийПользователь();	
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;	
	//rarus vikhle 14.02.2023 m 19839 ---
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//rarus bonmak 15.04.2020 14456 ++
	//Если ЗначениеЗаполнено(Контрагент) Тогда
	//	НаДату = ТекущаяДата();
	//	Справочники.Scan_Компании.ЗаписьЗначенияРегистраСведения(Ссылка, Контрагент, НаДату); //rarus bonmak 04.12.2019 14456
	//КонецЕсли;
	//rarus bonmak 15.04.2020 14456 --
	
	//rarus vikhle 15.06.2020 mt 15888 +++
	Для Каждого Реквизит из	ИзмРекв Цикл
		ВидЗначения = Перечисления.Scan_ДополнительнаяИнформацияПоКомпаниям[Реквизит];
		РегистрыСведений.Scan_ИсторияКомпаний.ЗаписьЗначенияРегистраСведенийИсторияКомпаний(Ссылка,Ссылка[Реквизит],ВидЗначения,ТекущаяДатаСеанса());
	КонецЦикла;
	////rarus vikhle 15.06.2020 mt 15888 ---
	
КонецПроцедуры
//rarus tenkam 18.10.2016 mantis 6897 --

//rarus vikhle 15.06.2020 mt 15888 +++
Функция НетИсторииВРегистре(Компания)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Компания",Компания);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ИсторияКомпаний.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.Scan_ИсторияКомпаний КАК Scan_ИсторияКомпаний
	               |ГДЕ
	               |	Scan_ИсторияКомпаний.Компания = &Компания";
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;	
КонецФункции
//rarus vikhle 15.06.2020 mt 15888 ---