//rarus tenkam 10.08.2017 mantis 10589 +++
Процедура ЗаписатьТарифыДляДилеров(Услуга,АдресПолучения,АдресДоставки,КолеснаяФормула,ЛогистическийТип,СпособДоставки,ТарифУказанВручную,Стоимость,НаДату = Неопределено, ВсеОк = Истина) Экспорт
	Если НаДату = Неопределено Тогда
		ДатаУстановкиТарифов = ТекущаяДата();
	Иначе
		ДатаУстановкиТарифов = НаДату;
	КонецЕсли;
	Если Стоимость > 0 Тогда
		
		//Чтение старого значения регистра
		СтруктураСведений = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.ПолучитьПоследниеДанныеРегистра(Услуга,ЛогистическийТип,СпособДоставки,КолеснаяФормула,АдресПолучения,АдресДоставки,ДатаУстановкиТарифов);
		СтараяСтоимость = СтруктураСведений.Стоимость;
		Записывать = Ложь;
		
		//Введено значение, а старое отсутствует
		Если (ЗначениеЗаполнено(Стоимость) И СтараяСтоимость = Неопределено) Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Введено значение и было введено старое
		Если (ЗначениеЗаполнено(Стоимость) И СтараяСтоимость <> Неопределено) Тогда
			//Значение изменилось
			Если Стоимость <> СтараяСтоимость Тогда 
				Записывать = Истина; 
			КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			Если СтараяСтоимость <> Неопределено Тогда
				Если СтруктураСведений.ТарифУказанВручную И НЕ ТарифУказанВручную Тогда
					//тарифы указанные вручную не перезаписываем
					ВсеОк = Ложь;
					Возврат;
				КонецЕсли;
			КонецЕсли;
			ЗаписьРегСведений = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Период 				= ДатаУстановкиТарифов;
			ЗаписьРегСведений.УслугаПакета 			= Услуга;
			ЗаписьРегСведений.АдресПолучения 		= АдресПолучения;
			ЗаписьРегСведений.АдресДоставки 		= АдресДоставки;
			ЗаписьРегСведений.КолеснаяФормула 		= КолеснаяФормула;
			ЗаписьРегСведений.ЛогистическийТип 		= ЛогистическийТип;
			ЗаписьРегСведений.СпособДоставки 		= СпособДоставки;
			ЗаписьРегСведений.ТарифУказанВручную 	= ТарифУказанВручную;
			ЗаписьРегСведений.Стоимость 			= Стоимость;
			ЗаписьРегСведений.Пользователь 			= ПользователиКлиентСервер.ТекущийПользователь();
			Попытка
				ЗаписьРегСведений.Записать();
				ВсеОк = Истина;
			Исключение
				ВсеОк = Ложь;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
//rarus tenkam 10.08.2017 mantis 10589 ---