&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 08.10.2019 14177 ++
	
	//Если Объект.Ссылка = Справочники.Scan_ВерсииБазовыхСпецификаций.ПустаяСсылка() Тогда
	//	ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
	//	Сообщить(ТекстОшибки);
	//	Отказ = Истина;
	//КонецЕсли;
	УправлениеДиалогомНаСервере();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура УправлениеДиалогомНаСервере() //rarus bonmak 08.10.2019 14177 ++
	Элементы.ФормаГруппаИнтеграция.Видимость = Scan_ПраваИНастройки.Scan_Право("ОбменСПредставительством");

	Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));
	
	Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
		Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	КонецЕсли;
	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus bonmak 08.10.2019 14177 ++
	Если ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(, Ложь);
		СтруктураПараметров.GUID = Объект.IDExternalSystem;
		Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetSpecification(СтруктураПараметров);
		ЭтаФорма.Прочитать();
		УправлениеДиалогомНаСервере();
	КонецЕсли;

КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 08.10.2019 14177 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 --- 
