#Область ОбработчикиКомандФормы

&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus bonmak 04.09.2019 14442 ++
	//rarus bonmak 17468 23.09.2021 ++
	ВыборкаСправочника = Справочники.Scan_ДополнительныеРеквизиты1БД.Выбрать();
	Пока ВыборкаСправочника.Следующий() Цикл
		Если НЕ ПустаяСтрока(ВыборкаСправочника.IDExternalSystem) 
			И НЕ ВыборкаСправочника.ПометкаУдаления Тогда
			СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(, Ложь);
			СтруктураПараметров.GUID = ВыборкаСправочника.IDExternalSystem;
			Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetAdditionalProperty(СтруктураПараметров);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	//rarus bonmak 17468 23.09.2021 --
КонецПроцедуры //rarus bonmak 04.09.2019 14442 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 04.09.2019 14442 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus bonmak 04.09.2019 14442 --

&НаКлиенте
Процедура АдминистрированиеДопРеквизитов(Команда) //rarus bonmak 17468 23.09.2021 ++
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыАдминистрирования",ЭтотОбъект);
	ОткрытьФорму("Справочник.Scan_ДополнительныеРеквизиты1БД.Форма.ФормаАдминистрирование",
				,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаКлиенте
Процедура ПослеЗакрытияФормыАдминистрирования(Результат, Объект) Экспорт //rarus bonmak 17468 23.09.2021 ++ 
	Элементы.Список.Обновить();		
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

#КонецОбласти