//rarus tenkam 27.09.2016 mantis 6897 ++
&НаСервере
Процедура ОбновитыТипыНаСервере()
	
	//rarus agar 21.08.2020 15696 ++
	ИмяМетода         = "GetListOfProductSubType";
	СообщениеОбОшибке = "";
	Отказ             = Ложь;
	
	// Обновление элементов справочников по родителю надстроек
	РодительGUID = Scan_ПраваИНастройки.Scan_Право("ИдентификаторГруппыНадстроекСправочникаТипыВ1БД");
	Если ЗначениеЗаполнено(РодительGUID) Тогда
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
		СтруктураПараметров.Вставить("РодительGUID", РодительGUID);
		
		ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
		ОтветМетода = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
		Если Не Отказ Тогда
			РезультатРазбора = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ОтветМетода,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода, "Scan_ТипыПродуктов");
		КонецЕсли;
	КонецЕсли;
	
	// Обновление элементов справочников по родителю оборудования
	РодительGUID = Scan_ПраваИНастройки.Scan_Право("ИдентификаторГруппыОборудованияСправочникаТипыВ1БД");
	Если ЗначениеЗаполнено(РодительGUID) Тогда
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
		СтруктураПараметров.Вставить("РодительGUID", РодительGUID);
		
		ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
		ОтветМетода = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
		Если Не Отказ Тогда
			РезультатРазбора = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ОтветМетода,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода, "Scan_ТипыПродуктов");
		КонецЕсли;
	КонецЕсли;
	
	// Обновление элементов справочников по родителю оборудования
	РодительGUID = Scan_ПраваИНастройки.Scan_Право("ИдентификаторГруппыУслугСправочникаТипыВ1БД");
	Если ЗначениеЗаполнено(РодительGUID) Тогда
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
		СтруктураПараметров.Вставить("РодительGUID", РодительGUID);
		
		ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
		ОтветМетода = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
		Если Не Отказ Тогда
			РезультатРазбора = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ОтветМетода,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода, "Scan_ТипыПродуктов");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	//rarus agar 21.08.2020 15696 --
	
	////Обновим группы
	//СтруктураПараметров.Вставить("РодительGUID", "");
	//ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//Если НЕ Отказ Тогда
	//	//СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	МаркетинговыеРодительGUID = Scan_ВебСервисыРазборОтветов.ПолучитьGuidРодителя(ТекЭлементОтвет, "Маркетинговые типы",Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	ТипыРодительGUID = Scan_ВебСервисыРазборОтветов.ПолучитьGuidРодителя(ТекЭлементОтвет, "Типы",Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	
	//	//Обновим Маркетинговые типы
	//	СтруктураПараметров.Вставить("РодительGUID", МаркетинговыеРодительGUID);		
	//	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//	ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//	Если НЕ Отказ Тогда
	//		СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	КонецЕсли;
	//	
	//	//Обновим Типы
	//	СтруктураПараметров.Вставить("РодительGUID", ТипыРодительGUID);		
	//	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//	ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//	Если НЕ Отказ Тогда
	//		СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	КонецЕсли;	
	//КонецЕсли;
	//rarus bonmak 04.09.2019 14442 --
	
	////СтруктураПараметров.Вставить("Родитель", "Логистические типы");
	//ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//Если НЕ Отказ Тогда
	//	СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипыПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//КонецЕсли;
	
	// rarus tenkam 19.09.2019 mantis 14442 +++
	//rarus vikhle 06.02.2020 mt 15659 закомментировано +++
	//ИмяМетода = "GetListOfProductSubType";
	//СообщениеОбОшибке = "";
	//Отказ = Ложь;
	//СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	//
	//СтруктураПараметров.Вставить("РодительGUID", "");
	//ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//Если НЕ Отказ Тогда
	//	РодительGUID = Scan_ВебСервисыРазборОтветов.ПолучитьGuidРодителя(ТекЭлементОтвет, "Типы",Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	
	//	Если ЗначениеЗаполнено(РодительGUID) Тогда
	//		СтруктураПараметров.Вставить("РодительGUID", РодительGUID);		
	//		ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//		ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//		Если НЕ Отказ Тогда
	//			ТекСсылка = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникТипы(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода, "Scan_ТипыПродуктов");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	// rarus tenkam 19.09.2019 mantis 14442 ---
	
	//Элементы.Список.Обновить();
	//rarus vikhle 06.02.2020 mt 15659 закомментировано ---
КонецПроцедуры

&НаКлиенте
Процедура ОбновитыТипы(Команда)
	
	//rarus agar 21.08.2020 15696 ++
	ОбновитыТипыНаСервере();
	//rarus agar 21.08.2020 15696 --
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДиалогомНаСервере();
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	//Элементы.ФормаГруппаИнтеграция.Видимость = Scan_ПраваИНастройки.Scan_Право("ОбменСПредставительством");//rarus vikhle 06.02.2020 mt 15659	
КонецПроцедуры

//rarus tenkam 27.09.2016 mantis 6897 --
