//rarus kabany 26.04.2021 17666 +++ 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	//Формирование заголовка отчета в зависимости от заданого периода
	ПараметрЗаголовокОтчета = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок"); 
	Если НЕ ПараметрЗаголовокОтчета = Неопределено Тогда
		ПараметрЗаголовокОтчета.Использование = Истина;
		ПараметрЗаголовокОтчета.Значение = "Плановые цены продажи шасси (Scania)";
		
		ИсполняемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		
		// дату 
		ПараметрНаДату = ИсполняемыеНастройки.ПараметрыДанных.Элементы.Найти("НаДату");
		Если НЕ ПараметрНаДату = Неопределено и ПараметрНаДату.Использование Тогда
			НаДату = ПараметрНаДату.Значение.Дата;
			ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " на " +  Формат(НаДату,"ДФ=dd.MM.yyyy"); 	
		Иначе
			ПараметрПериод = ИсполняемыеНастройки.ПараметрыДанных.Элементы.Найти("СтандартныйПериод");
			Если НЕ ПараметрПериод = Неопределено и ПараметрПериод.Использование Тогда
				ДатаНачала = ПараметрПериод.Значение.ДатаНачала;
				ДатаОкончания = ПараметрПериод.Значение.ДатаОкончания;
				Если ДатаНачала <> Дата(1,1,1) И ДатаОкончания <> Дата(1,1,1) И ДатаНачала <> НачалоДня(ДатаОкончания) Тогда
					ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " с " + Формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " по " 
					+ Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");  	
				ИначеЕсли ДатаНачала = Дата(1,1,1) И ДатаОкончания <> Дата(1,1,1) Тогда   	
					ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " по " + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");	
				ИначеЕсли ДатаНачала <> Дата(1,1,1) И ДатаОкончания = Дата(1,1,1) Тогда   	
					ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " с " + Формат(ДатаНачала,"ДФ=dd.MM.yyyy") 
					+ " по " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");	
				ИначеЕсли ДатаНачала = НачалоДня(ДатаОкончания) И ДатаНачала <> Дата(1,1,1) И ДатаОкончания <> Дата(1,1,1) Тогда 	
					ПараметрЗаголовокОтчета.Значение = ПараметрЗаголовокОтчета.Значение + " на " +  Формат(ДатаНачала,"ДФ=dd.MM.yyyy"); 	
				КонецЕсли;		
				
			КонецЕсли;			
		КонецЕсли;		
	КонецЕсли;
		
КонецПроцедуры
//rarus kabany 26.04.2021 17666 ---
