//rarus vikhle 05.08.2020 mt 16181 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТипЗаполнения") Тогда
		Элементы.ГруппаДаты.Видимость = Параметры.ТипЗаполнения = "Даты"; 
		Элементы.ГруппаЦены.Видимость = Параметры.ТипЗаполнения <> "Даты";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Элементы.ГруппаДаты.Видимость Тогда 
		Если ЗначениеЗаполнено(ВидДаты) Тогда
			ПараметрыЗакрытия = Новый Структура ("ВидДаты,ЗначениеДаты",ВидДаты,ЗначениеДаты);
			Закрыть(ПараметрыЗакрытия);
		Иначе
			ВывестиСообщениеПол(Нстр("ru = 'Не выбран вид ключевой даты.'; en = 'Fill in Date type.'"),ЭтотОбъект,"ВидДаты");
		КонецЕсли;	
	ИначеЕсли Элементы.ГруппаЦены.Видимость Тогда 
		ПараметрыЗакрытия = Новый Структура("Цена",ЦенаСНДС);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;	
КонецПроцедуры


//rarus vikhle 04.08.2020 mt 16181 +++