//rarus kabany 27.04.2021 17666 +++ 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборкаПараметров = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("ВидПродукта") Тогда
				ГрузовыеАвтомобили = Scan_ПраваИНастройки.Scan_Право("ВидПродуктаГрузовыеАвтомобили");	
				ТекЭлемент.Значение = ГрузовыеАвтомобили;
			КонецЕсли;
				
		КонецЕсли;				
	КонецЦикла; 
	Scan_СборСтатистики.Scan_ПриОткрытииОтчета(РеквизитФормыВЗначение("Отчет").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +
	
КонецПроцедуры

//rarus kabany 27.04.2021 17666 +++
&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	ВыборкаПараметров = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ТекЭлемент Из ВыборкаПараметров Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда			
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("ВидПродукта") Тогда			
				Если НЕ ЗначениеЗаполнено(ТекЭлемент.Значение) Тогда 
					ГрузовыеАвтомобили = Scan_ПраваИНастройки.Scan_Право("ВидПродуктаГрузовыеАвтомобили");
					ТекЭлемент.Значение = ГрузовыеАвтомобили;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		//
		Если ТипЗнч(ТекЭлемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда			
			Если ТекЭлемент.Параметр = Новый ПараметрКомпоновкиДанных("НаДату") Тогда			
				ТекЭлемент.Значение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата; 
				ТекЭлемент.Значение.Дата = КонецДня(ТекущаяДата());
			КонецЕсли;
		КонецЕсли;
		//
		
	КонецЦикла;	
КонецПроцедуры
//rarus kabany 27.04.2021 17666 ---
//rarus kabany 27.04.2021 17666 ---

