
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	                    	
#Область ПрограммныйИнтерфейс

#КонецОбласти

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Для каждого ТекСтрока из ОтветственныеМенеджеры Цикл
		Если не ЗначениеЗаполнено(ТекСтрока.Дилер) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Не заполнено поле ""Дилер""'; en = 'Не заполнено поле ""Дилер""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Дилер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		КонецЕсли;
		Если не ЗначениеЗаполнено(ТекСтрока.Менеджер) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Не заполнено поле ""Менеджер""'; en = 'Не заполнено поле ""Менеджер""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Менеджер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		КонецЕсли;
		Если (текстрока.Дилер = Справочники.Scan_Компании.СканияРусь) и (ТекСтрока.Менеджер.МенеджерСканияРусь = ложь) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Для дилера ""Скания Русь"" указан сотрудник без признака ""менеджер Скания-Русь""'; en = 'Для дилера ""Скания Русь"" указан сотрудник без признака ""менеджер Скания-Русь""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Менеджер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		Конецесли;			
		
	КонецЦикла;
	КопияОтветственных = ОтветственныеМенеджеры.Выгрузить();
	КоличествоОбщее = КопияОтветственных.Количество();
	КопияОтветственных.Свернуть("Дилер");
	КоличествоСгруппированных = КопияОтветственных.Количество();
	Если не КоличествоОбщее = КоличествоСгруппированных ТОгда
		
		ВывестиСообщениеПол(Нстр("ru = 'Есть дубли дилеров'; en = 'Есть дубли дилеров'"),ЭтотОбъект,"ОтветственныеМенеджеры");
		Отказ = истина;	
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//rarus vikhle 28.02.2022 m 18879 +++
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДанныеSetAdditionalProperty = Scan_ВспомогательныеФункцииСервер.ПолучитьДанныеSetAdditionalProperty(ЭтотОбъект);
		ДополнительныеСвойства.Вставить("ДанныеSetAdditionalProperty", ДанныеSetAdditionalProperty);	
		
	КонецЕсли;
	
	Scan_ВспомогательныеФункцииСервер.ПроверитьМенеджеровДокументаЗакрепления(ЭтотОбъект, Отказ);
	//rarus vikhle 28.02.2022 m 18879 ---
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры.Ссылка.ДатаРаспоряжения КАК Период,
	|	Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры.НомерСтроки КАК НомерСтроки,
	|	Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры.Дилер КАК Дилер,
	|	Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры.Менеджер КАК Менеджер,
	|	Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры.Ссылка.Менеджер КАК Пользователь,
	|	Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерами.ОтветственныеМенеджеры КАК Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры
	|ГДЕ
	|	Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерамиОтветственныеМенеджеры.Ссылка = &Ссылка"; // rarus vikhle 01.03.2022 m 18879 ---
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
	Движения.Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерами.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Движения.Scan_ЗакреплениеМенеджеровДепартаментаПродажАвтобусовЗаДилерами.Записать();
	
	// rarus vikhle 01.03.20 22 m 18879 +++
	Если ДополнительныеСвойства.Свойство("ДанныеSetAdditionalProperty") Тогда
		
		Scan_ВспомогательныеФункцииСервер.ОтправитьЗакрепленныхМенеджеровВ1БД(ДополнительныеСвойства.ДанныеSetAdditionalProperty,
							Справочники.Scan_ДополнительныеРеквизиты1БД.РегиональныйМенеджерОПАвтобусов.ИмяПредопределенныхДанных);
					
	КонецЕсли;	
	// rarus vikhle 01.03.2022 m 18879 ---
	
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли


