//rarus tenkam 09.12.2017 mantis 11952 +++
Функция ПолучитьЕдинственнуюКомплектующую(ТекКодНеисправнойДетали) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_Комплектующие.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_Комплектующие КАК Scan_Комплектующие
		|ГДЕ
		|	Scan_Комплектующие.Владелец = &ТекКодНеисправнойДетали";
	
	Запрос.УстановитьПараметр("ТекКодНеисправнойДетали", ТекКодНеисправнойДетали);
	
	РезультатЗапроса = Запрос.Выполнить();  	
	ТабРезультат = РезультатЗапроса.Выгрузить();
	
	Если ТабРезультат.Количество() = 1 Тогда
		Возврат ТабРезультат[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
//rarus tenkam 09.12.2017 mantis 11952 ---