//rarus tenkam 04.10.2017 mantis 9426 +++
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Проверим уникальность кода детали
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_КодыНеисправныхДеталей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_КодыНеисправныхДеталей КАК Scan_КодыНеисправныхДеталей
		|ГДЕ
		|	Scan_КодыНеисправныхДеталей.КодДетали = &КодДетали
		|	И Scan_КодыНеисправныхДеталей.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("КодДетали", КодДетали);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю();
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщение.Текст = "Код детали не уникальный! Код неисправности " + ВыборкаДетальныеЗаписи.Ссылка + " имеет такой же код детали.";
		Сообщение.Текст = НСтр("ru = 'Код детали не уникальный! Код неисправности ""'; en = 'The code is not unique! '") + ВыборкаДетальныеЗаписи.Ссылка + НСтр("ru = '"" имеет такой же код детали.'; en = ' '");
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Сообщение.Поле = "КодДетали";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	//rarus tenkam 01.12.2017 mantis 11952 +++
	//Если ЗначениеЗаполнено(НомерКаталожный) Тогда
	//	// Проверим уникальность каталожного номера
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Scan_КодыНеисправныхДеталей.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.Scan_КодыНеисправныхДеталей КАК Scan_КодыНеисправныхДеталей
	//	|ГДЕ
	//	|	Scan_КодыНеисправныхДеталей.НомерКаталожный = &НомерКаталожный
	//	|	И Scan_КодыНеисправныхДеталей.Ссылка <> &Ссылка";
	//	
	//	Запрос.УстановитьПараметр("НомерКаталожный", НомерКаталожный);
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "№ каталожный не уникальный! Код неисправности " + ВыборкаДетальныеЗаписи.Ссылка + " имеет такой же каталожный номер.";
	//		Сообщение.Поле = "НомерКаталожный";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли; 		
	//КонецЕсли;  
	//rarus tenkam 01.12.2017 mantis 11952 ---

КонецПроцедуры
//rarus tenkam 04.10.2017 mantis 9426 ---
