//rarus tenkam 04.11.2017 mantis 11952 +++
&НаСервере
Функция СоздатьЗаписатьДокумент()
	ДокПоступлениеКомплектующих = Документы.Scan_ПоступлениеКомплектующих.СоздатьДокумент(); 
	ДокПоступлениеКомплектующих.Дата = ТекущаяДата(); 
	ДокПоступлениеКомплектующих.Заполнить(ДокументОснование); 
	ДокПоступлениеКомплектующих.НомерВходящегоДокумента = НомерВходящегоДокумента;
	ДокПоступлениеКомплектующих.ДатаВходящегоДокумента = ДатаВходящегоДокумента;
	
	Если ИсполненаПолностью Тогда
		Попытка
			ДокПоступлениеКомплектующих.Записать(РежимЗаписиДокумента.Проведение);	
			Возврат ДокПоступлениеКомплектующих.Ссылка;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	ВсеОк = Истина;
	Если НЕ ЗначениеЗаполнено(НомерВходящегоДокумента) Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Не заполнен номер входящего документа!");
		Сообщить(НСтр("ru = 'Не заполнен номер входящего документа!'; en = 'Please enter the number of the incoming document!'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  	
		ВсеОк = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Не заполнена дата входящего документа!");
		Сообщить(НСтр("ru = 'Не заполнена дата входящего документа!'; en = 'Please enter the date of the incoming document!'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---   
		ВсеОк = Ложь;
	КонецЕсли;

	Если ВсеОк Тогда     		
		Если НЕ ИсполненаПолностью Тогда			
			ПараметрыФормы = Новый Структура("Основание", ДокументОснование);
			ПараметрыФормы.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
			ПараметрыФормы.Вставить("ДатаВходящегоДокумента", ДатаВходящегоДокумента);
			ПараметрыФормы.Вставить("ЗаполнитьПоОснованию", Истина);
			ОткрытьФорму("Документ.Scan_ПоступлениеКомплектующих.Форма.ФормаДокумента", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.Независимый);
			Закрыть(Неопределено);	
		Иначе
			ДокСсылка = СоздатьЗаписатьДокумент();
			Закрыть(ДокСсылка);
		КонецЕсли;   		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсполненаПолностью = Параметры.ИсполненаПолностью; 
	ДокументОснование = Параметры.ДокументОснование;
КонецПроцедуры
//rarus tenkam 04.11.2017 mantis 11952 ---
