//rarus pechek 10.03.2020 mantis 15466 +++
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	// rarus agar 19.05.2021 16927 ++
	//Возврат ПрисоединенныеФайлы.РеквизитыРедактируемыеВГрупповойОбработке();
	Возврат РаботаСФайлами.РеквизитыРедактируемыеВГрупповойОбработке()
	// rarus agar 19.05.2021 16927 --
	
КонецФункции

#КонецОбласти

#КонецЕсли
//rarus pechek 10.03.2020 mantis 15466 ---