
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ПараметрыСеанса.ТекущийПользователь.ПользовательСотрудник Тогда
		ТаблицаКомпаний = РегистрыСведений.Scan_КомпанииПользователей.ПолучитьКомпаниюДилераПользователя(ПараметрыСеанса.ТекущийПользователь,Истина);
		Дилер = Справочники.Scan_Компании.ПустаяСсылка();
		Если ТаблицаКомпаний.Количество()>0 Тогда
			Дилер = ТаблицаКомпаний[0].Компания;
			Контрагент = ТаблицаКомпаний[0].Контрагент;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Дилер", Дилер,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	КонецЕсли; 

КонецПроцедуры
