//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиКомандФормы

//rarus tenkam 05.11.2017 mantis 11477 +++
&НаКлиенте
Процедура ПоказатьВсе(Команда)
	Элементы.ФормаПоказатьВсе.Пометка = НЕ Элементы.ФормаПоказатьВсе.Пометка;
	ЭлементОтбора = Список.Отбор.Элементы.Получить(0);
	Если Элементы.ФормаПоказатьВсе.Пометка Тогда
		ЭлементОтбора.Использование = Ложь;
	Иначе
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;       	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Пользователи.ТекущийПользователь(); //Rarus bonmak 28.07.2022 18726 АПК ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры
//rarus tenkam 05.11.2017 mantis 11477 ---

#КонецОбласти