//rarus tenkam 07.09.2017 mantis 9425 +++
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_АккумуляторныеБатареи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_АккумуляторныеБатареи КАК Scan_АккумуляторныеБатареи
		|ГДЕ
		|	Scan_АккумуляторныеБатареи.Изделие = &Изделие
		|	И Scan_АккумуляторныеБатареи.ПорядокАКБ = &ПорядокАКБ
		|	И Scan_АккумуляторныеБатареи.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("ПорядокАКБ", ПорядокАКБ);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю();
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщение.Текст = "Для текущего изделия уже задана АКБ с таким номером!";
		Сообщение.Текст = НСтр("ru = 'Для текущего изделия уже задана АКБ с таким номером!'; en = 'Battery with the same number already added to the current product!'");
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Сообщение.Поле = "ПорядокАКБ";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка справочника", УровеньЖурналаРегистрации.Ошибка,, Ссылка, Сообщение.Текст); //rarus bonmak 20.12.2019 15531	
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
//rarus tenkam 07.09.2017 mantis 9425 ---