#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	//rarus vikhle 19.11.2021 m 18430 +++
	Возврат РаботаСФайлами.РеквизитыРедактируемыеВГрупповойОбработке()
	//rarus vikhle 19.11.2021 m 18430 ---
	
КонецФункции

#КонецОбласти

#КонецЕсли