
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//rarus vikhle 25.08.2020 mt 14916 +++
	Если Scan_ПраваИНастройки.Scan_Право("РазрешатьДобавлятьТипыТопливаДвигателейПродуктов") Тогда
		Элементы.Наименование.Доступность = Истина;
		Элементы.Наименование.ТолькоПросмотр = Ложь;
		Элементы.Код.Доступность = Истина;
		Элементы.Код.ТолькоПросмотр = Ложь;
		Элементы.СписокНаименованийТиповТопливаВ1ДБ.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.СписокНаименованийТиповТопливаВ1ДБ.ТолькоПросмотр = Истина;
	КонецЕсли;
	//rarus vikhle 25.08.2020 mt 14916 ---
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 --- 
