
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Scan_СоглашенияОПоставке") Тогда
		Поставщик           = ДанныеЗаполнения.Кузовостроитель;
		СоглашениеОПоставке = ДанныеЗаполнения.Ссылка;
		
		//ВидВзаимодействияПоставщик = Scan_ПраваИНастройки.Scan_Право("ВидВзаимодействияПоставщик");
		//
		//Запрос = Новый Запрос;
		//Запрос.УстановитьПараметр("Компания",                   ДанныеЗаполнения.Кузовостроитель);
		//Запрос.УстановитьПараметр("ВидВзаимодействияПоставщик", ВидВзаимодействияПоставщик);

		//Запрос.Текст = "ВЫБРАТЬ
		//|	Scan_ВзаимосвязьКомпанийСКонтрагентами.Контрагент КАК Контрагент
		//|ИЗ
		//|	РегистрСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами КАК Scan_ВзаимосвязьКомпанийСКонтрагентами
		//|ГДЕ
		//|	Scan_ВзаимосвязьКомпанийСКонтрагентами.Компания = &Компания
		//|	И Scan_ВзаимосвязьКомпанийСКонтрагентами.ВидВзаимодействия = &ВидВзаимодействияПоставщик";
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//Выборка = РезультатЗапроса.Выбрать();
		//Выборка.Следующий();
		//
		//Поставщик = Выборка.Контрагент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПереданВОтделПланированияПродаж Тогда
		ПроверяемыеРеквизиты.Добавить("Поставщик");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.ТоварУслуга");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.МаркаПродукта");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Количество");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Цена");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Валюта");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Дилер");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.НомераЗаказов");
	КонецЕсли;
	
КонецПроцедуры
