//rarus sergei 25.08.2016 mantis 7122 ++

// Проверка прав перед записью документа 
//
Процедура ПередЗаписьюДокументаПроверкаПрав(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ИдетЗагрузкаДанных = Ложь;
	Попытка	ИдетЗагрузкаДанных = Источник.ОбменДанными.Загрузка;
	Исключение КонецПопытки; 
	Если ИдетЗагрузкаДанных ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
		
	//проверка прав
	//Scan_ОбщегоНазначенияСервер.ПроверкаПравПередЗаписьюВДокументах(Источник, Отказ);	//rarus tenkam 06.10.2016 mantis 7183 + решили закомметировать
КонецПроцедуры
//rarus sergei 25.08.2016 mantis 7122 --

//rarus tenkam 31.10.2017 mantis 11695 +++ 
Процедура ПередЗаписьюДокументаЗаписьПараметров(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Источник.Ссылка)  Тогда
		Источник.ДатаСоздания = ТекущаяДата();
		Источник.Автор = ПользователиКлиентСервер.ТекущийПользователь(); 
		Источник.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Источник.ДатаПроведения = Дата('00010101');
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Источник.ДатаПроведения = ТекущаяДата();           
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Источник.ДатаПроведения = ?(Источник.Проведен,ТекущаяДата(), Дата('00010101'));		
	КонецЕсли;	
	
	МенеджерНовый = ПользователиКлиентСервер.ТекущийПользователь();	
	Если МенеджерНовый <> Источник.Менеджер Тогда
		Источник.Менеджер = МенеджерНовый;
		Источник.Организация = МенеджерНовый.Организация;
		Источник.ПодразделениеКомпании = МенеджерНовый.ПодразделениеОрганизации;
	КонецЕсли;  
	
КонецПроцедуры
//rarus tenkam 31.10.2017 mantis 11695 ---
