#Область ОбработчикиСобытийФормы

//rarus agar 14.08.2020 16138 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЦветФона   = РеквизитФормыВЗначение("Объект").ЦветФона.Получить();
	КонецЕсли;
	
	Если РольДоступна("Scan_ДобавлениеИзменениеСправочниковScaniaОбщие") Тогда
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.ЦветФона.Доступность        = Истина;
		Элементы.ЦветФона.ТолькоПросмотр     = Ложь;
	КонецЕсли;
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона   = Новый ХранилищеЗначения(ЦветФона);
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
  
КонецПроцедуры
//rarus agar 14.08.2020 16138 --

#КонецОбласти
