
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 08.10.2019 14177 ++
	//rarus bonmak 05.12.2019 14177 закомментировал ++
	//Если Объект.Ссылка.Пустая() Тогда
	//	ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
	//	Сообщить(ТекстОшибки);
	//	Отказ = Истина;
	//КонецЕсли;
	//rarus bonmak 08.10.2019 14177 --
	УправлениеДиалогомНаСервере();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры //rarus bonmak 08.10.2019 14177 --


&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus bonmak 08.10.2019 14177 ++
	Если ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода("GetListOfOptions", Ложь);
		СтруктураПараметров.GUID = Объект.IDExternalSystem;
		// rarus agar 16.02.2022 18594 ++
		СтруктураПараметров.ВидПродукта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПродукта, "IDExternalSystem");
		// rarus agar 16.02.2022 18594 --
		Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetListOfOptions(СтруктураПараметров);
		ЭтаФорма.Прочитать();
		УправлениеДиалогомНаСервере();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 08.10.2019 14177 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура УправлениеДиалогомНаСервере() //rarus bonmak 08.10.2019 14177 ++	
	Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));
	
	Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
		Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) //rarus bonmak 08.10.2019 14177 ++
	Если Объект.Родитель = Справочники.Scan_ОпцииПродуктов.БазовыеОпции ИЛИ Объект.ТипОпции = Справочники.Scan_ТипыОпций.БазовыеОпции Тогда
		ТекстОшибки = Нстр("ru = 'Запрещено добавление базовых опций'; en = 'It is forbidden to add basic options'");		
		Сообщить(ТекстОшибки);
		Отказ = Истина;	
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
  
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ТипОпцииПриИзменении(Элемент) //rarus BProg_Gladkov 11.12.2019 0014560 +-
	Объект.Родитель = СемействоОпцииПоТипуОпции(Объект.ТипОпции);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СемействоОпцииПоТипуОпции(ТипОпции) //rarus BProg_Gladkov 11.12.2019 0014560 +-
	Возврат Справочники.Scan_ОпцииПродуктов.СемействоОпцииПоТипуОпции(ТипОпции);
КонецФункции
