//rarus sergei 09.11.2016 mantis 7163 ++
Процедура ПередЗаписью(Отказ)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus abrant 16.11.2017 mantis 12037 +++
	Если Недействителен Тогда
		ОтправлятьПисьмаНапоминанияПоДоставкеИзделий = Ложь;
		ОтправлятьПФМ15 = Ложь;
		ОтправлятьПФЗаявкиНаДействие = Ложь;
		ОтправлятьПисьмаНапоминанияПоДоставкеИзделийПовторно = Ложь;
		ОтправлятьПФЗаявкиПеревозчику = Ложь;
		ОтправлятьПФМХ1МХ3 = Ложь;
		ОтправлятьПФМХ3 = Ложь;
		//rarus pechek 03.04.2020 mantis 15672 +++
		//Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.Недействителен Тогда
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору.Ссылка КАК Ссылка
		//		|ИЗ
		//		|	Справочник.Scan_ДоговорыВзаиморасчетов.КонтактныеЛицаПоДоговору КАК Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору
		//		|ГДЕ
		//		|	Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору.КонтактноеЛицо = &КонтактноеЛицо
		//		|
		//		|СГРУППИРОВАТЬ ПО
		//		|	Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору.Ссылка";
		//	
		//	Запрос.УстановитьПараметр("КонтактноеЛицо", Ссылка);
		//	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();			
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		ДоговорОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		//		Для каждого КЛ из ДоговорОбъект.КонтактныеЛицаПоДоговору Цикл
		//			Если КЛ.КонтактноеЛицо = Ссылка Тогда
		//				ДоговорОбъект.КонтактныеЛицаПоДоговору.Удалить(КЛ);
		//			КонецЕсли;
		//		КонецЦикла;
		//		ДоговорОбъект.Записать();
		//	КонецЦикла;
		//КонецЕсли;
		//rarus pechek 03.04.2020 mantis 15672 ---
		
		//rarus tenkam 18.08.2020 mantis 16386 +++
		ОтправлятьЧекЛистПроверкиТехсостояния = Ложь;
		ОтправлятьПФЗаявкиНаСервисныеРаботы = Ложь;
		ОтправлятьПисьмаОбОтклоненияхПоКлючевымДатамЗаказовНаЗавод = Ложь;
		ОтправлятьПисьмоСОтчетомDeliveriesReport = Ложь;
		
		МассивМестХранения = Новый Массив; // Rarus tenkam 10.02.2022 mantis 18840 +
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.МестоХранения КАК МестоХранения,
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.КонтактноеЛицо КАК КонтактноеЛицо
			|ИЗ
			|	РегистрСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения КАК Scan_ВзаимосвязьКонтактныхЛицИМестХранения
			|ГДЕ
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.КонтактноеЛицо = &КонтактноеЛицо";
			
			Запрос.УстановитьПараметр("КонтактноеЛицо", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.МестоХранения.Установить(ВыборкаДетальныеЗаписи.МестоХранения);
				НаборЗаписей.Отбор.КонтактноеЛицо.Установить(Ссылка);    		
				
				НаборЗаписей.Записать(); 
				
				МассивМестХранения.Добавить(ВыборкаДетальныеЗаписи.МестоХранения); // Rarus tenkam 10.02.2022 mantis 18840 +
			КонецЦикла;
			
			// Rarus tenkam 10.02.2022 mantis 18840 +++
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Scan_МестаХранения.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ СкорректированныеМестаХранения
			|ИЗ
			|	Справочник.Scan_МестаХранения КАК Scan_МестаХранения
			|ГДЕ
			|	Scan_МестаХранения.Ссылка В(&МассивМестХранения)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СкорректированныеМестаХранения.Ссылка КАК Ссылка,
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.КонтактноеЛицо КАК КонтактноеЛицо
			|ПОМЕСТИТЬ МестаИКЛ
			|ИЗ
			|	СкорректированныеМестаХранения КАК СкорректированныеМестаХранения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения КАК Scan_ВзаимосвязьКонтактныхЛицИМестХранения
			|		ПО СкорректированныеМестаХранения.Ссылка = Scan_ВзаимосвязьКонтактныхЛицИМестХранения.МестоХранения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МестаИКЛ.Ссылка КАК МестоХранения
			|ИЗ
			|	МестаИКЛ КАК МестаИКЛ
			|ГДЕ
			|	МестаИКЛ.КонтактноеЛицо ЕСТЬ NULL";
			
			Запрос.УстановитьПараметр("МассивМестХранения", МассивМестХранения);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				// Отправим письмо
				СписокМестХранения = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("МестоХранения");
				РезультатОтправкиПисьма = Scan_ОтправкаПисемПоЭлектроннойПочте.ОтправитьПисьмоПоШаблонуИзПрава("ШаблонПисьмаОПоявленииМестХраненияБезАктивныхКЛ", СписокМестХранения); 
			КонецЕсли;
						
			// Rarus tenkam 10.02.2022 mantis 18840 ---
		КонецЕсли;
		//rarus tenkam 18.08.2020 mantis 16386 ---
		
	КонецЕсли;
	//rarus abrant 16.11.2017 mantis 12037 ---
КонецПроцедуры
//rarus sergei 09.11.2016 mantis 7163 --