//rarus ozhnik 15888 19.05.2020 + 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Модель") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"МодельПродукта", Параметры.Модель,ВидСравненияКомпоновкиДанных.Равно, "Модель продукта",	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);//rarus agar 13.04.2021 17622 +-
	КонецЕсли;
	Если Параметры.Свойство("БУ") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"БУ", ложь,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	КонецЕсли;
	Если Параметры.Свойство("ПустоеСоглашениеОПоставке") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СоглашениеОПоставке", Справочники.Scan_СоглашенияОПоставке.ПустаяСсылка(),ВидСравненияКомпоновкиДанных.Равно, "Заявка",	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);//rarus agar 13.04.2021 17622 +-
	КонецЕсли;
	
	//rarus agar 13.04.2021 17622 ++
	ОтображениеФиксированногоОтбора();
	//rarus agar 13.04.2021 17622 --
	
КонецПроцедуры

//rarus agar 13.04.2021 17622 ++
&НаСервере
Процедура ОтображениеФиксированногоОтбора()
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_Изделия.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры
//rarus agar 13.04.2021 17622 --

//rarus ozhnik 15888 19.05.2020 - 
//rarus tenkam 04.10.2019 mantis 14442 +++

////rarus tenkam 03.06.2016 mantis 7009 ++
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Если Параметры.Свойство("ТолькоПрицепы") Тогда
//		
//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПродукта.ВидПродукта.ГруппаПродукта");
//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//		ЭлементОтбора.Использование = Истина;
//		ЭлементОтбора.ПравоеЗначение = Справочники.Scan_ГруппыПродуктов.ТранспортныеСредства;
//		Если Параметры.ТолькоПрицепы Тогда
//			
//			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПродукта.ВидПродукта.Родитель");
//			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//			ЭлементОтбора.Использование = Истина;
//			ЭлементОтбора.ПравоеЗначение = Справочники.Scan_ВидыПродуктов.ПрицепнаяТехника;
//			
//		Иначе
//			
//			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПродукта.ВидПродукта.Родитель");
//			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
//			ЭлементОтбора.Использование = Истина;
//			ЭлементОтбора.ПравоеЗначение = Справочники.Scan_ВидыПродуктов.ПрицепнаяТехника;
//			
//		КонецЕсли;
//	КонецЕсли;
//	//rarus sergei 06.07.2016 mantis 6929 ++
//	// не актуально после 7029, теперь отбор устанавливается по продукту
//	//Если Параметры.Свойство("ВидСравненияВСписке") Тогда
//	//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	//	
//	//	
//	//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
//	//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
//	//	ЭлементОтбора.Использование = Истина;
//	//	ЭлементОтбора.ПравоеЗначение = ПолучитьПродуктыПоКарточкам();

//	//КонецЕсли;
//	//rarus sergei 06.07.2016 mantis 6929 --

//	
//КонецПроцедуры
////rarus tenkam 03.06.2016 mantis 7009 --
//rarus tenkam 04.10.2019 mantis 14442 ---


//rarus sergei 06.07.2016 mantis 6929 ++

//&НаСервере
//Функция ПолучитьПродуктыПоКарточкам()
//	
//	//Запрос = Новый Запрос;
//	//Запрос.Текст = "ВЫБРАТЬ
//	//               |	Scan_ВзаимосвязьПродуктовИКарточекЗаказов.Продукт
//	//               |ИЗ
//	//               |	РегистрСведений.Scan_ВзаимосвязьПродуктовИКарточекЗаказов КАК Scan_ВзаимосвязьПродуктовИКарточекЗаказов";
//	//ПродуктыПоКарточкам = Запрос.Выполнить().Выгрузить();
//	СписокПродуктовПоКарточкам = Новый СписокЗначений;
//	//Для каждого Элемент Из ПродуктыПоКарточкам Цикл
//	//
//	//	СписокПродуктовПоКарточкам.Добавить(Элемент.Продукт);	
//	//
//	//КонецЦикла; 
//	
//	Возврат СписокПродуктовПоКарточкам;
//КонецФункции
//rarus sergei 06.07.2016 mantis 6929 --
