Функция ЗаписьЗначенияРегистраСведенияИсторияПоКонтрагентам(Контрагент, Значение, ВидЗначения, НаДату = Неопределено) Экспорт //rarus bonmak 03.06.2020 16165 ++
	
	Отказ = Ложь;
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//Чтение старого значения регистра
		СтруктураОтбора   = Новый Структура("Контрагент,ВидЗначения", Контрагент,ВидЗначения);
		СтруктураСведений = РегистрыСведений.Scan_ИсторияПоКонтрагентам.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
		ЗначениеСтарое    = СтруктураСведений.Значение;
		Записывать        = Ложь;
		//Введено значение, а старое отсутствует
		Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое = Неопределено Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Значение стерто, а старое значение было введено
		Если НЕ ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Введено значение и было введено старое
		Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда
			//Значение изменилось
			Если Значение <> ЗначениеСтарое Тогда 
				Записывать = Истина; 
			КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			//Значение параметра изменилось
			ЗаписьРегСведений = РегистрыСведений.Scan_ИсторияПоКонтрагентам.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Контрагент	  = Контрагент;
			ЗаписьРегСведений.ВидЗначения     = ВидЗначения;
			ЗаписьРегСведений.Значение        = Значение;
			ЗаписьРегСведений.Период          = ДатаЗаписи;
			ЗаписьРегСведений.Пользователь    = ПользователиКлиентСервер.ТекущийПользователь();
			
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
				Сообщить(НСтр("ru = 'Ошибка записи параметра контрагента в регистр сведений'; en = 'Error writing counterparty parameter to the information register'"));
				Отказ = Истина;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
		
	Возврат Отказ;
КонецФункции //rarus bonmak 03.06.2020 16165 --
