
//&НаСервере
//Функция ПродуктыМаркиScania()
//	Если Запись.Продукт.ТипПродукта.ВидПродукта.ГруппаПродукта.МаркаПродукта = Справочники.Scan_МаркиПродуктов.Scania И
//		Запись.ВСоставе.ТипПродукта.ВидПродукта.ГруппаПродукта.МаркаПродукта = Справочники.Scan_МаркиПродуктов.Scania Тогда	
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;
//	
//КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Если Запись.Продукт = Запись.ВСоставе Тогда
	//	Отказ = Истина;
	//	Сообщить("Нельзя связать продукт с самим собой!");
	//КонецЕсли;
	
	//Если НЕ Отказ И ПродуктыМаркиScania() Тогда
	//	Сообщить("Указана связь между продуктами марки Scania!");
	//	
	//	//// Формируем описание обработчика перехвата закрытия формы
	//	//ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияОдинаковаяМарка", ЭтотОбъект);
	//	//
	//	//// Получаем подтверждение операции от пользователя
	//	//ПоказатьВопрос(ОбработчикВопроса, "Указана связь между продуктами марки Scania. Записать?", РежимДиалогаВопрос.ДаНет);
	//	//Отказ = Истина;
	//КонецЕсли;	
	Запись.Пользователь = ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат ПользователиКлиентСервер.ТекущийПользователь();
КонецФункции

