
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеДиалогомНаСервере();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 --- 
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьЭлемент(Команда)
	
	ОбновитьЭлементНаСервере();
	ОповеститьОбИзменении(Объект.Ссылка);
	Оповестить("Запись_Файл");
	Оповестить("ЗаписьЭПТС", Объект.Владелец);
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	//Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));
	Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
		Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементНаСервере()
	
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(, Ложь);
	
	Если ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
		СтруктураПараметров.GUID = Объект.IDExternalSystem;
		Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetEPTS(СтруктураПараметров, Ложь, "");
		Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetEPTSstatement(СтруктураПараметров, Ложь, "");
	КонецЕсли;
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры


#КонецОбласти