//rarus tenkam 24.01.2017 mantis 6897 ---

// rarus tenkam 13.05.2019 mantis 14226 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Scan_ПраваИНастройки.Scan_Право("РазрешатьДобавлятьЗаказыНаЗавод") Тогда
		Элементы.Список.ИзменятьСоставСтрок = Истина;
	Иначе
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
	КонецЕсли;
		
КонецПроцедуры
// rarus tenkam 13.05.2019 mantis 14226 ---

//rarus vikhle 07.05.2020 mt 15695 +++
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();
	
	// rarus tenkam 21.08.2020 mantis 16422 +++
	ВидГрузовыеАвтомобили = Scan_ПраваИНастройки.Scan_Право("ВидПродуктаГрузовыеАвтомобили");
	Список.Параметры.УстановитьЗначениеПараметра("ВидГрузовыеАвтомобили",ВидГрузовыеАвтомобили);
	// rarus tenkam 21.08.2020 mantis 16422 ---
КонецПроцедуры
//rarus vikhle 07.05.2020 mt 15695 ---

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) //rarus bonmak 01.07.2019 14433 ++
	Для Каждого ЗначениеДинСписка Из Строки Цикл
		Если ЗначениеДинСписка.Значение.Данные.Свойство("ЗаводскойСтатусЗаказа") Тогда //rarus bonmak 28.04.2020 16023 добавил условие
			ЗначениеЗаводскогоСтатуса =  Строка(ЗначениеДинСписка.Ключ.ЗаводскойСтатусЗаказа.СтатусCOW) + "," + ЗначениеДинСписка.Ключ.ЗаводскойСтатусЗаказа.Наименование;
			ЗначениеДинСписка.Значение.Данные["ЗаводскойСтатусЗаказа"] = ЗначениеЗаводскогоСтатуса;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры //rarus bonmak 01.07.2019 14433 --



