//rarus sergei 28.09.2016 mantis 7160 ++
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//rarus tenkam 19.03.2017 mantis 9063 +++
	Если ПараметрКоманды.Количество() <> 0 Тогда
		Если Scan_ВспомогательныеФункцииСервер.ЭтоЗаявкаCПеревозкой(ПараметрКоманды[0]) Тогда
			Если НЕ Scan_ВспомогательныеФункцииСервер.ЕстьЗаявкаПеревозчику(ПараметрКоманды[0]) Тогда
				Сообщить("Не удалось сформировать печатную форму! На основании данной заявки на действие не создана заявка перевозчику.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//rarus tenkam 19.03.2017 mantis 9063 ---
	//Вставить содержимое обработчика.
    ПараметрыФормы = Новый Структура("ДанныеДляПечати", ПараметрКоманды);
	ПараметрыФормы.Вставить("ПечатнаяФорма","ПФ_MXL_ПокупкаУПоставщикаИПередачаТК");
    ОткрытьФорму("Документ.Scan_ЗаявкаНаДействие.Форма.ФормаНастроекПечати", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//rarus sergei 28.09.2016 mantis 7160 --