
//rarus vikhle 28.06.2021 АПК +-
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	//rarus vikhle 11.06.2021 mt 17637 +++
	Если Не ЭтоГруппа Тогда //rarus vikhle 21.06.2021 mt 17637
		ОбщийПроцент = УсловияОплаты.Итог("ПроцентОплаты");
		Если НЕ ОбщийПроцент = 100 Тогда 
			СтрокаПостоплаты = УсловияОплаты.Найти(Перечисления.Scan_ВидыРасчетаДатыОплаты.ОтДатыОтгрузкиDDS,"РасчетДатыОплаты");
			Если СтрокаПостоплаты = Неопределено Тогда
				СтрокаПостоплаты 					= УсловияОплаты.Добавить();
				СтрокаПостоплаты.ВидОплаты			= Перечисления.Scan_ВидыОплат.Постоплата;
				СтрокаПостоплаты.ПроцентОплаты		= 100 - ОбщийПроцент;
				СтрокаПостоплаты.СрокОплатыАванса 	= 30;
				СтрокаПостоплаты.РасчетДатыОплаты	= ПредопределенноеЗначение("Перечисление.Scan_ВидыРасчетаДатыОплаты.ОтДатыОтгрузкиDDS");
			Иначе
				СтрокаПостоплаты.ПроцентОплаты		= 100 - ОбщийПроцент; 
			КонецЕсли;	
		КонецЕсли;	
		//rarus vikhle 11.06.2021 mt 17637 ---
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) // Rarus tenkam 29.03.2022 mantis 19033 +++
		
	Если ЗначениеЗаполнено(Ссылка) И Модифицированность() Тогда
		// Проверим, не установлен ли шаблон в настройках
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ПраваИНастройки.ПравоНастройка.Код КАК Код,
		|	Scan_ПраваИНастройки.ПравоНастройка КАК ПравоНастройка,
		|	Scan_ПраваИНастройки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.Scan_ПраваИНастройки КАК Scan_ПраваИНастройки
		|ГДЕ
		|	Scan_ПраваИНастройки.Значение = &Значение";
		
		Запрос.УстановитьПараметр("Значение", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ВывестиСообщениеПол(НСтр("ru='Не удалось записать изменения. Шаблон указан в настройке %1 <%2>.'"),,,,,ВыборкаДетальныеЗаписи.Код, ВыборкаДетальныеЗаписи.ПравоНастройка);	
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;                                                 
	
КонецПроцедуры // Rarus tenkam 29.03.2022 mantis 19033 ---

#КонецОбласти

//rarus vikhle 28.06.2021 АПК++
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
//rarus vikhle 28.06.2021 ---