&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТипОпцииSOrder 			= Справочники.Scan_ТипыОпций.SOrderОпции;
	ТипОпцииFFU 			= Справочники.Scan_ТипыОпций.FFUОпции;
	
	Если ТекущийОбъект.Опция.ТипОпции <> ТипОпцииSOrder И ТекущийОбъект.Опция.ТипОпции <> ТипОпцииFFU Тогда
		ТекстСообщения = "Неверный тип опции. Запись возможна только с типом опции S-order / FUU";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Запись.Опция",, Отказ);
	КонецЕсли;
КонецПроцедуры
