//rarus sergei 28.09.2016 mantis 7160 ++
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    //rarus tenkam 19.03.2017 mantis 9063 +++
	Если ПараметрКоманды.Количество() <> 0 Тогда
		Если Scan_ВспомогательныеФункцииСервер.ЭтоЗаявкаCПеревозкой(ПараметрКоманды[0]) Тогда
			Если НЕ Scan_ВспомогательныеФункцииСервер.ЕстьЗаявкаПеревозчику(ПараметрКоманды[0]) Тогда
				Сообщить("Не удалось сформировать печатную форму! На основании данной заявки на действие не создана заявка перевозчику.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//rarus tenkam 19.03.2017 mantis 9063 ---
	
	//rarus tenkam 01.11.2017 mantis 9974 +++
	Если ПараметрКоманды.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ДанныеДляПечати", ПараметрКоманды);
	ПараметрыФормы.Вставить("ПечатнаяФорма","М15");
    ОткрытьФорму("Документ.Scan_ЗаявкаНаДействие.Форма.ФормаВыбораДатыМХ1", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(    "Документ.Scan_ЗаявкаНаДействие",        //Менеджер печати
	//                        "М15",            //Идентификатор
	//                        ПараметрКоманды,        //Объекты печати
	//                        ЭтотОбъект);               //Владелец формы - форма из которой вызывается печать
	
	//rarus tenkam 01.11.2017 mantis 9974 ---
 
КонецПроцедуры
//rarus sergei 28.09.2016 mantis 7160 --