//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Запись.РучноеИзменение Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъектНастройки", Запись.ОбъектНастройки);
		Запрос.УстановитьПараметр("РольИсполнителя", Запись.РольИсполнителя);
		Запрос.УстановитьПараметр("ТипСоглашенияОПоставке", Запись.ТипСоглашенияОПоставке);
		Запрос.УстановитьПараметр("Статус", Запись.Статус);
		Запрос.УстановитьПараметр("ИмяЭлемента", Запись.ИмяЭлемента);
		Запрос.УстановитьПараметр("ХозОперация", Запись.ХозОперация);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Scan_ПараметрыВидимостиОбъектов.Видимость КАК Видимость,
		|	Scan_ПараметрыВидимостиОбъектов.Доступность КАК Доступность,
		|	Scan_ПараметрыВидимостиОбъектов.РучноеИзменение КАК РучноеИзменение
		|ИЗ
		|	РегистрСведений.Scan_ПараметрыВидимостиОбъектов КАК Scan_ПараметрыВидимостиОбъектов
		|ГДЕ
		|	Scan_ПараметрыВидимостиОбъектов.ОбъектНастройки = &ОбъектНастройки
		|	И Scan_ПараметрыВидимостиОбъектов.РольИсполнителя = &РольИсполнителя
		|	И Scan_ПараметрыВидимостиОбъектов.ТипСоглашенияОПоставке = &ТипСоглашенияОПоставке
		|	И Scan_ПараметрыВидимостиОбъектов.Статус = &Статус
		|	И Scan_ПараметрыВидимостиОбъектов.ИмяЭлемента = &ИмяЭлемента
		|	И Scan_ПараметрыВидимостиОбъектов.ХозОперация = &ХозОперация";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Запись.РучноеИзменение = Выборка.РучноеИзменение Или (Запись.Видимость <> Выборка.Видимость) Или (Запись.Доступность <> Выборка.Доступность);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти