//rarus tenkam 08.06.2016 mantis 7042 ++
Процедура ПередЗаписью(Отказ)
	//rarus sergei 09.11.2016 mantis 7163 ++
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus sergei 09.11.2016 mantis 7163 --
	
	//rarus vikhle 22.09.2020 mt 16181 +++
	//ОтборСтруктура = Новый Структура("Наименование", Наименование);		
	//
	//Выборка = Справочники.Scan_СпецификацииПродуктов.Выбрать(,,ОтборСтруктура);
	//
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Ссылка = Ссылка Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Сообщение = Новый СообщениеПользователю;
	//	//rarus FominskiyAS 24.04.2019  mantis 14191 +++
	//	//Сообщение.Текст = "Данная спецификация уже существует!";
	//	Сообщение.Текст = НСтр("ru = 'Данная спецификация уже существует!'; en = 'This specification already exists!'");
	//	//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
	//	Сообщение.Сообщить();
	//	ЗаписьЖурналаРегистрации("Ошибка справочника", УровеньЖурналаРегистрации.Ошибка,, Ссылка, Сообщение.Текст); //rarus bonmak 20.12.2019 15531

	//	Отказ = Истина;
	//	Возврат;	//rarus tenkam 22.06.2016 mantis 7042 +
	//КонецЦикла;
	//rarus vikhle 22.09.2020 mt 16181 ---
КонецПроцедуры
//rarus tenkam 08.06.2016 mantis 7042 --

