#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//rarus vikhle 14.02.2023 m 19839 +++
// Возвращает массив марок, указанных в тч "Доступные марки дилера" компаний пользователя
Функция МаркиДоступныеПользователю(Пользователь) Экспорт
	
	КомпанииСКонтрагентами = РегистрыСведений.Scan_КомпанииПользователей.ПолучитьКомпаниюДилераПользователя(Пользователь);
	КомпанииПользователя   = КомпанииСКонтрагентами.ВыгрузитьКолонку("Компания");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_КомпанииДоступныеМаркиДилера.Марка КАК Марка
	|ИЗ
	|	Справочник.Scan_Компании.ДоступныеМаркиДилера КАК Scan_КомпанииДоступныеМаркиДилера
	|ГДЕ
	|	Scan_КомпанииДоступныеМаркиДилера.Ссылка В (&КомпанииПользователя)";
	Запрос.УстановитьПараметр("КомпанииПользователя", КомпанииПользователя);
	
	ДоступныеМарки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Марка");
	
	Возврат ДоступныеМарки;
	
КонецФункции	
//rarus vikhle 14.02.2023 m 19839 ---

#КонецЕсли