Перем НаименованиеДоИзменения; //rarus vikhle 04.09.2020 mt 16181 

//rarus sergei 02.11.2016 mantis 7163 ++
Процедура ПередЗаписью(Отказ)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	НаименованиеДоИзменения = Ссылка.Наименование;//rarus vikhle 04.09.2020 mt 16181 
КонецПроцедуры
//rarus sergei 02.11.2016 mantis 7163 --

Процедура ПриЗаписи(Отказ)
	//rarus vikhle 04.09.2020 mt 16181 +++
	Если НЕ ЭтоНовый() И НЕ Наименование = НаименованиеДоИзменения Тогда
		Справочники.Scan_ДрафтыПродуктов.ОбновитьНаименованиеДрафта(Ссылка);
	КонецЕсли;
	//rarus vikhle 04.09.2020 mt 16181 ---
КонецПроцедуры

