//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаHTML = "<HTML><BODY>";
	ОбъектСоглашения = Параметры.Объект;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Чат.Объект КАК Объект,
		|	Чат.Пользователь КАК Пользователь,
		|	Чат.ДоступноДилеру КАК ДоступноДилеру,
		|	Чат.ТекстСообщения КАК ТекстСообщения,
		|	Чат.Период КАК Период
		|ИЗ
		|	РегистрСведений.Чат КАК Чат
		|ГДЕ
		|	Чат.Объект = &Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Объект", ОбъектСоглашения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаHTML = СтрокаHTML + "<h2>" +ВыборкаДетальныеЗаписи.ТекстСообщения + "</h2>";
	СтрокаHTML = СтрокаHTML + "<p><em>" + ВыборкаДетальныеЗаписи.Период +" " + ВыборкаДетальныеЗаписи.Пользователь + "</em></p>";
	СтрокаHTML = СтрокаHTML + "<BR>";
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	СтрокаHTML = СтрокаHTML + "</body></html>";
	ПолеHTML = СтрокаHTML;
КонецПроцедуры

#КонецОбласти