//rarus FominskiyAS 12.08.2019  mantis 14760 +++

&НаКлиенте
Процедура Печать(Команда)
	 	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("МассивОбъектов", Элементы.Список.ВыделенныеСтроки);
	
	ПараметрКоманды = Новый Массив;
	Для каждого элемент из Элементы.Список.ВыделенныеСтроки цикл
	ПараметрКоманды.Добавить(элемент);
	КонецЦикла;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		МодульУправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Scan_ПакетыСервисныхОпераций", "СервисныеОперацииПриКТС", 
			ПараметрКоманды, ЭтотОбъект, ПараметрыПечати);
	КонецЕсли;
	
КонецПроцедуры

//rarus FominskiyAS 12.08.2019  mantis 14760 ---  
