Функция ПолучитьЗаказыНаЗаводСОтборомПоОпции(Опция) Экспорт
	Если НЕ ЗначениеЗаполнено(Опция) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Опция", Опция);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КвотыSOrderFFUФакт.ЗаказНаЗавод КАК ЗаказНаЗавод
	               |ИЗ
	               |	РегистрСведений.Scan_КвотыSOrderFFUФакт КАК Scan_КвотыSOrderFFUФакт
	               |ГДЕ
	               |	Scan_КвотыSOrderFFUФакт.Опция = &Опция";
		
	СписокЗаказовНаЗавод = Запрос.Выполнить().Выгрузить();
		
	Возврат СписокЗаказовНаЗавод;
КонецФункции


Функция ПолучитьОпцию(ЗаказНаЗавод, ТипОпции) Экспорт
	МенеджерЗаписи = РегистрыСведений.Scan_КвотыSOrderFFUФакт.СоздатьМенеджерЗаписи();	
	
	МенеджерЗаписи.ЗаказНаЗавод 	= ЗаказНаЗавод;
	МенеджерЗаписи.ТипОпции 		= ТипОпции;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.Опция;	
КонецФункции
