
//rarus vikhle 11.03.2021 mt 17411 +++
Процедура УдалитьЗаписьПоЗаказу(ЗаказНаЗавод) Экспорт
	Если НЕ ТипЗнч(ЗаказНаЗавод) = Тип("СправочникСсылка.Scan_ЗаказыНаЗавод")  
		Или (ТипЗнч(ЗаказНаЗавод) = Тип("СправочникСсылка.Scan_ЗаказыНаЗавод") И ЗаказНаЗавод.Пустая()) Тогда
		Возврат;		
	КонецЕсли;	
	
	МенеджерЗаписи =  РегистрыСведений.Scan_ОчередьDDИнформера.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.ЗаказНаЗавод = ЗаказНаЗавод;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Попытка
			МенеджерЗаписи.Удалить();
		Исключение
			Сообщить(НСтр("ru = 'Ошибка записи данных в регистр сведений'; en = 'Action failed'"));
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры	
//rarus vikhle 11.03.2021 mt 17411 ---
