#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьСписокВыбора() Экспорт //rarus bonmak 04.09.2019 14442 ++ //rarus bonmak 17468 23.09.2021 вынес в модуль менеджера
    СписокВыбора = Новый СписокЗначений;
	Для Каждого СтрТип Из Метаданные.Справочники Цикл 
		СписокВыбора.Добавить(СтрТип.Имя)
	КонецЦикла;
	
	// rarus tenkam 25.09.2019 mantis 14442 +++
	Для Каждого СтрТип Из Метаданные.РегистрыСведений Цикл 
		СписокВыбора.Добавить(СтрТип.Имя)
	КонецЦикла;
	// rarus tenkam 25.09.2019 mantis 14442 ---
	
    Возврат СписокВыбора;   
КонецФункции //rarus bonmak 04.09.2019 14442 --

#КонецЕсли

#КонецОбласти