//rarus bonmak 09.08.2021 16834 ++
//&НаСервере
//Функция ЕстьДокументНаОсновании(СсылкаНаДокумент)
//	ТекстЗапроса = "ВЫБРАТЬ
//	               |	Scan_УстановкаПланаПоОтгрузкам.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Документ.Scan_УстановкаПланаПоОтгрузкам КАК Scan_УстановкаПланаПоОтгрузкам
//	               |ГДЕ
//	               |	Scan_УстановкаПланаПоОтгрузкам.ДокументОснование = &ДокументОснование
//	               |	И Scan_УстановкаПланаПоОтгрузкам.Проведен";
//	Запрос = Новый Запрос(ТекстЗапроса);
//	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаДокумент);
//	РезультатЗапроса = Запрос.Выполнить();
//	Возврат Не РезультатЗапроса.Пустой();
//КонецФункции

//&НаСервере
//Функция ЕстьДокументУстановкаПланаПоОтгрузкам()
//	ТекстЗапроса = "ВЫБРАТЬ
//	               |	Scan_УстановкаПланаПоОтгрузкам.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Документ.Scan_УстановкаПланаПоОтгрузкам КАК Scan_УстановкаПланаПоОтгрузкам
//	               |ГДЕ
//	               |	Scan_УстановкаПланаПоОтгрузкам.Проведен
//	               |	И Scan_УстановкаПланаПоОтгрузкам.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//	               |	И Scan_УстановкаПланаПоОтгрузкам.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.УстановкаПланаПоОтгрузкам)";
//	Запрос = Новый Запрос(ТекстЗапроса);
//	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата()));
//	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(ТекущаяДата()));
//	РезультатЗапроса = Запрос.Выполнить();
//	Возврат Не РезультатЗапроса.Пустой();
//КонецФункции

//&НаСервереБезКонтекста
//Функция ДокументПомеченНаУдаление(Ссылка)
//	Возврат Ссылка.ПометкаУдаления;
//КонецФункции

//&НаСервереБезКонтекста
//Функция ДокументПроведен(Ссылка)
//	Возврат Ссылка.Проведен;
//КонецФункции
//rarus bonmak 09.08.2021 16834 --	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();//rarus vikhle 07.05.2020 mt 15695
КонецПроцедуры

