
#Область СобытияЭлементовФормы

//rarus vikhle 11.06.2021 mt 17637 +++
&НаКлиенте
Процедура УсловияОплатыВидОплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УсловияОплаты.ТекущиеДанные;
	Если ТекущиеДанные.ВидОплаты = ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Постоплата") Тогда 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидОплаты",ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Постоплата"));
		СтрокиПостоплаты = Объект.УсловияОплаты.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиПостоплаты.Количество() > 1 Тогда
			ТекущиеДанные.ВидОплаты = ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Предоплата");
			ТекущиеДанные.РасчетДатыОплаты	= ПредопределенноеЗначение("Перечисление.Scan_ВидыРасчетаДатыОплаты.ОтДатыДоговора");
			ОчиститьСообщения();
			ВывестиСообщениеПол(Нстр("ru = 'В таблице уже есть строка с постоплатой.'"));
		Иначе
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ВидОплаты",ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Предоплата"));
			МассивСтрокПредоплаты = Объект.УсловияОплаты.НайтиСтроки(ПараметрыОтбора);
			ОбщийПроцентПредоплаты = Объект.УсловияОплаты.Итог("ПроцентОплаты");	
			ТекущиеДанные.ПроцентОплаты = 100 - ОбщийПроцентПредоплаты;
			ТекущиеДанные.РасчетДатыОплаты	= ПредопределенноеЗначение("Перечисление.Scan_ВидыРасчетаДатыОплаты.ОтДатыОтгрузкиDDS");
			ТекущиеДанные.СрокОплатыАванса	= 30;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияОплатыПроцентОплатыПриИзменении(Элемент)
	
	ТекущиеДанные	= Элементы.УсловияОплаты.ТекущиеДанные;
	ОбщийПроцент	= Объект.УсловияОплаты.Итог("ПроцентОплаты");
			
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОплаты",ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Постоплата"));
	
	СтрокиПостоплаты = Объект.УсловияОплаты.НайтиСтроки(ПараметрыОтбора);
				
	Если СтрокиПостоплаты.Количество() = 0 Тогда
		Если ОбщийПроцент > 100 Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Общий процент превышает 100'"));
			ТекущиеДанные.ПроцентОплаты = 0;
		КонецЕсли;	
	Иначе
		Если ОбщийПроцент > 100 Тогда
			// Проверка на превышение 100% после автоматической корректировки процента в строке постоплаты
			ДоляПредоплаты = СтрокиПостоплаты[0].ПроцентОплаты - (ОбщийПроцент - 100);
			Если ДоляПредоплаты < 0 Тогда 
				ВывестиСообщениеПол(Нстр("ru = 'Общий процент превышает 100'"));
				ТекущиеДанные.ПроцентОплаты = 0;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	ОбновитьСтрокуПостоплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтрокуПостоплаты()
	
	ПустаяСсылкаПродукта = ПредопределенноеЗначение("Справочник.Scan_Изделия.ПустаяСсылка");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОплаты", ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Постоплата"));
		
	СтрокиПостоплаты = Объект.УсловияОплаты.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиПостоплаты.Количество() = 0 Тогда
		Возврат;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидОплаты", ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Предоплата"));
		МассивСтрокПредоплаты  = Объект.УсловияОплаты.НайтиСтроки(ПараметрыОтбора);
		ОбщийПроцентПредоплаты = 0;
		Для Каждого ЭлементМассива Из МассивСтрокПредоплаты Цикл
			ОбщийПроцентПредоплаты = ОбщийПроцентПредоплаты + ЭлементМассива.ПроцентОплаты;  
		КонецЦикла;	
		СтрокиПостоплаты[0].ПроцентОплаты = 100 - ОбщийПроцентПредоплаты;
	КонецЕсли;	
	//rarus vikhle 09.10.2020 mt 16181 ---	
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		ВывестиСообщениеПол(Нстр("ru = 'Копирование строк табличной части запрещено'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ВидОплаты = ПредопределенноеЗначение("Перечисление.Scan_ВидыОплат.Предоплата");
		Элемент.ТекущиеДанные.РасчетДатыОплаты	= ПредопределенноеЗначение("Перечисление.Scan_ВидыРасчетаДатыОплаты.ОтДатыДоговора");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 ---

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	
КонецПроцедуры

//rarus vikhle 11.06.2021 mt 17637 ---

#КонецОбласти