//rarus tenkam 18.11.2017 mantis 9427 +++
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.СоставЗаявки.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Счет на оплату
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СчетЗаказ";
	//КомандаПечати.Представление = НСтр("ru = 'Счет на оплату'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Не Пользователи.РолиДоступны("_ДемоПечатьНепроведенныхДокументов");
	
	//// Демо-пример ограничения доступности команд печати.
	//Если Пользователи.РолиДоступны("_ДемоПечатьСчетаНаОплатуНаПринтер") Тогда
	//	// Счет на оплату (на принтер).
	//	КомандаПечати = КомандыПечати.Добавить();
	//	КомандаПечати.Идентификатор = "СчетЗаказ";
	//	КомандаПечати.Представление = НСтр("ru = 'Счет на оплату (на принтер)'");
	//	КомандаПечати.Картинка = БиблиотекаКартинок.ПечатьСразу;
	//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//	КомандаПечати.СразуНаПринтер = Истина;
	//КонецЕсли;
	//
	//// Комплект документов
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СчетЗаказ,СчетЗаказ2,СчетЗаказ2,Обработка._ДемоПечатнаяФорма.ГарантийноеПисьмо,СчетЗаказ,СчетЗаказ,СчетЗаказ2";
	//КомандаПечати.Представление = НСтр("ru = 'Комплект документов'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ФиксированныйКомплект = Истина;
	//КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	//КомандаПечати.Порядок = 75;
	//
	//// Комплект документов (на принтер).
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СчетЗаказ,СчетЗаказ2,СчетЗаказ2,Обработка._ДемоПечатнаяФорма.ГарантийноеПисьмо,СчетЗаказ,СчетЗаказ,СчетЗаказ2";
	//КомандаПечати.Представление = НСтр("ru = 'Комплект документов (на принтер)'");
	//КомандаПечати.Картинка = БиблиотекаКартинок.ПечатьСразу;
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ФиксированныйКомплект = Истина;
	//КомандаПечати.ПереопределитьПользовательскиеНастройкиКоличества = Истина;
	//КомандаПечати.СразуНаПринтер = Истина;
	//КомандаПечати.Порядок = 75;
	//
	//// Настраиваемый комплект документов.
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СчетЗаказ,СчетЗаказ2,СчетЗаказ2,Обработка._ДемоПечатнаяФорма.ГарантийноеПисьмо,СчетЗаказ,СчетЗаказ,СчетЗаказ2";
	//КомандаПечати.Представление = НСтр("ru = 'Настраиваемый комплект документов'");
	//КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Настраиваемый комплект'");
	//КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами = Истина;
	//КомандаПечати.Порядок = 75;
	//
	//// Счет на оплату в документ Adobe PDF.
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СчетЗаказ";
	//КомандаПечати.Представление = НСтр("ru = 'Счет на оплату в документ Adobe PDF'");
	//КомандаПечати.Картинка = БиблиотекаКартинок.ФорматPDF;
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ФорматСохранения = ТипФайлаТабличногоДокумента.PDF;
	//
	//// Счет на оплату в Microsoft Word.
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СчетНаОплату(MSWord)";
	//КомандаПечати.Представление = НСтр("ru = 'Счет на оплату в Microsoft Word'");
	//КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.Обработчик = "_ДемоСтандартныеПодсистемыКлиент.ПечатьСчетовНаОплатуПокупателю";
	//КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	//
	//// Счет на оплату в OpenOffice.org Writer.
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СчетНаОплату(ODT)";
	//КомандаПечати.Представление = НСтр("ru = 'Счет на оплату в OpenOffice.org Writer'");
	//КомандаПечати.Картинка = БиблиотекаКартинок.ФорматOpenOfficeWriter;
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.Обработчик = "_ДемоСтандартныеПодсистемыКлиент.ПечатьСчетовНаОплатуПокупателю";
	//КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	
	//// Квитанция на оплату с QR кодом.
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПФ_MXL_Тест";
	//КомандаПечати.Представление = НСтр("ru = 'Заявка на действие (тест)'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	//КомандаПечати.Порядок = 85;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//rarus sergei 29.09.2016 mantis 7162 ++	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СервисныеОперацииПриКТС") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
	//	"ПФ_MXL_СервисныеОперацииПриКТС",
	//	"Сервисные операции при КТС",
	//	ПечатьПФ_MXL_СервисныеОперацииПриКТС(МассивОбъектов, ОбъектыПечати,, ПараметрыПечати));
	//КонецЕсли;          	
	
КонецПроцедуры

Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт
	
	//ДанныеПоВсемОбъектам = Новый Соответствие;
	//
	//Для Каждого ОбъектСсылка Из МассивДокументов Цикл
	//	ДанныеОбъектаПоМакетам = Новый Соответствие;
	//	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
	//		ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка));
	//	КонецЦикла;
	//	ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	//КонецЦикла;
	//
	//ОписаниеОбластей = Новый Соответствие;
	//ДвоичныеДанныеМакетов = Новый Соответствие;
	//ТипыМакетов = Новый Соответствие;
	//
	//Для Каждого ИмяМакета Из МассивИменМакетов Цикл
	//	Если ИмяМакета = "СчетНаОплату(MSWord)" Тогда
	//		ДвоичныеДанныеМакетов.Вставить(ИмяМакета, 
	//			УправлениеПечатью.МакетПечатнойФормы("Документ._ДемоСчетНаОплатуПокупателю.ПФ_DOC_СчетНаОплату"));
	//		ТипыМакетов.Вставить(ИмяМакета, "DOC");
	//	ИначеЕсли ИмяМакета = "СчетНаОплату(ODT)" Тогда
	//		ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет._ДемоПФ_ODT_СчетНаОплату"));
	//		ТипыМакетов.Вставить(ИмяМакета, "ODT");
	//	КонецЕсли;
	//	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	//КонецЦикла;
	//
	//Возврат Новый Структура("Данные, Макеты",
	//	ДанныеПоВсемОбъектам,
	//	Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
	//		ОписаниеОбластей,
	//		ТипыМакетов,
	//		ДвоичныеДанныеМакетов));
	
КонецФункции

#КонецОбласти
#КонецЕсли

//Функция ПечатьПФ_MXL_СервисныеОперацииПриКТС(МассивОбъектов,ОбъектыПечати,ИмяМакета = "ПечатьПФ_MXL_СервисныеОперацииПриКТС",ПараметрыПечати) Экспорт
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	Если МассивОбъектов.Количество() = 1 Тогда
//		ТабличныйДокумент.ИспользуемоеИмяФайла = Scan_Печать.ПолучитьПредставлениеДокумента(МассивОбъектов[0],"Чек лист технического состояния изделия");
//	КонецЕсли;
//	
//	ТабличныйДокумент.КлючПараметровПечати = "ПФ_MXL_СервисныеОперацииПриКТС";
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Scan_ЧекЛистТехническогоСостоянияИзделия.ПФ_MXL_СервисныеОперацииПриКТС");
//	 	
//	Документ = МассивОбъектов[0];
//		
//	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
//	ОбластьСтрокаПервая = Макет.ПолучитьОбласть("СтрокаПервая");
//	ОбластьСтрокаВложенная = Макет.ПолучитьОбласть("СтрокаВложенная");
//	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
//	
//	//Заполним шапку
//	Если ЗначениеЗаполнено(Документ.ДоговорСИсполнителем) Тогда
//		ОбластьШапка.Параметры.ДоговорСИсполнителем = "№ " + Документ.ДоговорСИсполнителем.НомерДоговора + " от " + Формат(Документ.ДоговорСИсполнителем.ДатаНачала, "ДЛФ=ДД");
//	КонецЕсли;
//	Если ЗначениеЗаполнено(Документ.Изделие) Тогда
//		ОбластьШапка.Параметры.НомерШасси = Документ.Изделие.НомерИзделия;
//	КонецЕсли;
//	
//	ДатаПостановкиНаХранение = РегистрыСведений.Scan_МатрицаХраненияИзделий.ПолучитьДатуПостановкиНаХранение(Документ.Изделие, Документ.МестоХранения, Документ, Документ.ПлановаяДатаВыполненияКТС);
//	ОбластьШапка.Параметры.ДатаПостановкиНаХранение = Формат(ДатаПостановкиНаХранение, "ДЛФ=ДД");
//	ТабличныйДокумент.Вывести(ОбластьШапка);
//	//Заполним строки
//	
//	НомерСтроки = 1;
//	НомерВложеннойСтроки = 1;
//	МассивБукв = ПолучитьМассивБукв();
//	
//	СтараяПерваяСтрока = Неопределено;
//	ВерхняяСтрокаДерева = Неопределено;
//	Для Каждого ТекСтрокаОбъекта Из Документ.СписокРабот Цикл
//		Если Не ЗначениеЗаполнено(ТекСтрокаОбъекта.Составляющая) Тогда
//			ОбластьСтрокаПервая.Параметры.НомерСтроки = НомерСтроки;
//			ОбластьСтрокаПервая.Параметры.Работы = ТекСтрокаОбъекта.Работы;			
//			ОбластьСтрокаПервая.Параметры.РезультатБыло = ТекСтрокаОбъекта.РезультатБыло;
//			ОбластьСтрокаПервая.Параметры.РезультатСтало = ТекСтрокаОбъекта.РезультатСтало;	
//			НомерСтроки = НомерСтроки + 1;
//			
//			ТабличныйДокумент.Вывести(ОбластьСтрокаПервая);
//		Иначе
//			Если СтараяПерваяСтрока <> ТекСтрокаОбъекта.Работы Тогда
//				ЭтоПерваяСтрока = Истина;
//			Иначе
//				ЭтоПерваяСтрока = Ложь;
//			КонецЕсли;
//			
//			Если ЭтоПерваяСтрока Тогда
//				
//				ОбластьСтрокаПервая.Параметры.НомерСтроки = НомерСтроки;
//				ОбластьСтрокаПервая.Параметры.Работы = ТекСтрокаОбъекта.Работы;			
//				СтараяПерваяСтрока = ТекСтрокаОбъекта.Работы;
//				НомерСтроки = НомерСтроки + 1;
//				НомерВложеннойСтроки = 1;
//				
//				ТабличныйДокумент.Вывести(ОбластьСтрокаПервая);
//			КонецЕсли;
//			Если ЗначениеЗаполнено(СтараяПерваяСтрока) Тогда
//				ОбластьСтрокаВложенная.Параметры.НомерСтроки = МассивБукв[НомерВложеннойСтроки];
//				ОбластьСтрокаВложенная.Параметры.Составляющая = ТекСтрокаОбъекта.Составляющая;			
//				ОбластьСтрокаВложенная.Параметры.РезультатБыло = ТекСтрокаОбъекта.РезультатБыло;
//				ОбластьСтрокаВложенная.Параметры.РезультатСтало = ТекСтрокаОбъекта.РезультатСтало;	
//				НомерВложеннойСтроки = НомерВложеннойСтроки + 1;
//				
//				ТабличныйДокумент.Вывести(ОбластьСтрокаВложенная);
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла; 	
//	
//	ТабличныйДокумент.Вывести(ОбластьПодвал);
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

//rarus tenkam 18.11.2017 mantis 9427 ---
