//rarus tenkam 06.06.2016 mantis 7042 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	//rarus bonmak 08.10.2019 14177 ++
	//Если Параметры.Свойство("МодельПродукта") Тогда
	//	Если ЗначениеЗаполнено(Параметры.МодельПродукта) Тогда
	//		Объект.МодельПродукта = Параметры.МодельПродукта;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Если Параметры.Свойство("Наименование") Тогда
	//	Если ЗначениеЗаполнено(Параметры.Наименование) Тогда
	//		Объект.Наименование = Параметры.Наименование;
	//	КонецЕсли;
	//КонецЕсли;
	//rarus bonmak 08.10.2019 14177 --
	УправлениеДиалогомНаСервере(); 	//rarus tenkam 18.10.2016 mantis 6897 +
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры
//rarus tenkam 06.06.2016 mantis 7042 --

//rarus vikhle 07.05.2020 mt 15695 +++
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();
КонецПроцедуры
//rarus vikhle 07.05.2020 mt 15695 ---

//rarus tenkam 18.10.2016 mantis 6897 ++
&НаСервере
Процедура ОбновитьЭлементНаСервере()
	// rarus tenkam 09.09.2019 mantis 14841 +++	
	//Если НЕ ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
	//	//Создан вручную
	//Иначе
	//	ИмяМетода = "GetSpecification";
	//	СообщениеОбОшибке = "";
	//	Отказ = Ложь;
	//	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода ,Ложь);
	//	СтруктураПараметров.Вставить("GUID", Объект.IDExternalSystem);
	//	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	//	//ТекЭлементЗапрос = Scan_ВебСервисы.СформироватьСообщениеОбмена(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации); 
	//	ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	//	Если НЕ Отказ Тогда
	//		СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникСпецификацииПродуктов(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
	//	КонецЕсли;	
	//	ЭтаФорма.Прочитать();
	//	УправлениеДиалогомНаСервере();
	//КонецЕсли
	// rarus tenkam 09.09.2019 mantis 14841 ---
	Если Элементы.ГруппаВидыБазовыхОпций.ТекущаяСтраница.Имя = "ГруппаSPORTСпецификация" Тогда	
		ЗначениеGUID = СсылкаSPORTСпецификация.IDExternalSystem;	
	ИначеЕсли Элементы.ГруппаВидыБазовыхОпций.ТекущаяСтраница.Имя = "ГруппаCOWСпецификацияЗаказанная" Тогда	
		ЗначениеGUID = СсылкаCOWСпецификацияЗаказанная.IDExternalSystem;
	ИначеЕсли Элементы.ГруппаВидыБазовыхОпций.ТекущаяСтраница.Имя = "ГруппаCOWСпецификацияПодтвержденнаяЗаводом" Тогда	
		ЗначениеGUID = СсылкаCOWСпецификацияПодтвержденнаяЗаводом.IDExternalSystem;
	ИначеЕсли Элементы.ГруппаВидыБазовыхОпций.ТекущаяСтраница.Имя = "ГруппаCOWСпецификацияЛокальная" Тогда	
		ЗначениеGUID = СсылкаCOWСпецификацияЛокальная.IDExternalSystem;
	ИначеЕсли Элементы.ГруппаВидыБазовыхОпций.ТекущаяСтраница.Имя = "ГруппаSPIIСпецификация" Тогда	
		ЗначениеGUID = СсылкаSPIIСпецификация.IDExternalSystem;
	Иначе
		ЗначениеGUID = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеGUID) Тогда
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(, Ложь);
		СтруктураПараметров.GUID = ЗначениеGUID;
		Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetSpecification(СтруктураПараметров);
		ЭтаФорма.Прочитать();
		УправлениеДиалогомНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлемент(Команда)
	ОбновитьЭлементНаСервере();
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	//rarus bonmak 08.10.2019 14177 ++
	//заполним версии спецификаций
	ЗаполнитьБазовыеВерсииСпецификаций();
	//заполним остальными типы опций
	ЗаполнитьТипыОпцийКромеБазовых();
	//rarus bonmak 08.10.2019 14177 --
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБазовыеВерсииСпецификаций() //rarus bonmak 08.10.2019 14177 ++
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ВерсииБазовыхСпецификаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_ВерсииБазовыхСпецификаций КАК Scan_ВерсииБазовыхСпецификаций
		|ГДЕ
		|	Scan_ВерсииБазовыхСпецификаций.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.SPORTСпецификация Тогда
				СсылкаSPORTСпецификация = ВыборкаДетальныеЗаписи.Ссылка;
				ОпцииSPORTСпецификация.Загрузить(СсылкаSPORTСпецификация.РасшифровкаОпций.Выгрузить());
			ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.COWСпецификацияЗаказанная Тогда
				СсылкаCOWСпецификацияЗаказанная = ВыборкаДетальныеЗаписи.Ссылка;
				ОпцииCOWСпецификацияЗаказанная.Загрузить(СсылкаCOWСпецификацияЗаказанная.РасшифровкаОпций.Выгрузить());
			ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.COWСпецификацияЛокальная Тогда
				СсылкаCOWСпецификацияЛокальная = ВыборкаДетальныеЗаписи.Ссылка;
				ОпцииCOWСпецификацияЛокальная.Загрузить(СсылкаCOWСпецификацияЛокальная.РасшифровкаОпций.Выгрузить());
			ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.COWСпецификацияПодтвержденнаяЗаводом Тогда
				СсылкаCOWСпецификацияПодтвержденнаяЗаводом = ВыборкаДетальныеЗаписи.Ссылка;
				ОпцииCOWСпецификацияПодтвержденнаяЗаводом.Загрузить(СсылкаCOWСпецификацияПодтвержденнаяЗаводом.РасшифровкаОпций.Выгрузить());
			ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидСпецификации = Справочники.Scan_ВидыСпецификацийПродуктов.SPIIСпецификация Тогда
				СсылкаSPIIСпецификация = ВыборкаДетальныеЗаписи.Ссылка;
				ОпцииSPIIСпецификация.Загрузить(СсылкаSPIIСпецификация.РасшифровкаОпций.Выгрузить());
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ЗаполнитьТипыОпцийКромеБазовых() //rarus bonmak 08.10.2019 14177 ++
	Если НЕ ЭтаФорма.Модифицированность Тогда 
		Для Каждого СтрокаТаб Из Объект.РасшифровкаОпций Цикл
			Если СтрокаТаб.Опция.ТипОпции = Справочники.Scan_ТипыОпций.FFUОпции
				ИЛИ СтрокаТаб.Опция.ТипОпции = Справочники.Scan_ТипыОпций.SOrderОпции Тогда
				НоваяСтрока = ОпцииSOrderFFU.Добавить();
				НоваяСтрока.Опция = СтрокаТаб.Опция;
			ИначеЕсли СтрокаТаб.Опция.ТипОпции = Справочники.Scan_ТипыОпций.ОпцииНадстроек Тогда
				НоваяСтрока = ОпцииНадстройки.Добавить();
				НоваяСтрока.Опция = СтрокаТаб.Опция;
			ИначеЕсли СтрокаТаб.Опция.ТипОпции = Справочники.Scan_ТипыОпций.ОпцииОборудования Тогда
				НоваяСтрока = ОпцииОборудование.Добавить();
				НоваяСтрока.Опция = СтрокаТаб.Опция;
			//rarus agar 20.07.2020 16123 ++
			//ИначеЕсли СтрокаТаб.Опция.ТипОпции = Справочники.Scan_ТипыОпций.ОпцииУслуг Тогда
			//	НоваяСтрока = ОпцииПакетУслуг.Добавить();
			//	НоваяСтрока.Опция = СтрокаТаб.Опция;
			//rarus agar 20.07.2020 16123 --
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ОбновитьЗаписатьОпции() //rarus bonmak 08.10.2019 14177 ++
	Если ЭтаФорма.Модифицированность Тогда	
		Объект.РасшифровкаОпций.Очистить();		
		ДобавитьОпции(ОпцииSOrderFFU);
		ДобавитьОпции(ОпцииНадстройки);
		ДобавитьОпции(ОпцииОборудование);
		//ДобавитьОпции(ОпцииПакетУслуг); //rarus agar 20.07.2020 16123 +-
	КонецЕсли;	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --
		
&НаСервере
Процедура ДобавитьОпции(Таблица) //rarus bonmak 08.10.2019 14177 ++
	Для Каждого Стр Из Таблица Цикл
		Если НЕ Стр.Опция.Пустая() Тогда
			НоваяСтрока = Объект.РасшифровкаОпций.Добавить();
			НоваяСтрока.Опция = Стр.Опция;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ГруппаВидыОпцийПриСменеСтраницы(Элемент, ТекущаяСтраница) //rarus bonmak 08.10.2019 14177 --
	Если ТекущаяСтраница.Имя = "ГруппаБазовые" Тогда
		Элементы.ФормаОбновитьЭлемент.Доступность = Истина;	
	Иначе
		Элементы.ФормаОбновитьЭлемент.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//rarus bonmak 08.10.2019 14177 ++
	//обновим табличную часть, если пользователь изменил вручную состав опций
	ОбновитьЗаписатьОпции();
	//rarus bonmak 08.10.2019 14177 --
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
  
КонецПроцедуры


&НаСервере
Процедура ОбновитьПараметрыНаСервере() //rarus bonmak 08.10.2019 14177 ++
	Если НЕ Объект.Изделие.Пустая() Тогда 
		РегистрыСведений.Scan_ОпределяемыеПараметрыПоОпциямПродуктов.ОбновитьОпределяемыеПараметры(Объект.Изделие);
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --


&НаКлиенте
Процедура ОбновитьПараметры(Команда) //rarus bonmak 08.10.2019 14177 ++
	ОбновитьПараметрыНаСервере();
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

//rarus tenkam 18.10.2016 mantis 6897 --