// rarus tenkam 10.08.2020 mantis 16181 +++
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуСоставляющих();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСоставляющих()
	СкидкиНаценки.Очистить();
	
	// Цена по прайс-листу
	СтрокаЦенаПоПрайсЛисту = СкидкиНаценки.Добавить();
	СтрокаЦенаПоПрайсЛисту.СоставляющаяРасчетаСтрока = "Цена по прайс-листу";
	
	ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ЦенаДилера"));
	НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		СтрокаЦенаПоПрайсЛисту.ЦенаНаДилераСНДС = НайденныеСтроки[0].ЦенаСНДС;
		ИтогоЦенаНаДилераСНДС = СтрокаЦенаПоПрайсЛисту.ЦенаНаДилераСНДС;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ЦенаКлиента"));
	НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		СтрокаЦенаПоПрайсЛисту.ЦенаНаКлиентаСНДС = НайденныеСтроки[0].ЦенаСНДС;
		ИтогоЦенаНаКлиентаСНДС = СтрокаЦенаПоПрайсЛисту.ЦенаНаКлиентаСНДС;
	КонецЕсли;
	
	// СУ
	Если ЗначениеЗаполнено(Объект.СпециальныеУсловия) Тогда	
		СтрокаСУ = СкидкиНаценки.Добавить();
		СтрокаСУ.СоставляющаяРасчетаСтрока = "СУ";
		
		ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.СУDealerNet"));
		НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтрокаСУ.ЦенаНаДилераСНДС = НайденныеСтроки[0].ЦенаСНДС;
			ИтогоЦенаНаДилераСНДС = СтрокаСУ.ЦенаНаДилераСНДС;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.СкидкаСУDealerNet"));
		НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтрокаСУ.СкидкаНаценкаДилер = -НайденныеСтроки[0].ЦенаСНДС;
		КонецЕсли;		
		
		ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.СУRetailPrice"));
		НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтрокаСУ.ЦенаНаКлиентаСНДС = НайденныеСтроки[0].ЦенаСНДС;
			ИтогоЦенаНаКлиентаСНДС = СтрокаСУ.ЦенаНаКлиентаСНДС;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.СкидкаСУRetailPrice"));
		НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтрокаСУ.СкидкаНаценкаКлиент = -НайденныеСтроки[0].ЦенаСНДС;
		КонецЕсли; 		
		
	КонецЕсли;
	
	// rarus tenkam 31.03.2021 mantis 17419 +++
	ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ЦенаПоВалютнойОговорке"));
	НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.РазницаПоВалютнойОговорке"));
		НайденныеСтрокиРазница = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтрокиРазница.Количество() <> 0 Тогда
			Если НайденныеСтрокиРазница[0].ЦенаСНДС <> 0 Тогда
				// Добавим строку с валютной оговоркой
				СтрокаВалютнаяОговорка = СкидкиНаценки.Добавить();
				СтрокаВалютнаяОговорка.СоставляющаяРасчетаСтрока = "Валютная оговорка";
				
				СтрокаВалютнаяОговорка.ЦенаНаДилераСНДС = НайденныеСтроки[0].ЦенаСНДС;
				ИтогоЦенаНаДилераСНДС = СтрокаВалютнаяОговорка.ЦенаНаДилераСНДС;
				
				СтрокаВалютнаяОговорка.СкидкаНаценкаДилер = -НайденныеСтрокиРазница[0].ЦенаСНДС;
				
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;	
	// rarus tenkam 31.03.2021 mantis 17419 ---
	
	// Драйв
	ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ПроцентДрайва"));
	НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		
		СтрокаДрайв = СкидкиНаценки.Добавить();
		СтрокаДрайв.СоставляющаяРасчетаСтрока = "Драйв";
		
		ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ДрайвDealerNet"));
		НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтрокаДрайв.СкидкаНаценкаДилер = -НайденныеСтроки[0].ЦенаСНДС;
			СтрокаДрайв.ЦенаНаДилераСНДС = ИтогоЦенаНаДилераСНДС + СтрокаДрайв.СкидкаНаценкаДилер;
			ИтогоЦенаНаДилераСНДС = СтрокаДрайв.ЦенаНаДилераСНДС;
		КонецЕсли; 		
		
		ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ДрайвRetailPrice"));
		НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтрокаДрайв.СкидкаНаценкаКлиент = -НайденныеСтроки[0].ЦенаСНДС;
			СтрокаДрайв.ЦенаНаКлиентаСНДС = ИтогоЦенаНаКлиентаСНДС + СтрокаДрайв.СкидкаНаценкаКлиент;
			ИтогоЦенаНаКлиентаСНДС = СтрокаДрайв.ЦенаНаКлиентаСНДС;
		КонецЕсли; 		
	КонецЕсли;	
	
	// Логистические затраты
	ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ЛогистическиеЗатраты"));
	НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		
		СтрокаЛогистическиеЗатраты = СкидкиНаценки.Добавить();
		СтрокаЛогистическиеЗатраты.СоставляющаяРасчетаСтрока = "Логистические затраты";
		СтрокаЛогистическиеЗатраты.Комментарий = НайденныеСтроки[0].Комментарий;	// rarus tenkam 21.04.2021 mantis 17648 +
		
		СтрокаЛогистическиеЗатраты.СкидкаНаценкаДилер = НайденныеСтроки[0].ЦенаСНДС;
		СтрокаЛогистическиеЗатраты.ЦенаНаДилераСНДС = ИтогоЦенаНаДилераСНДС + СтрокаЛогистическиеЗатраты.СкидкаНаценкаДилер;
		ИтогоЦенаНаДилераСНДС = СтрокаЛогистическиеЗатраты.ЦенаНаДилераСНДС;
	КонецЕсли;
	
	// Компенсация
	ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.Компенсация"));
	НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		
		СтрокаКомпенсация = СкидкиНаценки.Добавить();
		СтрокаКомпенсация.СоставляющаяРасчетаСтрока = "Компенсация";
		СтрокаКомпенсация.Комментарий = НайденныеСтроки[0].Комментарий;	// rarus tenkam 21.04.2021 mantis 17648 +
		
		СтрокаКомпенсация.СкидкаНаценкаДилер = -НайденныеСтроки[0].ЦенаСНДС;
		СтрокаКомпенсация.ЦенаНаДилераСНДС = ИтогоЦенаНаДилераСНДС + СтрокаКомпенсация.СкидкаНаценкаДилер;
	    ИтогоЦенаНаДилераСНДС = СтрокаКомпенсация.ЦенаНаДилераСНДС;
	КонецЕсли; 	
	
	// rarus tenkam 21.04.2021 mantis 17648 +++
	// Изменение спецификации по инициативе завода
	ПараметрыОтбора = Новый Структура("СоставляющаяЦены", ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ИзменениеСпецификацииПоИнициативеЗавода"));
	НайденныеСтроки = Объект.СкидкиНаценки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		
		СтрокаИзменениеСпецификации = СкидкиНаценки.Добавить();
		СтрокаИзменениеСпецификации.СоставляющаяРасчетаСтрока = "Изменение спецификации по инициативе завода";
		СтрокаИзменениеСпецификации.Комментарий = НайденныеСтроки[0].Комментарий;	
		
		СтрокаИзменениеСпецификации.СкидкаНаценкаДилер = НайденныеСтроки[0].ЦенаСНДС;
		СтрокаИзменениеСпецификации.ЦенаНаДилераСНДС = ИтогоЦенаНаДилераСНДС + СтрокаИзменениеСпецификации.СкидкаНаценкаДилер;
	    ИтогоЦенаНаДилераСНДС = СтрокаИзменениеСпецификации.ЦенаНаДилераСНДС;
	КонецЕсли; 	                   	
	// rarus tenkam 21.04.2021 mantis 17648 ---
	
	//rarus vikhle 12.10.2020 mt 16181 +++
	ИтогоЦенаНаДилераСНДС  = Объект.ЦенаDealerNetСоСкидкой;
	ИтогоЦенаНаКлиентаСНДС = Объект.ЦенаRetailPriceСоСкидкой;
	//rarus vikhle 12.10.2020 mt 16181 ---	
	
	ИтогоСкидкаНаценкаДилер = СкидкиНаценки.Итог("СкидкаНаценкаДилер");
	ИтогоСкидкаНаценкаКлиент = СкидкиНаценки.Итог("СкидкаНаценкаКлиент");
	
КонецПроцедуры

// rarus tenkam 10.08.2020 mantis 16181 ---
